# -*- coding: utf-8 -*-

require "spec_helper"
require 'wareki'

describe Date do
  def date(str) Date.parse(str) end

  describe "Bunsei period" do
    it "should treat Bunsei date as Lunisolar calendar" do
      # 文政（ぶんせい）
      # http://ja.wikipedia.org/wiki/%E6%96%87%E6%94%BF
      # | 文政元年（戊寅）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月   | 八月 | 九月   | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦       | 1818/2/5  | 3/7    | 4/6  | 5/5    | 6/4    | 7/3  | 8/2    | 9/1  | 9/30   | 10/30 | 11/28  | 12/27    |           |
      # | 文政二年（己卯）   | 一月      | 二月   | 三月 | 四月   | 閏四月 | 五月 | 六月   | 七月 | 八月   | 九月  | 十月   | 十一月   | 十二月    |
      # | グレゴリオ暦       | 1819/1/26 | 2/24   | 3/26 | 4/24   | 5/24   | 6/22 | 7/22   | 8/21 | 9/19   | 10/19 | 11/18  | 12/17    | 1820/1/16 |
      # | 文政三年（庚辰）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月   | 八月 | 九月   | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦       | 1820/2/14 | 3/14   | 4/13 | 5/12   | 6/11   | 7/10 | 8/9    | 9/7  | 10/7   | 11/6  | 12/6   | 1821/1/4 |           |
      # | 文政四年（辛巳）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月   | 八月 | 九月   | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦       | 1821/2/3  | 3/4    | 4/3  | 5/2    | 5/31   | 6/30 | 7/29   | 8/28 | 9/26   | 10/26 | 11/25  | 12/24    |           |
      # | 文政五年（壬午）   | 一月      | 閏一月 | 二月 | 三月   | 四月   | 五月 | 六月   | 七月 | 八月   | 九月  | 十月   | 十一月   | 十二月    |
      # | グレゴリオ暦       | 1822/1/23 | 2/22   | 3/23 | 4/22   | 5/21   | 6/19 | 7/18   | 8/17 | 9/15   | 10/15 | 11/14  | 12/13    | 1823/1/12 |
      # | 文政六年（癸未）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月   | 八月 | 九月   | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦       | 1823/2/11 | 3/13   | 4/11 | 5/11   | 6/9    | 7/8  | 8/6    | 9/5  | 10/4   | 11/3  | 12/2   | 1824/1/1 |           |
      # | 文政七年（甲申）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月   | 八月 | 閏八月 | 九月  | 十月   | 十一月   | 十二月    |
      # | グレゴリオ暦       | 1824/1/31 | 3/1    | 3/31 | 4/29   | 5/28   | 6/27 | 7/26   | 8/24 | 9/23   | 10/22 | 11/21  | 12/20    | 1825/1/19 |
      # | 文政八年（乙酉）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月   | 八月 | 九月   | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦       | 1825/2/18 | 3/20   | 4/18 | 5/18   | 6/16   | 7/16 | 8/14   | 9/13 | 10/12  | 11/10 | 12/10  | 1826/1/8 |           |
      # | 文政九年（丙戌）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月   | 八月 | 九月   | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦       | 1826/2/7  | 3/9    | 4/7  | 5/7    | 6/6    | 7/5  | 8/4    | 9/2  | 10/2   | 10/31 | 11/29  | 12/29    |           |
      # | 文政十年（丁亥）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 閏六月 | 七月 | 八月   | 九月  | 十月   | 十一月   | 十二月    |
      # | グレゴリオ暦       | 1827/1/27 | 2/26   | 3/27 | 4/26   | 5/26   | 6/24 | 7/24   | 8/22 | 9/21   | 10/21 | 11/19  | 12/18    | 1828/1/17 |
      # | 文政十一年（戊子） | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月   | 八月 | 九月   | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦       | 1828/2/15 | 3/16   | 4/14 | 5/14   | 6/12   | 7/12 | 8/11   | 9/9  | 10/9   | 11/7  | 12/7   | 1829/1/6 |           |
      # | 文政十二年（己丑） | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月   | 八月 | 九月   | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦       | 1829/2/4  | 3/5    | 4/4  | 5/3    | 6/2    | 7/1  | 7/31   | 8/29 | 9/28   | 10/28 | 11/26  | 12/26    |           |
      # | 文政十三年（庚寅） | 一月      | 二月   | 三月 | 閏三月 | 四月   | 五月 | 六月   | 七月 | 八月   | 九月  | 十月   | 十一月   | 十二月    |
      # | グレゴリオ暦       | 1830/1/25 | 2/23   | 3/24 | 4/23   | 5/22   | 6/21 | 7/20   | 8/18 | 9/17   | 10/17 | 11/15  | 12/15    | 1831/1/14 |

      Wareki::Date.parse("bunsei01.01.01").should be_date("1818-02-05")
      Wareki::Date.parse("bunsei01.12.01").should be_date("1818-12-27")
      Wareki::Date.parse("bunsei02.04.01").should be_date("1819-04-24")
      Wareki::Date.parse("bunsei02.12.01").should be_date("1820-01-16")
      Wareki::Date.parse("bunsei13.12.01").should be_date("1831-01-14")
    end
  end
end
