# -*- coding: utf-8 -*-

require "spec_helper"
require 'wareki'

describe Date do
  def date(str) Date.parse(str) end

  describe "Kaei period" do
    it "should treat Kaei date as Lunisolar calendar" do
      # http://ja.wikipedia.org/wiki/%E5%98%89%E6%B0%B8
      # 嘉永元年（戊申）      一月     二月     三月     四月     五月     六月     七月     八月     九月      十月     十一月     十二月     
      # グレゴリオ暦      1848/2/5      3/5      4/4      5/3      6/1      7/1     7/30     8/29     9/27     10/27      11/26      12/26     
      # 嘉永二年（己酉）      一月     二月     三月     四月   閏四月     五月     六月     七月     八月      九月       十月     十一月     十二月 
      # グレゴリオ暦     1849/1/24     2/23     3/24     4/23     5/22     6/20     7/20     8/18     9/17     10/16      11/15      12/15     1850/1/13 
      # 嘉永三年（庚戌）      一月     二月     三月     四月     五月     六月     七月     八月     九月      十月     十一月     十二月     
      # グレゴリオ暦     1850/2/12     3/14     4/12     5/12     6/10      7/9      8/8      9/6     10/6      11/4       12/4   1851/1/2     
      # 嘉永四年（辛亥）      一月     二月     三月     四月     五月     六月     七月     八月     九月      十月     十一月     十二月     
      # グレゴリオ暦      1851/2/1      3/3      4/2      5/1     5/31     6/29     7/28     8/27     9/25     10/25      11/23      12/23     
      # 嘉永五年（壬子）      一月     二月   閏二月     三月     四月     五月     六月     七月     八月      九月       十月     十一月     十二月 
      # グレゴリオ暦     1852/1/21     2/20     3/21     4/19     5/19     6/18     7/17     8/15     9/14     10/13      11/12      12/11     1853/1/10 
      # 嘉永六年（癸丑）      一月     二月     三月     四月     五月     六月     七月     八月     九月      十月     十一月     十二月     
      # グレゴリオ暦      1853/2/8     3/10      4/8      5/8      6/7      7/6      8/5      9/3     10/3      11/1       12/1      12/30     
      # 嘉永七年（甲寅）      一月     二月     三月     四月     五月     六月     七月   閏七月     八月      九月       十月     十一月     十二月 
      # グレゴリオ暦     1854/1/29     2/27     3/29     4/27     5/27     6/25     7/25     8/24     9/22     10/22      11/20      12/20     1855/1/18 

      Wareki::Date.parse("kaei01.01.01").should be_date("1848-02-05")
      Wareki::Date.parse("kaei01.12.01").should be_date("1848-12-26")
      Wareki::Date.parse("kaei02.04.01").should be_date("1849-04-23")
      Wareki::Date.parse("kaei02.12.01").should be_date("1850-01-13")
      Wareki::Date.parse("kaei07.12.01").should be_date("1855-01-18")
    end
  end
end
