# -*- coding: utf-8 -*-

require "spec_helper"
require 'wareki'

describe Date do
  def date(str) Date.parse(str) end

  describe "Koka period" do
    it "should treat Koka date as Lunisolar calendar" do
      # http://ja.wikipedia.org/wiki/%E5%BC%98%E5%8C%96
      # | 弘化元年（甲辰） | 一月      | 二月 | 三月 | 四月 | 五月 | 六月   | 七月 | 八月 | 九月  | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦     | 1844/2/18 | 3/19 | 4/18 | 5/17 | 6/16 | 7/15   | 8/14 | 9/12 | 10/12 | 11/10 | 12/10  | 1845/1/8 |           |
      # | 弘化二年（乙巳） | 一月      | 二月 | 三月 | 四月 | 五月 | 六月   | 七月 | 八月 | 九月  | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦     | 1845/2/7  | 3/8  | 4/7  | 5/6  | 6/5  | 7/5    | 8/3  | 9/2  | 10/1  | 10/31 | 11/29  | 12/29    |           |
      # | 弘化三年（丙午） | 一月      | 二月 | 三月 | 四月 | 五月 | 閏五月 | 六月 | 七月 | 八月  | 九月  | 十月   | 十一月   | 十二月    |
      # | グレゴリオ暦     | 1846/1/27 | 2/26 | 3/27 | 4/26 | 5/25 | 6/24   | 7/23 | 8/22 | 9/21  | 10/20 | 11/19  | 12/18    | 1847/1/17 |
      # | 弘化四年（丁未） | 一月      | 二月 | 三月 | 四月 | 五月 | 六月   | 七月 | 八月 | 九月  | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦     | 1847/2/15 | 3/17 | 4/15 | 5/15 | 6/13 | 7/12   | 8/11 | 9/10 | 10/9  | 11/8  | 12/8   | 1848/1/6 |           |
      # | 弘化五年（戊申） | 一月      | 二月 | 三月 | 四月 | 五月 | 六月   | 七月 | 八月 | 九月  | 十月  | 十一月 | 十二月   |           |
      # | グレゴリオ暦     | 1848/2/5  | 3/5  | 4/4  | 5/3  | 6/1  | 7/1    | 7/30 | 8/29 | 9/27  | 10/27 | 11/26  | 12/26    |           |

      Wareki::Date.parse("koka01.01.01").should be_date("1844-02-18")
      Wareki::Date.parse("koka01.12.01").should be_date("1845-01-08")
      Wareki::Date.parse("koka02.04.01").should be_date("1845-05-06")
      Wareki::Date.parse("koka02.12.01").should be_date("1845-12-29")
      Wareki::Date.parse("koka05.12.01").should be_date("1848-12-26")
    end
  end
end
