# -*- coding: utf-8 -*-

require "spec_helper"
require 'wareki'

describe Date do
  def date(str) Date.parse(str) end

  describe "Tenpo period" do
    it "should treat Tenpo date as Lunisolar calendar" do
      # 天保（てんぽう）
      # http://ja.wikipedia.org/wiki/%E5%A4%A9%E4%BF%9D
      # | 天保元年（庚寅）   | 一月      | 二月   | 三月 | 閏三月 | 四月   | 五月 | 六月 | 七月   | 八月  | 九月   | 十月   | 十一月    | 十二月    |
      # | グレゴリオ暦       | 1830/1/25 | 2/23   | 3/24 | 4/23   | 5/22   | 6/21 | 7/20 | 8/18   | 9/17  | 10/17  | 11/15  | 12/15     | 1831/1/14 |
      # | 天保二年（辛卯）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 十月   | 十一月 | 十二月    |           |
      # | グレゴリオ暦       | 1831/2/13 | 3/14   | 4/13 | 5/12   | 6/10   | 7/9  | 8/8  | 9/6    | 10/6  | 11/4   | 12/4   | 1832/1/3  |           |
      # | 天保三年（壬辰）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 十月   | 十一月 | 閏十一月  | 十二月    |
      # | グレゴリオ暦       | 1832/2/2  | 3/3    | 4/1  | 5/1    | 5/30   | 6/28 | 7/27 | 8/26   | 9/24  | 10/24  | 11/22  | 12/22     | 1833/1/21 |
      # | 天保四年（癸巳）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 十月   | 十一月 | 十二月    |           |
      # | グレゴリオ暦       | 1833/2/20 | 3/21   | 4/20 | 5/19   | 6/18   | 7/17 | 8/15 | 9/14   | 10/13 | 11/12  | 12/11  | 1834/1/10 |           |
      # | 天保五年（甲午）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 十月   | 十一月 | 十二月    |           |
      # | グレゴリオ暦       | 1834/2/9  | 3/10   | 4/9  | 5/9    | 6/7    | 7/7  | 8/5  | 9/3    | 10/3  | 11/1   | 12/1   | 12/30     |           |
      # | 天保六年（乙未）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 閏七月 | 八月  | 九月   | 十月   | 十一月    | 十二月    |
      # | グレゴリオ暦       | 1835/1/29 | 2/27   | 3/29 | 4/28   | 5/27   | 6/26 | 7/26 | 8/24   | 9/22  | 10/22  | 11/20  | 12/20     | 1836/1/18 |
      # | 天保七年（丙申）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 十月   | 十一月 | 十二月    |           |
      # | グレゴリオ暦       | 1836/2/17 | 3/17   | 4/16 | 5/15   | 6/14   | 7/14 | 8/12 | 9/11   | 10/10 | 11/9   | 12/8   | 1837/1/7  |           |
      # | 天保八年（丁酉）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 十月   | 十一月 | 十二月    |           |
      # | グレゴリオ暦       | 1837/2/5  | 3/7    | 4/5  | 5/5    | 6/3    | 7/3  | 8/1  | 8/31   | 9/30  | 10/29  | 11/28  | 12/27     |           |
      # | 天保九年（戊戌）   | 一月      | 二月   | 三月 | 四月   | 閏四月 | 五月 | 六月 | 七月   | 八月  | 九月   | 十月   | 十一月    | 十二月    |
      # | グレゴリオ暦       | 1838/1/26 | 2/24   | 3/26 | 4/24   | 5/24   | 6/22 | 7/21 | 8/20   | 9/19  | 10/18  | 11/17  | 12/17     | 1839/1/15 |
      # | 天保十年（己亥）   | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 十月   | 十一月 | 十二月    |           |
      # | グレゴリオ暦       | 1839/2/14 | 3/15   | 4/14 | 5/13   | 6/11   | 7/11 | 8/9  | 9/8    | 10/7  | 11/6   | 12/6   | 1840/1/5  |           |
      # | 天保十一年（庚子） | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 十月   | 十一月 | 十二月    |           |
      # | グレゴリオ暦       | 1840/2/3  | 3/4    | 4/3  | 5/2    | 5/31   | 6/29 | 7/29 | 8/27   | 9/26  | 10/25  | 11/24  | 12/24     |           |
      # | 天保十二年（辛丑） | 一月      | 閏一月 | 二月 | 三月   | 四月   | 五月 | 六月 | 七月   | 八月  | 九月   | 十月   | 十一月    | 十二月    |
      # | グレゴリオ暦       | 1841/1/23 | 2/21   | 3/23 | 4/21   | 5/21   | 6/19 | 7/18 | 8/17   | 9/15  | 10/15  | 11/13  | 12/13     | 1842/1/12 |
      # | 天保十三年（壬寅） | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 十月   | 十一月 | 十二月    |           |
      # | グレゴリオ暦       | 1842/2/10 | 3/12   | 4/11 | 5/10   | 6/9    | 7/8  | 8/6  | 9/5    | 10/4  | 11/3   | 12/2   | 1843/1/1  |           |
      # | 天保十四年（癸卯） | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 閏九月 | 十月   | 十一月    | 十二月    |
      # | グレゴリオ暦       | 1843/1/30 | 3/1    | 3/31 | 4/30   | 5/29   | 6/28 | 7/27 | 8/25   | 9/24  | 10/23  | 11/22  | 12/21     | 1844/1/20 |
      # | 天保十五年（甲辰） | 一月      | 二月   | 三月 | 四月   | 五月   | 六月 | 七月 | 八月   | 九月  | 十月   | 十一月 | 十二月    |           |
      # | グレゴリオ暦       | 1844/2/18 | 3/19   | 4/18 | 5/17   | 6/16   | 7/15 | 8/14 | 9/12   | 10/12 | 11/10  | 12/10  | 1845/1/8  |           |

      Wareki::Date.parse("tenpo01.01.01").should be_date("1830-01-25")
      Wareki::Date.parse("tenpo01.12.01").should be_date("1831-01-14")
      Wareki::Date.parse("tenpo02.04.01").should be_date("1831-05-12")
      Wareki::Date.parse("tenpo02.12.01").should be_date("1832-01-03")
      Wareki::Date.parse("tenpo15.12.01").should be_date("1845-01-08")
    end
  end
end
