# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'ansei' # あんせい
    # KANJI_ERA_NAME = '安政'

    # http://ja.wikipedia.org/wiki/%E5%AE%89%E6%94%BF
    # 安政元年（甲寅）      一月     二月     三月       四月     五月     六月     七月   閏七月     八月      九月      十月       十一月        十二月 
    # グレゴリオ暦     1854/1/29     2/27     3/29       4/27     5/27     6/25     7/25     8/24     9/22     10/22     11/20        12/20     1855/1/18 
    # 安政二年（乙卯）      一月     二月     三月       四月     五月     六月     七月     八月     九月      十月    十一月       十二月     
    # グレゴリオ暦     1855/2/17     3/18     4/17       5/16     6/14     7/14     8/13     9/11    10/11     11/10      12/9     1856/1/8     
    # 安政三年（丙辰）      一月     二月     三月       四月     五月     六月     七月     八月     九月      十月    十一月       十二月     
    # グレゴリオ暦     1856/2/6       3/7      4/5        5/4      6/3      7/2      8/1     8/30     9/29     10/29     11/28        12/27     
    # 安政四年（丁巳）      一月     二月     三月       四月     五月   閏五月     六月     七月     八月      九月      十月       十一月        十二月 
    # グレゴリオ暦     1857/1/26     2/24     3/26       4/24     5/23     6/22     7/21     8/20     9/18     10/18     11/17        12/16     1858/1/15 
    # 安政五年（戊午）      一月     二月     三月       四月     五月     六月     七月     八月     九月      十月    十一月       十二月     
    # グレゴリオ暦     1858/2/14     3/15     4/14       5/13     6/11     7/11      8/9      9/7     10/7      11/6      12/5     1859/1/4     
    # 安政六年（己未）      一月     二月     三月       四月     五月     六月     七月     八月     九月      十月    十一月       十二月     
    # グレゴリオ暦     1859/2/3       3/5      4/3        5/3      6/1     6/30     7/30     8/28     9/26     10/26     11/24        12/24     
    # 安政七年（庚申）      一月     二月     三月     閏三月     四月     五月     六月     七月     八月      九月      十月       十一月        十二月 
    # グレゴリオ暦     1860/1/23     2/22     3/22       4/21     5/21     6/19     7/18     8/17     9/15     10/14     11/13        12/12     1861/1/11 

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :ansei, :e_y => 1, :e_m => 1, :g_y => 1854, :g_m => 1, :g_d => 29},
             {:era => :ansei, :e_y => 1, :e_m => 2, :g_y => 1854, :g_m => 2, :g_d => 27},
             {:era => :ansei, :e_y => 1, :e_m => 3, :g_y => 1854, :g_m => 3, :g_d => 29},
             {:era => :ansei, :e_y => 1, :e_m => 4, :g_y => 1854, :g_m => 4, :g_d => 27},
             {:era => :ansei, :e_y => 1, :e_m => 5, :g_y => 1854, :g_m => 5, :g_d => 27},
             {:era => :ansei, :e_y => 1, :e_m => 6, :g_y => 1854, :g_m => 6, :g_d => 25},
             {:era => :ansei, :e_y => 1, :e_m => 7, :g_y => 1854, :g_m => 7, :g_d => 25},
             {:era => :ansei, :e_y => 1, :e_m => 7, :g_y => 1854, :g_m => 8, :g_d => 24, :leap_month => true},
             {:era => :ansei, :e_y => 1, :e_m => 8, :g_y => 1854, :g_m => 9, :g_d => 22},
             {:era => :ansei, :e_y => 1, :e_m => 9, :g_y => 1854, :g_m => 10, :g_d => 22},
             {:era => :ansei, :e_y => 1, :e_m => 10, :g_y => 1854, :g_m => 11, :g_d => 20},
             {:era => :ansei, :e_y => 1, :e_m => 11, :g_y => 1854, :g_m => 12, :g_d => 20},
             {:era => :ansei, :e_y => 1, :e_m => 12, :g_y => 1855, :g_m => 1, :g_d => 18},

             {:era => :ansei, :e_y => 2, :e_m => 1, :g_y => 1855, :g_m => 2, :g_d => 17},
             {:era => :ansei, :e_y => 2, :e_m => 2, :g_y => 1855, :g_m => 3, :g_d => 18},
             {:era => :ansei, :e_y => 2, :e_m => 3, :g_y => 1855, :g_m => 4, :g_d => 17},
             {:era => :ansei, :e_y => 2, :e_m => 4, :g_y => 1855, :g_m => 5, :g_d => 16},
             {:era => :ansei, :e_y => 2, :e_m => 5, :g_y => 1855, :g_m => 6, :g_d => 14},
             {:era => :ansei, :e_y => 2, :e_m => 6, :g_y => 1855, :g_m => 7, :g_d => 14},
             {:era => :ansei, :e_y => 2, :e_m => 7, :g_y => 1855, :g_m => 8, :g_d => 13},
             {:era => :ansei, :e_y => 2, :e_m => 8, :g_y => 1855, :g_m => 9, :g_d => 11},
             {:era => :ansei, :e_y => 2, :e_m => 9, :g_y => 1855, :g_m => 10, :g_d => 11},
             {:era => :ansei, :e_y => 2, :e_m => 10, :g_y => 1855, :g_m => 11, :g_d => 10},
             {:era => :ansei, :e_y => 2, :e_m => 11, :g_y => 1855, :g_m => 12, :g_d => 9},
             {:era => :ansei, :e_y => 2, :e_m => 12, :g_y => 1856, :g_m => 1, :g_d => 8},

             {:era => :ansei, :e_y => 3, :e_m => 1, :g_y => 1856, :g_m => 2, :g_d => 6},
             {:era => :ansei, :e_y => 3, :e_m => 2, :g_y => 1856, :g_m => 3, :g_d => 7},
             {:era => :ansei, :e_y => 3, :e_m => 3, :g_y => 1856, :g_m => 4, :g_d => 5},
             {:era => :ansei, :e_y => 3, :e_m => 4, :g_y => 1856, :g_m => 5, :g_d => 4},
             {:era => :ansei, :e_y => 3, :e_m => 5, :g_y => 1856, :g_m => 6, :g_d => 3},
             {:era => :ansei, :e_y => 3, :e_m => 6, :g_y => 1856, :g_m => 7, :g_d => 2},
             {:era => :ansei, :e_y => 3, :e_m => 7, :g_y => 1856, :g_m => 8, :g_d => 1},
             {:era => :ansei, :e_y => 3, :e_m => 8, :g_y => 1856, :g_m => 8, :g_d => 30},
             {:era => :ansei, :e_y => 3, :e_m => 9, :g_y => 1856, :g_m => 9, :g_d => 29},
             {:era => :ansei, :e_y => 3, :e_m => 10, :g_y => 1856, :g_m => 10, :g_d => 29},
             {:era => :ansei, :e_y => 3, :e_m => 11, :g_y => 1856, :g_m => 11, :g_d => 28},
             {:era => :ansei, :e_y => 3, :e_m => 12, :g_y => 1856, :g_m => 12, :g_d => 27},

             {:era => :ansei, :e_y => 4, :e_m => 1, :g_y => 1857, :g_m => 1, :g_d => 26},
             {:era => :ansei, :e_y => 4, :e_m => 2, :g_y => 1857, :g_m => 2, :g_d => 24},
             {:era => :ansei, :e_y => 4, :e_m => 3, :g_y => 1857, :g_m => 3, :g_d => 26},
             {:era => :ansei, :e_y => 4, :e_m => 4, :g_y => 1857, :g_m => 4, :g_d => 24},
             {:era => :ansei, :e_y => 4, :e_m => 5, :g_y => 1857, :g_m => 5, :g_d => 23},
             {:era => :ansei, :e_y => 4, :e_m => 5, :g_y => 1857, :g_m => 6, :g_d => 22, :leap_month => true},
             {:era => :ansei, :e_y => 4, :e_m => 6, :g_y => 1857, :g_m => 7, :g_d => 21},
             {:era => :ansei, :e_y => 4, :e_m => 7, :g_y => 1857, :g_m => 8, :g_d => 20},
             {:era => :ansei, :e_y => 4, :e_m => 8, :g_y => 1857, :g_m => 9, :g_d => 18},
             {:era => :ansei, :e_y => 4, :e_m => 9,  :g_y => 1857, :g_m => 10, :g_d => 18},
             {:era => :ansei, :e_y => 4, :e_m => 10, :g_y => 1857, :g_m => 11, :g_d => 17},
             {:era => :ansei, :e_y => 4, :e_m => 11, :g_y => 1857, :g_m => 12, :g_d => 16},
             {:era => :ansei, :e_y => 4, :e_m => 12, :g_y => 1858, :g_m => 1, :g_d => 15},

             {:era => :ansei, :e_y => 5, :e_m => 1, :g_y => 1858, :g_m => 2, :g_d => 14},
             {:era => :ansei, :e_y => 5, :e_m => 2, :g_y => 1858, :g_m => 3, :g_d => 15},
             {:era => :ansei, :e_y => 5, :e_m => 3, :g_y => 1858, :g_m => 4, :g_d => 14},
             {:era => :ansei, :e_y => 5, :e_m => 4, :g_y => 1858, :g_m => 5, :g_d => 13},
             {:era => :ansei, :e_y => 5, :e_m => 5, :g_y => 1858, :g_m => 6, :g_d => 11},
             {:era => :ansei, :e_y => 5, :e_m => 6, :g_y => 1858, :g_m => 7, :g_d => 11},
             {:era => :ansei, :e_y => 5, :e_m => 7, :g_y => 1858, :g_m => 8, :g_d => 9},
             {:era => :ansei, :e_y => 5, :e_m => 8, :g_y => 1858, :g_m => 9, :g_d => 7},
             {:era => :ansei, :e_y => 5, :e_m => 9, :g_y => 1858, :g_m => 10, :g_d => 7},
             {:era => :ansei, :e_y => 5, :e_m => 10, :g_y => 1858, :g_m => 11, :g_d => 6},
             {:era => :ansei, :e_y => 5, :e_m => 11, :g_y => 1858, :g_m => 12, :g_d => 5},
             {:era => :ansei, :e_y => 5, :e_m => 12, :g_y => 1859, :g_m => 1, :g_d => 4},

             {:era => :ansei, :e_y => 6, :e_m => 1, :g_y => 1859, :g_m => 2, :g_d => 3},
             {:era => :ansei, :e_y => 6, :e_m => 2, :g_y => 1859, :g_m => 3, :g_d => 5},
             {:era => :ansei, :e_y => 6, :e_m => 3, :g_y => 1859, :g_m => 4, :g_d => 3},
             {:era => :ansei, :e_y => 6, :e_m => 4, :g_y => 1859, :g_m => 5, :g_d => 3},
             {:era => :ansei, :e_y => 6, :e_m => 5, :g_y => 1859, :g_m => 6, :g_d => 1},
             {:era => :ansei, :e_y => 6, :e_m => 6, :g_y => 1859, :g_m => 6, :g_d => 30},
             {:era => :ansei, :e_y => 6, :e_m => 7, :g_y => 1859, :g_m => 7, :g_d => 30},
             {:era => :ansei, :e_y => 6, :e_m => 8, :g_y => 1859, :g_m => 8, :g_d => 28},
             {:era => :ansei, :e_y => 6, :e_m => 9, :g_y => 1859, :g_m => 9, :g_d => 26},
             {:era => :ansei, :e_y => 6, :e_m => 10, :g_y => 1859, :g_m => 10, :g_d => 26},
             {:era => :ansei, :e_y => 6, :e_m => 11, :g_y => 1859, :g_m => 11, :g_d => 24},
             {:era => :ansei, :e_y => 6, :e_m => 12, :g_y => 1859, :g_m => 12, :g_d => 24},

             {:era => :ansei, :e_y => 7, :e_m => 1,  :g_y => 1860, :g_m => 1, :g_d => 23},
             {:era => :ansei, :e_y => 7, :e_m => 2,  :g_y => 1860, :g_m => 2, :g_d => 22},
             {:era => :ansei, :e_y => 7, :e_m => 3,  :g_y => 1860, :g_m => 3, :g_d => 22},
             {:era => :ansei, :e_y => 7, :e_m => 3,  :g_y => 1860, :g_m => 4, :g_d => 21, :leap_month => true},
             {:era => :ansei, :e_y => 7, :e_m => 4,  :g_y => 1860, :g_m => 5, :g_d => 21},
             {:era => :ansei, :e_y => 7, :e_m => 5,  :g_y => 1860, :g_m => 6, :g_d => 19},
             {:era => :ansei, :e_y => 7, :e_m => 6,  :g_y => 1860, :g_m => 7, :g_d => 18},
             {:era => :ansei, :e_y => 7, :e_m => 7,  :g_y => 1860, :g_m => 8, :g_d => 17},
             {:era => :ansei, :e_y => 7, :e_m => 8,  :g_y => 1860, :g_m => 9, :g_d => 15},
             {:era => :ansei, :e_y => 7, :e_m => 9,  :g_y => 1860, :g_m => 10, :g_d => 14},
             {:era => :ansei, :e_y => 7, :e_m => 10, :g_y => 1860, :g_m => 11, :g_d => 13},
             {:era => :ansei, :e_y => 7, :e_m => 11, :g_y => 1860, :g_m => 12, :g_d => 12},
             {:era => :ansei, :e_y => 7, :e_m => 12, :g_y => 1861, :g_m => 1, :g_d => 11},
            ]
    add_era_table table
  end # Date
end # Wareki
