# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Ansei' # 
    # KANJI_ERA_NAME = '安政'

    # 安政
    # http://ja.wikipedia.org/wiki/%E5%AE%89%E6%94%BF
    # | 安政元年 (甲寅)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |     閏七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1854/01/29 | 1854/02/27 | 1854/03/29 | 1854/04/27 | 1854/05/27 | 1854/06/25 | 1854/07/25 | 1854/08/24 | 1854/09/22 | 1854/10/22 | 1854/11/20 | 1854/12/20 | 1855/01/18 |
    # | 安政二年 (乙卯)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1855/02/17 | 1855/03/18 | 1855/04/17 | 1855/05/16 | 1855/06/14 | 1855/07/14 | 1855/08/13 | 1855/09/11 | 1855/10/11 | 1855/11/10 | 1855/12/09 | 1856/01/08 |
    # | 安政三年 (丙辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1856/02/06 | 1856/03/07 | 1856/04/05 | 1856/05/04 | 1856/06/03 | 1856/07/02 | 1856/08/01 | 1856/08/30 | 1856/09/29 | 1856/10/29 | 1856/11/28 | 1856/12/27 |
    # | 安政四年 (丁巳)     |       一月 |       二月 |       三月 |       四月 |       五月 |     閏五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1857/01/26 | 1857/02/24 | 1857/03/26 | 1857/04/24 | 1857/05/23 | 1857/06/22 | 1857/07/21 | 1857/08/20 | 1857/09/18 | 1857/10/18 | 1857/11/17 | 1857/12/16 | 1858/01/15 |
    # | 安政五年 (戊午)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1858/02/14 | 1858/03/15 | 1858/04/14 | 1858/05/13 | 1858/06/11 | 1858/07/11 | 1858/08/09 | 1858/09/07 | 1858/10/07 | 1858/11/06 | 1858/12/05 | 1859/01/04 |
    # | 安政六年 (己未)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1859/02/03 | 1859/03/05 | 1859/04/03 | 1859/05/03 | 1859/06/01 | 1859/06/30 | 1859/07/30 | 1859/08/28 | 1859/09/26 | 1859/10/26 | 1859/11/24 | 1859/12/24 |
    # | 安政七年 (庚申)     |       一月 |       二月 |       三月 |     閏三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1860/01/23 | 1860/02/22 | 1860/03/22 | 1860/04/21 | 1860/05/21 | 1860/06/19 | 1860/07/18 | 1860/08/17 | 1860/09/15 | 1860/10/14 | 1860/11/13 | 1860/12/12 | 1861/01/11 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :ansei, :e_y =>  1, :e_m =>  1, :g_y => 1854, :g_m =>  1, :g_d => 29},
             {:era => :ansei, :e_y =>  1, :e_m =>  2, :g_y => 1854, :g_m =>  2, :g_d => 27},
             {:era => :ansei, :e_y =>  1, :e_m =>  3, :g_y => 1854, :g_m =>  3, :g_d => 29},
             {:era => :ansei, :e_y =>  1, :e_m =>  4, :g_y => 1854, :g_m =>  4, :g_d => 27},
             {:era => :ansei, :e_y =>  1, :e_m =>  5, :g_y => 1854, :g_m =>  5, :g_d => 27},
             {:era => :ansei, :e_y =>  1, :e_m =>  6, :g_y => 1854, :g_m =>  6, :g_d => 25},
             {:era => :ansei, :e_y =>  1, :e_m =>  7, :g_y => 1854, :g_m =>  7, :g_d => 25},
             {:era => :ansei, :e_y =>  1, :e_m =>  7, :g_y => 1854, :g_m =>  8, :g_d => 24, :leap_month => true},
             {:era => :ansei, :e_y =>  1, :e_m =>  8, :g_y => 1854, :g_m =>  9, :g_d => 22},
             {:era => :ansei, :e_y =>  1, :e_m =>  9, :g_y => 1854, :g_m => 10, :g_d => 22},
             {:era => :ansei, :e_y =>  1, :e_m => 10, :g_y => 1854, :g_m => 11, :g_d => 20},
             {:era => :ansei, :e_y =>  1, :e_m => 11, :g_y => 1854, :g_m => 12, :g_d => 20},
             {:era => :ansei, :e_y =>  1, :e_m => 12, :g_y => 1855, :g_m =>  1, :g_d => 18},

             {:era => :ansei, :e_y =>  2, :e_m =>  1, :g_y => 1855, :g_m =>  2, :g_d => 17},
             {:era => :ansei, :e_y =>  2, :e_m =>  2, :g_y => 1855, :g_m =>  3, :g_d => 18},
             {:era => :ansei, :e_y =>  2, :e_m =>  3, :g_y => 1855, :g_m =>  4, :g_d => 17},
             {:era => :ansei, :e_y =>  2, :e_m =>  4, :g_y => 1855, :g_m =>  5, :g_d => 16},
             {:era => :ansei, :e_y =>  2, :e_m =>  5, :g_y => 1855, :g_m =>  6, :g_d => 14},
             {:era => :ansei, :e_y =>  2, :e_m =>  6, :g_y => 1855, :g_m =>  7, :g_d => 14},
             {:era => :ansei, :e_y =>  2, :e_m =>  7, :g_y => 1855, :g_m =>  8, :g_d => 13},
             {:era => :ansei, :e_y =>  2, :e_m =>  8, :g_y => 1855, :g_m =>  9, :g_d => 11},
             {:era => :ansei, :e_y =>  2, :e_m =>  9, :g_y => 1855, :g_m => 10, :g_d => 11},
             {:era => :ansei, :e_y =>  2, :e_m => 10, :g_y => 1855, :g_m => 11, :g_d => 10},
             {:era => :ansei, :e_y =>  2, :e_m => 11, :g_y => 1855, :g_m => 12, :g_d =>  9},
             {:era => :ansei, :e_y =>  2, :e_m => 12, :g_y => 1856, :g_m =>  1, :g_d =>  8},

             {:era => :ansei, :e_y =>  3, :e_m =>  1, :g_y => 1856, :g_m =>  2, :g_d =>  6},
             {:era => :ansei, :e_y =>  3, :e_m =>  2, :g_y => 1856, :g_m =>  3, :g_d =>  7},
             {:era => :ansei, :e_y =>  3, :e_m =>  3, :g_y => 1856, :g_m =>  4, :g_d =>  5},
             {:era => :ansei, :e_y =>  3, :e_m =>  4, :g_y => 1856, :g_m =>  5, :g_d =>  4},
             {:era => :ansei, :e_y =>  3, :e_m =>  5, :g_y => 1856, :g_m =>  6, :g_d =>  3},
             {:era => :ansei, :e_y =>  3, :e_m =>  6, :g_y => 1856, :g_m =>  7, :g_d =>  2},
             {:era => :ansei, :e_y =>  3, :e_m =>  7, :g_y => 1856, :g_m =>  8, :g_d =>  1},
             {:era => :ansei, :e_y =>  3, :e_m =>  8, :g_y => 1856, :g_m =>  8, :g_d => 30},
             {:era => :ansei, :e_y =>  3, :e_m =>  9, :g_y => 1856, :g_m =>  9, :g_d => 29},
             {:era => :ansei, :e_y =>  3, :e_m => 10, :g_y => 1856, :g_m => 10, :g_d => 29},
             {:era => :ansei, :e_y =>  3, :e_m => 11, :g_y => 1856, :g_m => 11, :g_d => 28},
             {:era => :ansei, :e_y =>  3, :e_m => 12, :g_y => 1856, :g_m => 12, :g_d => 27},

             {:era => :ansei, :e_y =>  4, :e_m =>  1, :g_y => 1857, :g_m =>  1, :g_d => 26},
             {:era => :ansei, :e_y =>  4, :e_m =>  2, :g_y => 1857, :g_m =>  2, :g_d => 24},
             {:era => :ansei, :e_y =>  4, :e_m =>  3, :g_y => 1857, :g_m =>  3, :g_d => 26},
             {:era => :ansei, :e_y =>  4, :e_m =>  4, :g_y => 1857, :g_m =>  4, :g_d => 24},
             {:era => :ansei, :e_y =>  4, :e_m =>  5, :g_y => 1857, :g_m =>  5, :g_d => 23},
             {:era => :ansei, :e_y =>  4, :e_m =>  5, :g_y => 1857, :g_m =>  6, :g_d => 22, :leap_month => true},
             {:era => :ansei, :e_y =>  4, :e_m =>  6, :g_y => 1857, :g_m =>  7, :g_d => 21},
             {:era => :ansei, :e_y =>  4, :e_m =>  7, :g_y => 1857, :g_m =>  8, :g_d => 20},
             {:era => :ansei, :e_y =>  4, :e_m =>  8, :g_y => 1857, :g_m =>  9, :g_d => 18},
             {:era => :ansei, :e_y =>  4, :e_m =>  9, :g_y => 1857, :g_m => 10, :g_d => 18},
             {:era => :ansei, :e_y =>  4, :e_m => 10, :g_y => 1857, :g_m => 11, :g_d => 17},
             {:era => :ansei, :e_y =>  4, :e_m => 11, :g_y => 1857, :g_m => 12, :g_d => 16},
             {:era => :ansei, :e_y =>  4, :e_m => 12, :g_y => 1858, :g_m =>  1, :g_d => 15},

             {:era => :ansei, :e_y =>  5, :e_m =>  1, :g_y => 1858, :g_m =>  2, :g_d => 14},
             {:era => :ansei, :e_y =>  5, :e_m =>  2, :g_y => 1858, :g_m =>  3, :g_d => 15},
             {:era => :ansei, :e_y =>  5, :e_m =>  3, :g_y => 1858, :g_m =>  4, :g_d => 14},
             {:era => :ansei, :e_y =>  5, :e_m =>  4, :g_y => 1858, :g_m =>  5, :g_d => 13},
             {:era => :ansei, :e_y =>  5, :e_m =>  5, :g_y => 1858, :g_m =>  6, :g_d => 11},
             {:era => :ansei, :e_y =>  5, :e_m =>  6, :g_y => 1858, :g_m =>  7, :g_d => 11},
             {:era => :ansei, :e_y =>  5, :e_m =>  7, :g_y => 1858, :g_m =>  8, :g_d =>  9},
             {:era => :ansei, :e_y =>  5, :e_m =>  8, :g_y => 1858, :g_m =>  9, :g_d =>  7},
             {:era => :ansei, :e_y =>  5, :e_m =>  9, :g_y => 1858, :g_m => 10, :g_d =>  7},
             {:era => :ansei, :e_y =>  5, :e_m => 10, :g_y => 1858, :g_m => 11, :g_d =>  6},
             {:era => :ansei, :e_y =>  5, :e_m => 11, :g_y => 1858, :g_m => 12, :g_d =>  5},
             {:era => :ansei, :e_y =>  5, :e_m => 12, :g_y => 1859, :g_m =>  1, :g_d =>  4},

             {:era => :ansei, :e_y =>  6, :e_m =>  1, :g_y => 1859, :g_m =>  2, :g_d =>  3},
             {:era => :ansei, :e_y =>  6, :e_m =>  2, :g_y => 1859, :g_m =>  3, :g_d =>  5},
             {:era => :ansei, :e_y =>  6, :e_m =>  3, :g_y => 1859, :g_m =>  4, :g_d =>  3},
             {:era => :ansei, :e_y =>  6, :e_m =>  4, :g_y => 1859, :g_m =>  5, :g_d =>  3},
             {:era => :ansei, :e_y =>  6, :e_m =>  5, :g_y => 1859, :g_m =>  6, :g_d =>  1},
             {:era => :ansei, :e_y =>  6, :e_m =>  6, :g_y => 1859, :g_m =>  6, :g_d => 30},
             {:era => :ansei, :e_y =>  6, :e_m =>  7, :g_y => 1859, :g_m =>  7, :g_d => 30},
             {:era => :ansei, :e_y =>  6, :e_m =>  8, :g_y => 1859, :g_m =>  8, :g_d => 28},
             {:era => :ansei, :e_y =>  6, :e_m =>  9, :g_y => 1859, :g_m =>  9, :g_d => 26},
             {:era => :ansei, :e_y =>  6, :e_m => 10, :g_y => 1859, :g_m => 10, :g_d => 26},
             {:era => :ansei, :e_y =>  6, :e_m => 11, :g_y => 1859, :g_m => 11, :g_d => 24},
             {:era => :ansei, :e_y =>  6, :e_m => 12, :g_y => 1859, :g_m => 12, :g_d => 24},

             {:era => :ansei, :e_y =>  7, :e_m =>  1, :g_y => 1860, :g_m =>  1, :g_d => 23},
             {:era => :ansei, :e_y =>  7, :e_m =>  2, :g_y => 1860, :g_m =>  2, :g_d => 22},
             {:era => :ansei, :e_y =>  7, :e_m =>  3, :g_y => 1860, :g_m =>  3, :g_d => 22},
             {:era => :ansei, :e_y =>  7, :e_m =>  3, :g_y => 1860, :g_m =>  4, :g_d => 21, :leap_month => true},
             {:era => :ansei, :e_y =>  7, :e_m =>  4, :g_y => 1860, :g_m =>  5, :g_d => 21},
             {:era => :ansei, :e_y =>  7, :e_m =>  5, :g_y => 1860, :g_m =>  6, :g_d => 19},
             {:era => :ansei, :e_y =>  7, :e_m =>  6, :g_y => 1860, :g_m =>  7, :g_d => 18},
             {:era => :ansei, :e_y =>  7, :e_m =>  7, :g_y => 1860, :g_m =>  8, :g_d => 17},
             {:era => :ansei, :e_y =>  7, :e_m =>  8, :g_y => 1860, :g_m =>  9, :g_d => 15},
             {:era => :ansei, :e_y =>  7, :e_m =>  9, :g_y => 1860, :g_m => 10, :g_d => 14},
             {:era => :ansei, :e_y =>  7, :e_m => 10, :g_y => 1860, :g_m => 11, :g_d => 13},
             {:era => :ansei, :e_y =>  7, :e_m => 11, :g_y => 1860, :g_m => 12, :g_d => 12},
             {:era => :ansei, :e_y =>  7, :e_m => 12, :g_y => 1861, :g_m =>  1, :g_d => 11},

            ]

    add_era_table table
  end # Date
end # Wareki
