# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Bunky%C5%AB' # 
    # KANJI_ERA_NAME = '文久'

    # 文久
    # http://ja.wikipedia.org/wiki/%E6%96%87%E4%B9%85
    # | 文久元年 (辛酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1861/02/10 | 1861/03/11 | 1861/04/10 | 1861/05/10 | 1861/06/08 | 1861/07/08 | 1861/08/06 | 1861/09/05 | 1861/10/04 | 1861/11/03 | 1861/12/02 | 1861/12/31 |
    # | 文久二年 (壬戌)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |     閏八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1862/01/30 | 1862/03/01 | 1862/03/30 | 1862/04/29 | 1862/05/29 | 1862/06/27 | 1862/07/27 | 1862/08/25 | 1862/09/24 | 1862/10/23 | 1862/11/22 | 1862/12/21 | 1863/01/20 |
    # | 文久三年 (癸亥)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1863/02/18 | 1863/03/19 | 1863/04/18 | 1863/05/18 | 1863/06/16 | 1863/07/16 | 1863/08/14 | 1863/09/13 | 1863/10/13 | 1863/11/11 | 1863/12/11 | 1864/01/09 |
    # | 文久四年 (甲子)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1864/02/08 | 1864/03/08 | 1864/04/06 | 1864/05/06 | 1864/06/04 | 1864/07/04 | 1864/08/02 | 1864/09/01 | 1864/10/01 | 1864/10/31 | 1864/11/29 | 1864/12/29 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :bunkyu, :e_y =>  1, :e_m =>  1, :g_y => 1861, :g_m =>  2, :g_d => 10},
             {:era => :bunkyu, :e_y =>  1, :e_m =>  2, :g_y => 1861, :g_m =>  3, :g_d => 11},
             {:era => :bunkyu, :e_y =>  1, :e_m =>  3, :g_y => 1861, :g_m =>  4, :g_d => 10},
             {:era => :bunkyu, :e_y =>  1, :e_m =>  4, :g_y => 1861, :g_m =>  5, :g_d => 10},
             {:era => :bunkyu, :e_y =>  1, :e_m =>  5, :g_y => 1861, :g_m =>  6, :g_d =>  8},
             {:era => :bunkyu, :e_y =>  1, :e_m =>  6, :g_y => 1861, :g_m =>  7, :g_d =>  8},
             {:era => :bunkyu, :e_y =>  1, :e_m =>  7, :g_y => 1861, :g_m =>  8, :g_d =>  6},
             {:era => :bunkyu, :e_y =>  1, :e_m =>  8, :g_y => 1861, :g_m =>  9, :g_d =>  5},
             {:era => :bunkyu, :e_y =>  1, :e_m =>  9, :g_y => 1861, :g_m => 10, :g_d =>  4},
             {:era => :bunkyu, :e_y =>  1, :e_m => 10, :g_y => 1861, :g_m => 11, :g_d =>  3},
             {:era => :bunkyu, :e_y =>  1, :e_m => 11, :g_y => 1861, :g_m => 12, :g_d =>  2},
             {:era => :bunkyu, :e_y =>  1, :e_m => 12, :g_y => 1861, :g_m => 12, :g_d => 31},

             {:era => :bunkyu, :e_y =>  2, :e_m =>  1, :g_y => 1862, :g_m =>  1, :g_d => 30},
             {:era => :bunkyu, :e_y =>  2, :e_m =>  2, :g_y => 1862, :g_m =>  3, :g_d =>  1},
             {:era => :bunkyu, :e_y =>  2, :e_m =>  3, :g_y => 1862, :g_m =>  3, :g_d => 30},
             {:era => :bunkyu, :e_y =>  2, :e_m =>  4, :g_y => 1862, :g_m =>  4, :g_d => 29},
             {:era => :bunkyu, :e_y =>  2, :e_m =>  5, :g_y => 1862, :g_m =>  5, :g_d => 29},
             {:era => :bunkyu, :e_y =>  2, :e_m =>  6, :g_y => 1862, :g_m =>  6, :g_d => 27},
             {:era => :bunkyu, :e_y =>  2, :e_m =>  7, :g_y => 1862, :g_m =>  7, :g_d => 27},
             {:era => :bunkyu, :e_y =>  2, :e_m =>  8, :g_y => 1862, :g_m =>  8, :g_d => 25},
             {:era => :bunkyu, :e_y =>  2, :e_m =>  8, :g_y => 1862, :g_m =>  9, :g_d => 24, :leap_month => true},
             {:era => :bunkyu, :e_y =>  2, :e_m =>  9, :g_y => 1862, :g_m => 10, :g_d => 23},
             {:era => :bunkyu, :e_y =>  2, :e_m => 10, :g_y => 1862, :g_m => 11, :g_d => 22},
             {:era => :bunkyu, :e_y =>  2, :e_m => 11, :g_y => 1862, :g_m => 12, :g_d => 21},
             {:era => :bunkyu, :e_y =>  2, :e_m => 12, :g_y => 1863, :g_m =>  1, :g_d => 20},

             {:era => :bunkyu, :e_y =>  3, :e_m =>  1, :g_y => 1863, :g_m =>  2, :g_d => 18},
             {:era => :bunkyu, :e_y =>  3, :e_m =>  2, :g_y => 1863, :g_m =>  3, :g_d => 19},
             {:era => :bunkyu, :e_y =>  3, :e_m =>  3, :g_y => 1863, :g_m =>  4, :g_d => 18},
             {:era => :bunkyu, :e_y =>  3, :e_m =>  4, :g_y => 1863, :g_m =>  5, :g_d => 18},
             {:era => :bunkyu, :e_y =>  3, :e_m =>  5, :g_y => 1863, :g_m =>  6, :g_d => 16},
             {:era => :bunkyu, :e_y =>  3, :e_m =>  6, :g_y => 1863, :g_m =>  7, :g_d => 16},
             {:era => :bunkyu, :e_y =>  3, :e_m =>  7, :g_y => 1863, :g_m =>  8, :g_d => 14},
             {:era => :bunkyu, :e_y =>  3, :e_m =>  8, :g_y => 1863, :g_m =>  9, :g_d => 13},
             {:era => :bunkyu, :e_y =>  3, :e_m =>  9, :g_y => 1863, :g_m => 10, :g_d => 13},
             {:era => :bunkyu, :e_y =>  3, :e_m => 10, :g_y => 1863, :g_m => 11, :g_d => 11},
             {:era => :bunkyu, :e_y =>  3, :e_m => 11, :g_y => 1863, :g_m => 12, :g_d => 11},
             {:era => :bunkyu, :e_y =>  3, :e_m => 12, :g_y => 1864, :g_m =>  1, :g_d =>  9},

             {:era => :bunkyu, :e_y =>  4, :e_m =>  1, :g_y => 1864, :g_m =>  2, :g_d =>  8},
             {:era => :bunkyu, :e_y =>  4, :e_m =>  2, :g_y => 1864, :g_m =>  3, :g_d =>  8},
             {:era => :bunkyu, :e_y =>  4, :e_m =>  3, :g_y => 1864, :g_m =>  4, :g_d =>  6},
             {:era => :bunkyu, :e_y =>  4, :e_m =>  4, :g_y => 1864, :g_m =>  5, :g_d =>  6},
             {:era => :bunkyu, :e_y =>  4, :e_m =>  5, :g_y => 1864, :g_m =>  6, :g_d =>  4},
             {:era => :bunkyu, :e_y =>  4, :e_m =>  6, :g_y => 1864, :g_m =>  7, :g_d =>  4},
             {:era => :bunkyu, :e_y =>  4, :e_m =>  7, :g_y => 1864, :g_m =>  8, :g_d =>  2},
             {:era => :bunkyu, :e_y =>  4, :e_m =>  8, :g_y => 1864, :g_m =>  9, :g_d =>  1},
             {:era => :bunkyu, :e_y =>  4, :e_m =>  9, :g_y => 1864, :g_m => 10, :g_d =>  1},
             {:era => :bunkyu, :e_y =>  4, :e_m => 10, :g_y => 1864, :g_m => 10, :g_d => 31},
             {:era => :bunkyu, :e_y =>  4, :e_m => 11, :g_y => 1864, :g_m => 11, :g_d => 29},
             {:era => :bunkyu, :e_y =>  4, :e_m => 12, :g_y => 1864, :g_m => 12, :g_d => 29},

            ]

    add_era_table table
  end # Date
end # Wareki
