# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Enky%C5%8D_(Edo_period)' # 
    # KANJI_ERA_NAME = '延享'

    # 延享
    # http://ja.wikipedia.org/wiki/%E5%BB%B6%E4%BA%AB
    # | 延享元年 (甲子)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1744/02/14 | 1744/03/14 | 1744/04/13 | 1744/05/12 | 1744/06/11 | 1744/07/10 | 1744/08/08 | 1744/09/07 | 1744/10/06 | 1744/11/04 | 1744/12/04 | 1745/01/03 |
    # | 延享二年 (乙丑)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |   閏十二月 |
    # |        グレゴリオ暦 | 1745/02/01 | 1745/03/03 | 1745/04/02 | 1745/05/02 | 1745/05/31 | 1745/06/30 | 1745/07/29 | 1745/08/27 | 1745/09/26 | 1745/10/25 | 1745/11/23 | 1745/12/23 | 1746/01/22 |
    # | 延享三年 (丙寅)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1746/02/20 | 1746/03/22 | 1746/04/21 | 1746/05/20 | 1746/06/19 | 1746/07/18 | 1746/08/17 | 1746/09/15 | 1746/10/15 | 1746/11/13 | 1746/12/12 | 1747/01/11 |
    # | 延享四年 (丁卯)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1747/02/10 | 1747/03/11 | 1747/04/10 | 1747/05/09 | 1747/06/08 | 1747/07/08 | 1747/08/06 | 1747/09/05 | 1747/10/04 | 1747/11/03 | 1747/12/02 | 1748/01/01 |
    # | 延享五年 (戊辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     閏十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1748/01/30 | 1748/02/28 | 1748/03/29 | 1748/04/28 | 1748/05/27 | 1748/06/26 | 1748/07/25 | 1748/08/24 | 1748/09/23 | 1748/10/22 | 1748/11/21 | 1748/12/20 | 1749/01/19 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :enkyo, :e_y =>  1, :e_m =>  1, :g_y => 1744, :g_m =>  2, :g_d => 14},
             {:era => :enkyo, :e_y =>  1, :e_m =>  2, :g_y => 1744, :g_m =>  3, :g_d => 14},
             {:era => :enkyo, :e_y =>  1, :e_m =>  3, :g_y => 1744, :g_m =>  4, :g_d => 13},
             {:era => :enkyo, :e_y =>  1, :e_m =>  4, :g_y => 1744, :g_m =>  5, :g_d => 12},
             {:era => :enkyo, :e_y =>  1, :e_m =>  5, :g_y => 1744, :g_m =>  6, :g_d => 11},
             {:era => :enkyo, :e_y =>  1, :e_m =>  6, :g_y => 1744, :g_m =>  7, :g_d => 10},
             {:era => :enkyo, :e_y =>  1, :e_m =>  7, :g_y => 1744, :g_m =>  8, :g_d =>  8},
             {:era => :enkyo, :e_y =>  1, :e_m =>  8, :g_y => 1744, :g_m =>  9, :g_d =>  7},
             {:era => :enkyo, :e_y =>  1, :e_m =>  9, :g_y => 1744, :g_m => 10, :g_d =>  6},
             {:era => :enkyo, :e_y =>  1, :e_m => 10, :g_y => 1744, :g_m => 11, :g_d =>  4},
             {:era => :enkyo, :e_y =>  1, :e_m => 11, :g_y => 1744, :g_m => 12, :g_d =>  4},
             {:era => :enkyo, :e_y =>  1, :e_m => 12, :g_y => 1745, :g_m =>  1, :g_d =>  3},

             {:era => :enkyo, :e_y =>  2, :e_m =>  1, :g_y => 1745, :g_m =>  2, :g_d =>  1},
             {:era => :enkyo, :e_y =>  2, :e_m =>  2, :g_y => 1745, :g_m =>  3, :g_d =>  3},
             {:era => :enkyo, :e_y =>  2, :e_m =>  3, :g_y => 1745, :g_m =>  4, :g_d =>  2},
             {:era => :enkyo, :e_y =>  2, :e_m =>  4, :g_y => 1745, :g_m =>  5, :g_d =>  2},
             {:era => :enkyo, :e_y =>  2, :e_m =>  5, :g_y => 1745, :g_m =>  5, :g_d => 31},
             {:era => :enkyo, :e_y =>  2, :e_m =>  6, :g_y => 1745, :g_m =>  6, :g_d => 30},
             {:era => :enkyo, :e_y =>  2, :e_m =>  7, :g_y => 1745, :g_m =>  7, :g_d => 29},
             {:era => :enkyo, :e_y =>  2, :e_m =>  8, :g_y => 1745, :g_m =>  8, :g_d => 27},
             {:era => :enkyo, :e_y =>  2, :e_m =>  9, :g_y => 1745, :g_m =>  9, :g_d => 26},
             {:era => :enkyo, :e_y =>  2, :e_m => 10, :g_y => 1745, :g_m => 10, :g_d => 25},
             {:era => :enkyo, :e_y =>  2, :e_m => 11, :g_y => 1745, :g_m => 11, :g_d => 23},
             {:era => :enkyo, :e_y =>  2, :e_m => 12, :g_y => 1745, :g_m => 12, :g_d => 23},
             {:era => :enkyo, :e_y =>  2, :e_m => 12, :g_y => 1746, :g_m =>  1, :g_d => 22, :leap_month => true},

             {:era => :enkyo, :e_y =>  3, :e_m =>  1, :g_y => 1746, :g_m =>  2, :g_d => 20},
             {:era => :enkyo, :e_y =>  3, :e_m =>  2, :g_y => 1746, :g_m =>  3, :g_d => 22},
             {:era => :enkyo, :e_y =>  3, :e_m =>  3, :g_y => 1746, :g_m =>  4, :g_d => 21},
             {:era => :enkyo, :e_y =>  3, :e_m =>  4, :g_y => 1746, :g_m =>  5, :g_d => 20},
             {:era => :enkyo, :e_y =>  3, :e_m =>  5, :g_y => 1746, :g_m =>  6, :g_d => 19},
             {:era => :enkyo, :e_y =>  3, :e_m =>  6, :g_y => 1746, :g_m =>  7, :g_d => 18},
             {:era => :enkyo, :e_y =>  3, :e_m =>  7, :g_y => 1746, :g_m =>  8, :g_d => 17},
             {:era => :enkyo, :e_y =>  3, :e_m =>  8, :g_y => 1746, :g_m =>  9, :g_d => 15},
             {:era => :enkyo, :e_y =>  3, :e_m =>  9, :g_y => 1746, :g_m => 10, :g_d => 15},
             {:era => :enkyo, :e_y =>  3, :e_m => 10, :g_y => 1746, :g_m => 11, :g_d => 13},
             {:era => :enkyo, :e_y =>  3, :e_m => 11, :g_y => 1746, :g_m => 12, :g_d => 12},
             {:era => :enkyo, :e_y =>  3, :e_m => 12, :g_y => 1747, :g_m =>  1, :g_d => 11},

             {:era => :enkyo, :e_y =>  4, :e_m =>  1, :g_y => 1747, :g_m =>  2, :g_d => 10},
             {:era => :enkyo, :e_y =>  4, :e_m =>  2, :g_y => 1747, :g_m =>  3, :g_d => 11},
             {:era => :enkyo, :e_y =>  4, :e_m =>  3, :g_y => 1747, :g_m =>  4, :g_d => 10},
             {:era => :enkyo, :e_y =>  4, :e_m =>  4, :g_y => 1747, :g_m =>  5, :g_d =>  9},
             {:era => :enkyo, :e_y =>  4, :e_m =>  5, :g_y => 1747, :g_m =>  6, :g_d =>  8},
             {:era => :enkyo, :e_y =>  4, :e_m =>  6, :g_y => 1747, :g_m =>  7, :g_d =>  8},
             {:era => :enkyo, :e_y =>  4, :e_m =>  7, :g_y => 1747, :g_m =>  8, :g_d =>  6},
             {:era => :enkyo, :e_y =>  4, :e_m =>  8, :g_y => 1747, :g_m =>  9, :g_d =>  5},
             {:era => :enkyo, :e_y =>  4, :e_m =>  9, :g_y => 1747, :g_m => 10, :g_d =>  4},
             {:era => :enkyo, :e_y =>  4, :e_m => 10, :g_y => 1747, :g_m => 11, :g_d =>  3},
             {:era => :enkyo, :e_y =>  4, :e_m => 11, :g_y => 1747, :g_m => 12, :g_d =>  2},
             {:era => :enkyo, :e_y =>  4, :e_m => 12, :g_y => 1748, :g_m =>  1, :g_d =>  1},

             {:era => :enkyo, :e_y =>  5, :e_m =>  1, :g_y => 1748, :g_m =>  1, :g_d => 30},
             {:era => :enkyo, :e_y =>  5, :e_m =>  2, :g_y => 1748, :g_m =>  2, :g_d => 28},
             {:era => :enkyo, :e_y =>  5, :e_m =>  3, :g_y => 1748, :g_m =>  3, :g_d => 29},
             {:era => :enkyo, :e_y =>  5, :e_m =>  4, :g_y => 1748, :g_m =>  4, :g_d => 28},
             {:era => :enkyo, :e_y =>  5, :e_m =>  5, :g_y => 1748, :g_m =>  5, :g_d => 27},
             {:era => :enkyo, :e_y =>  5, :e_m =>  6, :g_y => 1748, :g_m =>  6, :g_d => 26},
             {:era => :enkyo, :e_y =>  5, :e_m =>  7, :g_y => 1748, :g_m =>  7, :g_d => 25},
             {:era => :enkyo, :e_y =>  5, :e_m =>  8, :g_y => 1748, :g_m =>  8, :g_d => 24},
             {:era => :enkyo, :e_y =>  5, :e_m =>  9, :g_y => 1748, :g_m =>  9, :g_d => 23},
             {:era => :enkyo, :e_y =>  5, :e_m => 10, :g_y => 1748, :g_m => 10, :g_d => 22},
             {:era => :enkyo, :e_y =>  5, :e_m => 10, :g_y => 1748, :g_m => 11, :g_d => 21, :leap_month => true},
             {:era => :enkyo, :e_y =>  5, :e_m => 11, :g_y => 1748, :g_m => 12, :g_d => 20},
             {:era => :enkyo, :e_y =>  5, :e_m => 12, :g_y => 1749, :g_m =>  1, :g_d => 19},

            ]

    add_era_table table
  end # Date
end # Wareki
