# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Genbun' # 
    # KANJI_ERA_NAME = '元文'

    # 元文
    # http://ja.wikipedia.org/wiki/%E5%85%83%E6%96%87
    # | 元文元年 (丙辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1736/02/12 | 1736/03/12 | 1736/04/11 | 1736/05/11 | 1736/06/09 | 1736/07/09 | 1736/08/07 | 1736/09/05 | 1736/10/05 | 1736/11/03 | 1736/12/02 | 1737/01/01 |
    # | 元文二年 (丁巳)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |   閏十一月 |     十二月 |
    # |        グレゴリオ暦 | 1737/01/31 | 1737/03/01 | 1737/03/31 | 1737/04/30 | 1737/05/30 | 1737/06/28 | 1737/07/28 | 1737/08/26 | 1737/09/24 | 1737/10/24 | 1737/11/22 | 1737/12/22 | 1738/01/20 |
    # | 元文三年 (戊午)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1738/02/19 | 1738/03/20 | 1738/04/19 | 1738/05/19 | 1738/06/17 | 1738/07/17 | 1738/08/15 | 1738/09/14 | 1738/10/13 | 1738/11/12 | 1738/12/11 | 1739/01/10 |
    # | 元文四年 (己未)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1739/02/08 | 1739/03/10 | 1739/04/08 | 1739/05/08 | 1739/06/06 | 1739/07/06 | 1739/08/05 | 1739/09/03 | 1739/10/03 | 1739/11/01 | 1739/12/01 | 1739/12/30 |
    # | 元文五年 (庚申)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |     閏七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1740/01/29 | 1740/02/27 | 1740/03/28 | 1740/04/26 | 1740/05/25 | 1740/06/24 | 1740/07/24 | 1740/08/22 | 1740/09/21 | 1740/10/21 | 1740/11/19 | 1740/12/19 | 1741/01/17 |
    # | 元文六年 (辛酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1741/02/16 | 1741/03/17 | 1741/04/16 | 1741/05/15 | 1741/06/13 | 1741/07/13 | 1741/08/11 | 1741/09/10 | 1741/10/10 | 1741/11/08 | 1741/12/08 | 1742/01/07 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :genbun, :e_y =>  1, :e_m =>  1, :g_y => 1736, :g_m =>  2, :g_d => 12},
             {:era => :genbun, :e_y =>  1, :e_m =>  2, :g_y => 1736, :g_m =>  3, :g_d => 12},
             {:era => :genbun, :e_y =>  1, :e_m =>  3, :g_y => 1736, :g_m =>  4, :g_d => 11},
             {:era => :genbun, :e_y =>  1, :e_m =>  4, :g_y => 1736, :g_m =>  5, :g_d => 11},
             {:era => :genbun, :e_y =>  1, :e_m =>  5, :g_y => 1736, :g_m =>  6, :g_d =>  9},
             {:era => :genbun, :e_y =>  1, :e_m =>  6, :g_y => 1736, :g_m =>  7, :g_d =>  9},
             {:era => :genbun, :e_y =>  1, :e_m =>  7, :g_y => 1736, :g_m =>  8, :g_d =>  7},
             {:era => :genbun, :e_y =>  1, :e_m =>  8, :g_y => 1736, :g_m =>  9, :g_d =>  5},
             {:era => :genbun, :e_y =>  1, :e_m =>  9, :g_y => 1736, :g_m => 10, :g_d =>  5},
             {:era => :genbun, :e_y =>  1, :e_m => 10, :g_y => 1736, :g_m => 11, :g_d =>  3},
             {:era => :genbun, :e_y =>  1, :e_m => 11, :g_y => 1736, :g_m => 12, :g_d =>  2},
             {:era => :genbun, :e_y =>  1, :e_m => 12, :g_y => 1737, :g_m =>  1, :g_d =>  1},

             {:era => :genbun, :e_y =>  2, :e_m =>  1, :g_y => 1737, :g_m =>  1, :g_d => 31},
             {:era => :genbun, :e_y =>  2, :e_m =>  2, :g_y => 1737, :g_m =>  3, :g_d =>  1},
             {:era => :genbun, :e_y =>  2, :e_m =>  3, :g_y => 1737, :g_m =>  3, :g_d => 31},
             {:era => :genbun, :e_y =>  2, :e_m =>  4, :g_y => 1737, :g_m =>  4, :g_d => 30},
             {:era => :genbun, :e_y =>  2, :e_m =>  5, :g_y => 1737, :g_m =>  5, :g_d => 30},
             {:era => :genbun, :e_y =>  2, :e_m =>  6, :g_y => 1737, :g_m =>  6, :g_d => 28},
             {:era => :genbun, :e_y =>  2, :e_m =>  7, :g_y => 1737, :g_m =>  7, :g_d => 28},
             {:era => :genbun, :e_y =>  2, :e_m =>  8, :g_y => 1737, :g_m =>  8, :g_d => 26},
             {:era => :genbun, :e_y =>  2, :e_m =>  9, :g_y => 1737, :g_m =>  9, :g_d => 24},
             {:era => :genbun, :e_y =>  2, :e_m => 10, :g_y => 1737, :g_m => 10, :g_d => 24},
             {:era => :genbun, :e_y =>  2, :e_m => 11, :g_y => 1737, :g_m => 11, :g_d => 22},
             {:era => :genbun, :e_y =>  2, :e_m => 11, :g_y => 1737, :g_m => 12, :g_d => 22, :leap_month => true},
             {:era => :genbun, :e_y =>  2, :e_m => 12, :g_y => 1738, :g_m =>  1, :g_d => 20},

             {:era => :genbun, :e_y =>  3, :e_m =>  1, :g_y => 1738, :g_m =>  2, :g_d => 19},
             {:era => :genbun, :e_y =>  3, :e_m =>  2, :g_y => 1738, :g_m =>  3, :g_d => 20},
             {:era => :genbun, :e_y =>  3, :e_m =>  3, :g_y => 1738, :g_m =>  4, :g_d => 19},
             {:era => :genbun, :e_y =>  3, :e_m =>  4, :g_y => 1738, :g_m =>  5, :g_d => 19},
             {:era => :genbun, :e_y =>  3, :e_m =>  5, :g_y => 1738, :g_m =>  6, :g_d => 17},
             {:era => :genbun, :e_y =>  3, :e_m =>  6, :g_y => 1738, :g_m =>  7, :g_d => 17},
             {:era => :genbun, :e_y =>  3, :e_m =>  7, :g_y => 1738, :g_m =>  8, :g_d => 15},
             {:era => :genbun, :e_y =>  3, :e_m =>  8, :g_y => 1738, :g_m =>  9, :g_d => 14},
             {:era => :genbun, :e_y =>  3, :e_m =>  9, :g_y => 1738, :g_m => 10, :g_d => 13},
             {:era => :genbun, :e_y =>  3, :e_m => 10, :g_y => 1738, :g_m => 11, :g_d => 12},
             {:era => :genbun, :e_y =>  3, :e_m => 11, :g_y => 1738, :g_m => 12, :g_d => 11},
             {:era => :genbun, :e_y =>  3, :e_m => 12, :g_y => 1739, :g_m =>  1, :g_d => 10},

             {:era => :genbun, :e_y =>  4, :e_m =>  1, :g_y => 1739, :g_m =>  2, :g_d =>  8},
             {:era => :genbun, :e_y =>  4, :e_m =>  2, :g_y => 1739, :g_m =>  3, :g_d => 10},
             {:era => :genbun, :e_y =>  4, :e_m =>  3, :g_y => 1739, :g_m =>  4, :g_d =>  8},
             {:era => :genbun, :e_y =>  4, :e_m =>  4, :g_y => 1739, :g_m =>  5, :g_d =>  8},
             {:era => :genbun, :e_y =>  4, :e_m =>  5, :g_y => 1739, :g_m =>  6, :g_d =>  6},
             {:era => :genbun, :e_y =>  4, :e_m =>  6, :g_y => 1739, :g_m =>  7, :g_d =>  6},
             {:era => :genbun, :e_y =>  4, :e_m =>  7, :g_y => 1739, :g_m =>  8, :g_d =>  5},
             {:era => :genbun, :e_y =>  4, :e_m =>  8, :g_y => 1739, :g_m =>  9, :g_d =>  3},
             {:era => :genbun, :e_y =>  4, :e_m =>  9, :g_y => 1739, :g_m => 10, :g_d =>  3},
             {:era => :genbun, :e_y =>  4, :e_m => 10, :g_y => 1739, :g_m => 11, :g_d =>  1},
             {:era => :genbun, :e_y =>  4, :e_m => 11, :g_y => 1739, :g_m => 12, :g_d =>  1},
             {:era => :genbun, :e_y =>  4, :e_m => 12, :g_y => 1739, :g_m => 12, :g_d => 30},

             {:era => :genbun, :e_y =>  5, :e_m =>  1, :g_y => 1740, :g_m =>  1, :g_d => 29},
             {:era => :genbun, :e_y =>  5, :e_m =>  2, :g_y => 1740, :g_m =>  2, :g_d => 27},
             {:era => :genbun, :e_y =>  5, :e_m =>  3, :g_y => 1740, :g_m =>  3, :g_d => 28},
             {:era => :genbun, :e_y =>  5, :e_m =>  4, :g_y => 1740, :g_m =>  4, :g_d => 26},
             {:era => :genbun, :e_y =>  5, :e_m =>  5, :g_y => 1740, :g_m =>  5, :g_d => 25},
             {:era => :genbun, :e_y =>  5, :e_m =>  6, :g_y => 1740, :g_m =>  6, :g_d => 24},
             {:era => :genbun, :e_y =>  5, :e_m =>  7, :g_y => 1740, :g_m =>  7, :g_d => 24},
             {:era => :genbun, :e_y =>  5, :e_m =>  7, :g_y => 1740, :g_m =>  8, :g_d => 22, :leap_month => true},
             {:era => :genbun, :e_y =>  5, :e_m =>  8, :g_y => 1740, :g_m =>  9, :g_d => 21},
             {:era => :genbun, :e_y =>  5, :e_m =>  9, :g_y => 1740, :g_m => 10, :g_d => 21},
             {:era => :genbun, :e_y =>  5, :e_m => 10, :g_y => 1740, :g_m => 11, :g_d => 19},
             {:era => :genbun, :e_y =>  5, :e_m => 11, :g_y => 1740, :g_m => 12, :g_d => 19},
             {:era => :genbun, :e_y =>  5, :e_m => 12, :g_y => 1741, :g_m =>  1, :g_d => 17},

             {:era => :genbun, :e_y =>  6, :e_m =>  1, :g_y => 1741, :g_m =>  2, :g_d => 16},
             {:era => :genbun, :e_y =>  6, :e_m =>  2, :g_y => 1741, :g_m =>  3, :g_d => 17},
             {:era => :genbun, :e_y =>  6, :e_m =>  3, :g_y => 1741, :g_m =>  4, :g_d => 16},
             {:era => :genbun, :e_y =>  6, :e_m =>  4, :g_y => 1741, :g_m =>  5, :g_d => 15},
             {:era => :genbun, :e_y =>  6, :e_m =>  5, :g_y => 1741, :g_m =>  6, :g_d => 13},
             {:era => :genbun, :e_y =>  6, :e_m =>  6, :g_y => 1741, :g_m =>  7, :g_d => 13},
             {:era => :genbun, :e_y =>  6, :e_m =>  7, :g_y => 1741, :g_m =>  8, :g_d => 11},
             {:era => :genbun, :e_y =>  6, :e_m =>  8, :g_y => 1741, :g_m =>  9, :g_d => 10},
             {:era => :genbun, :e_y =>  6, :e_m =>  9, :g_y => 1741, :g_m => 10, :g_d => 10},
             {:era => :genbun, :e_y =>  6, :e_m => 10, :g_y => 1741, :g_m => 11, :g_d =>  8},
             {:era => :genbun, :e_y =>  6, :e_m => 11, :g_y => 1741, :g_m => 12, :g_d =>  8},
             {:era => :genbun, :e_y =>  6, :e_m => 12, :g_y => 1742, :g_m =>  1, :g_d =>  7},

            ]

    add_era_table table
  end # Date
end # Wareki
