# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Genroku' # 
    # KANJI_ERA_NAME = '元禄'

    # 元禄
    # http://ja.wikipedia.org/wiki/%E5%85%83%E7%A6%84
    # | 元禄元年 (戊辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1688/02/02 | 1688/03/02 | 1688/04/01 | 1688/04/30 | 1688/05/29 | 1688/06/28 | 1688/07/27 | 1688/08/26 | 1688/09/24 | 1688/10/24 | 1688/11/23 | 1688/12/23 |
    # | 元禄二年 (己巳)     |       一月 |     閏一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1689/01/21 | 1689/02/20 | 1689/03/21 | 1689/04/20 | 1689/05/19 | 1689/06/17 | 1689/07/17 | 1689/08/15 | 1689/09/14 | 1689/10/13 | 1689/11/12 | 1689/12/12 | 1690/01/11 |
    # | 元禄三年 (庚午)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1690/02/09 | 1690/03/11 | 1690/04/09 | 1690/05/09 | 1690/06/07 | 1690/07/06 | 1690/08/05 | 1690/09/03 | 1690/10/02 | 1690/11/01 | 1690/12/01 | 1690/12/30 |
    # | 元禄四年 (辛未)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |     閏八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1691/01/29 | 1691/02/28 | 1691/03/30 | 1691/04/28 | 1691/05/28 | 1691/06/26 | 1691/07/25 | 1691/08/24 | 1691/09/22 | 1691/10/21 | 1691/11/20 | 1691/12/20 | 1692/01/18 |
    # | 元禄五年 (壬申)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1692/02/17 | 1692/03/18 | 1692/04/16 | 1692/05/16 | 1692/06/15 | 1692/07/14 | 1692/08/12 | 1692/09/11 | 1692/10/10 | 1692/11/08 | 1692/12/08 | 1693/01/06 |
    # | 元禄六年 (癸酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1693/02/05 | 1693/03/07 | 1693/04/06 | 1693/05/05 | 1693/06/04 | 1693/07/03 | 1693/08/02 | 1693/08/31 | 1693/09/30 | 1693/10/29 | 1693/11/27 | 1693/12/27 |
    # | 元禄七年 (甲戌)     |       一月 |       二月 |       三月 |       四月 |       五月 |     閏五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1694/01/25 | 1694/02/24 | 1694/03/26 | 1694/04/24 | 1694/05/24 | 1694/06/23 | 1694/07/22 | 1694/08/21 | 1694/09/19 | 1694/10/19 | 1694/11/17 | 1694/12/17 | 1695/01/15 |
    # | 元禄八年 (乙亥)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1695/02/13 | 1695/03/15 | 1695/04/13 | 1695/05/13 | 1695/06/12 | 1695/07/11 | 1695/08/10 | 1695/09/08 | 1695/10/08 | 1695/11/07 | 1695/12/06 | 1696/01/05 |
    # | 元禄九年 (丙子)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1696/02/03 | 1696/03/04 | 1696/04/02 | 1696/05/01 | 1696/05/31 | 1696/06/29 | 1696/07/29 | 1696/08/28 | 1696/09/26 | 1696/10/26 | 1696/11/25 | 1696/12/24 |
    # | 元禄十年 (丁丑)     |       一月 |       二月 |     閏二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1697/01/23 | 1697/02/21 | 1697/03/23 | 1697/04/21 | 1697/05/21 | 1697/06/19 | 1697/07/19 | 1697/08/17 | 1697/09/16 | 1697/10/15 | 1697/11/14 | 1697/12/13 | 1698/01/12 |
    # | 元禄十一年 (戊寅)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1698/02/11 | 1698/03/12 | 1698/04/11 | 1698/05/10 | 1698/06/08 | 1698/07/08 | 1698/08/06 | 1698/09/04 | 1698/10/04 | 1698/11/03 | 1698/12/02 | 1699/01/01 |
    # | 元禄十二年 (己卯)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |     閏九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1699/01/31 | 1699/03/02 | 1699/03/31 | 1699/04/30 | 1699/05/29 | 1699/06/27 | 1699/07/27 | 1699/08/25 | 1699/09/23 | 1699/10/23 | 1699/11/21 | 1699/12/21 | 1700/01/20 |
    # | 元禄十三年 (庚辰)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1700/02/19 | 1700/03/21 | 1700/04/19 | 1700/05/19 | 1700/06/17 | 1700/07/16 | 1700/08/15 | 1700/09/13 | 1700/10/12 | 1700/11/11 | 1700/12/10 | 1701/01/09 |
    # | 元禄十四年 (辛巳)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1701/02/08 | 1701/03/10 | 1701/04/08 | 1701/05/08 | 1701/06/06 | 1701/07/06 | 1701/08/04 | 1701/09/03 | 1701/10/02 | 1701/10/31 | 1701/11/30 | 1701/12/29 |
    # | 元禄十五年 (壬午)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |     閏八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1702/01/28 | 1702/02/27 | 1702/03/28 | 1702/04/27 | 1702/05/27 | 1702/06/25 | 1702/07/25 | 1702/08/23 | 1702/09/22 | 1702/10/21 | 1702/11/19 | 1702/12/19 | 1703/01/17 |
    # | 元禄十六年 (癸未)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1703/02/16 | 1703/03/17 | 1703/04/16 | 1703/05/16 | 1703/06/14 | 1703/07/14 | 1703/08/13 | 1703/09/11 | 1703/10/11 | 1703/11/09 | 1703/12/09 | 1704/01/07 |
    # | 元禄十七年 (甲申)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1704/02/05 | 1704/03/06 | 1704/04/04 | 1704/05/04 | 1704/06/02 | 1704/07/02 | 1704/08/01 | 1704/08/30 | 1704/09/29 | 1704/10/29 | 1704/11/27 | 1704/12/27 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :genroku, :e_y =>  1, :e_m =>  1, :g_y => 1688, :g_m =>  2, :g_d =>  2},
             {:era => :genroku, :e_y =>  1, :e_m =>  2, :g_y => 1688, :g_m =>  3, :g_d =>  2},
             {:era => :genroku, :e_y =>  1, :e_m =>  3, :g_y => 1688, :g_m =>  4, :g_d =>  1},
             {:era => :genroku, :e_y =>  1, :e_m =>  4, :g_y => 1688, :g_m =>  4, :g_d => 30},
             {:era => :genroku, :e_y =>  1, :e_m =>  5, :g_y => 1688, :g_m =>  5, :g_d => 29},
             {:era => :genroku, :e_y =>  1, :e_m =>  6, :g_y => 1688, :g_m =>  6, :g_d => 28},
             {:era => :genroku, :e_y =>  1, :e_m =>  7, :g_y => 1688, :g_m =>  7, :g_d => 27},
             {:era => :genroku, :e_y =>  1, :e_m =>  8, :g_y => 1688, :g_m =>  8, :g_d => 26},
             {:era => :genroku, :e_y =>  1, :e_m =>  9, :g_y => 1688, :g_m =>  9, :g_d => 24},
             {:era => :genroku, :e_y =>  1, :e_m => 10, :g_y => 1688, :g_m => 10, :g_d => 24},
             {:era => :genroku, :e_y =>  1, :e_m => 11, :g_y => 1688, :g_m => 11, :g_d => 23},
             {:era => :genroku, :e_y =>  1, :e_m => 12, :g_y => 1688, :g_m => 12, :g_d => 23},

             {:era => :genroku, :e_y =>  2, :e_m =>  1, :g_y => 1689, :g_m =>  1, :g_d => 21},
             {:era => :genroku, :e_y =>  2, :e_m =>  1, :g_y => 1689, :g_m =>  2, :g_d => 20, :leap_month => true},
             {:era => :genroku, :e_y =>  2, :e_m =>  2, :g_y => 1689, :g_m =>  3, :g_d => 21},
             {:era => :genroku, :e_y =>  2, :e_m =>  3, :g_y => 1689, :g_m =>  4, :g_d => 20},
             {:era => :genroku, :e_y =>  2, :e_m =>  4, :g_y => 1689, :g_m =>  5, :g_d => 19},
             {:era => :genroku, :e_y =>  2, :e_m =>  5, :g_y => 1689, :g_m =>  6, :g_d => 17},
             {:era => :genroku, :e_y =>  2, :e_m =>  6, :g_y => 1689, :g_m =>  7, :g_d => 17},
             {:era => :genroku, :e_y =>  2, :e_m =>  7, :g_y => 1689, :g_m =>  8, :g_d => 15},
             {:era => :genroku, :e_y =>  2, :e_m =>  8, :g_y => 1689, :g_m =>  9, :g_d => 14},
             {:era => :genroku, :e_y =>  2, :e_m =>  9, :g_y => 1689, :g_m => 10, :g_d => 13},
             {:era => :genroku, :e_y =>  2, :e_m => 10, :g_y => 1689, :g_m => 11, :g_d => 12},
             {:era => :genroku, :e_y =>  2, :e_m => 11, :g_y => 1689, :g_m => 12, :g_d => 12},
             {:era => :genroku, :e_y =>  2, :e_m => 12, :g_y => 1690, :g_m =>  1, :g_d => 11},

             {:era => :genroku, :e_y =>  3, :e_m =>  1, :g_y => 1690, :g_m =>  2, :g_d =>  9},
             {:era => :genroku, :e_y =>  3, :e_m =>  2, :g_y => 1690, :g_m =>  3, :g_d => 11},
             {:era => :genroku, :e_y =>  3, :e_m =>  3, :g_y => 1690, :g_m =>  4, :g_d =>  9},
             {:era => :genroku, :e_y =>  3, :e_m =>  4, :g_y => 1690, :g_m =>  5, :g_d =>  9},
             {:era => :genroku, :e_y =>  3, :e_m =>  5, :g_y => 1690, :g_m =>  6, :g_d =>  7},
             {:era => :genroku, :e_y =>  3, :e_m =>  6, :g_y => 1690, :g_m =>  7, :g_d =>  6},
             {:era => :genroku, :e_y =>  3, :e_m =>  7, :g_y => 1690, :g_m =>  8, :g_d =>  5},
             {:era => :genroku, :e_y =>  3, :e_m =>  8, :g_y => 1690, :g_m =>  9, :g_d =>  3},
             {:era => :genroku, :e_y =>  3, :e_m =>  9, :g_y => 1690, :g_m => 10, :g_d =>  2},
             {:era => :genroku, :e_y =>  3, :e_m => 10, :g_y => 1690, :g_m => 11, :g_d =>  1},
             {:era => :genroku, :e_y =>  3, :e_m => 11, :g_y => 1690, :g_m => 12, :g_d =>  1},
             {:era => :genroku, :e_y =>  3, :e_m => 12, :g_y => 1690, :g_m => 12, :g_d => 30},

             {:era => :genroku, :e_y =>  4, :e_m =>  1, :g_y => 1691, :g_m =>  1, :g_d => 29},
             {:era => :genroku, :e_y =>  4, :e_m =>  2, :g_y => 1691, :g_m =>  2, :g_d => 28},
             {:era => :genroku, :e_y =>  4, :e_m =>  3, :g_y => 1691, :g_m =>  3, :g_d => 30},
             {:era => :genroku, :e_y =>  4, :e_m =>  4, :g_y => 1691, :g_m =>  4, :g_d => 28},
             {:era => :genroku, :e_y =>  4, :e_m =>  5, :g_y => 1691, :g_m =>  5, :g_d => 28},
             {:era => :genroku, :e_y =>  4, :e_m =>  6, :g_y => 1691, :g_m =>  6, :g_d => 26},
             {:era => :genroku, :e_y =>  4, :e_m =>  7, :g_y => 1691, :g_m =>  7, :g_d => 25},
             {:era => :genroku, :e_y =>  4, :e_m =>  8, :g_y => 1691, :g_m =>  8, :g_d => 24},
             {:era => :genroku, :e_y =>  4, :e_m =>  8, :g_y => 1691, :g_m =>  9, :g_d => 22, :leap_month => true},
             {:era => :genroku, :e_y =>  4, :e_m =>  9, :g_y => 1691, :g_m => 10, :g_d => 21},
             {:era => :genroku, :e_y =>  4, :e_m => 10, :g_y => 1691, :g_m => 11, :g_d => 20},
             {:era => :genroku, :e_y =>  4, :e_m => 11, :g_y => 1691, :g_m => 12, :g_d => 20},
             {:era => :genroku, :e_y =>  4, :e_m => 12, :g_y => 1692, :g_m =>  1, :g_d => 18},

             {:era => :genroku, :e_y =>  5, :e_m =>  1, :g_y => 1692, :g_m =>  2, :g_d => 17},
             {:era => :genroku, :e_y =>  5, :e_m =>  2, :g_y => 1692, :g_m =>  3, :g_d => 18},
             {:era => :genroku, :e_y =>  5, :e_m =>  3, :g_y => 1692, :g_m =>  4, :g_d => 16},
             {:era => :genroku, :e_y =>  5, :e_m =>  4, :g_y => 1692, :g_m =>  5, :g_d => 16},
             {:era => :genroku, :e_y =>  5, :e_m =>  5, :g_y => 1692, :g_m =>  6, :g_d => 15},
             {:era => :genroku, :e_y =>  5, :e_m =>  6, :g_y => 1692, :g_m =>  7, :g_d => 14},
             {:era => :genroku, :e_y =>  5, :e_m =>  7, :g_y => 1692, :g_m =>  8, :g_d => 12},
             {:era => :genroku, :e_y =>  5, :e_m =>  8, :g_y => 1692, :g_m =>  9, :g_d => 11},
             {:era => :genroku, :e_y =>  5, :e_m =>  9, :g_y => 1692, :g_m => 10, :g_d => 10},
             {:era => :genroku, :e_y =>  5, :e_m => 10, :g_y => 1692, :g_m => 11, :g_d =>  8},
             {:era => :genroku, :e_y =>  5, :e_m => 11, :g_y => 1692, :g_m => 12, :g_d =>  8},
             {:era => :genroku, :e_y =>  5, :e_m => 12, :g_y => 1693, :g_m =>  1, :g_d =>  6},

             {:era => :genroku, :e_y =>  6, :e_m =>  1, :g_y => 1693, :g_m =>  2, :g_d =>  5},
             {:era => :genroku, :e_y =>  6, :e_m =>  2, :g_y => 1693, :g_m =>  3, :g_d =>  7},
             {:era => :genroku, :e_y =>  6, :e_m =>  3, :g_y => 1693, :g_m =>  4, :g_d =>  6},
             {:era => :genroku, :e_y =>  6, :e_m =>  4, :g_y => 1693, :g_m =>  5, :g_d =>  5},
             {:era => :genroku, :e_y =>  6, :e_m =>  5, :g_y => 1693, :g_m =>  6, :g_d =>  4},
             {:era => :genroku, :e_y =>  6, :e_m =>  6, :g_y => 1693, :g_m =>  7, :g_d =>  3},
             {:era => :genroku, :e_y =>  6, :e_m =>  7, :g_y => 1693, :g_m =>  8, :g_d =>  2},
             {:era => :genroku, :e_y =>  6, :e_m =>  8, :g_y => 1693, :g_m =>  8, :g_d => 31},
             {:era => :genroku, :e_y =>  6, :e_m =>  9, :g_y => 1693, :g_m =>  9, :g_d => 30},
             {:era => :genroku, :e_y =>  6, :e_m => 10, :g_y => 1693, :g_m => 10, :g_d => 29},
             {:era => :genroku, :e_y =>  6, :e_m => 11, :g_y => 1693, :g_m => 11, :g_d => 27},
             {:era => :genroku, :e_y =>  6, :e_m => 12, :g_y => 1693, :g_m => 12, :g_d => 27},

             {:era => :genroku, :e_y =>  7, :e_m =>  1, :g_y => 1694, :g_m =>  1, :g_d => 25},
             {:era => :genroku, :e_y =>  7, :e_m =>  2, :g_y => 1694, :g_m =>  2, :g_d => 24},
             {:era => :genroku, :e_y =>  7, :e_m =>  3, :g_y => 1694, :g_m =>  3, :g_d => 26},
             {:era => :genroku, :e_y =>  7, :e_m =>  4, :g_y => 1694, :g_m =>  4, :g_d => 24},
             {:era => :genroku, :e_y =>  7, :e_m =>  5, :g_y => 1694, :g_m =>  5, :g_d => 24},
             {:era => :genroku, :e_y =>  7, :e_m =>  5, :g_y => 1694, :g_m =>  6, :g_d => 23, :leap_month => true},
             {:era => :genroku, :e_y =>  7, :e_m =>  6, :g_y => 1694, :g_m =>  7, :g_d => 22},
             {:era => :genroku, :e_y =>  7, :e_m =>  7, :g_y => 1694, :g_m =>  8, :g_d => 21},
             {:era => :genroku, :e_y =>  7, :e_m =>  8, :g_y => 1694, :g_m =>  9, :g_d => 19},
             {:era => :genroku, :e_y =>  7, :e_m =>  9, :g_y => 1694, :g_m => 10, :g_d => 19},
             {:era => :genroku, :e_y =>  7, :e_m => 10, :g_y => 1694, :g_m => 11, :g_d => 17},
             {:era => :genroku, :e_y =>  7, :e_m => 11, :g_y => 1694, :g_m => 12, :g_d => 17},
             {:era => :genroku, :e_y =>  7, :e_m => 12, :g_y => 1695, :g_m =>  1, :g_d => 15},

             {:era => :genroku, :e_y =>  8, :e_m =>  1, :g_y => 1695, :g_m =>  2, :g_d => 13},
             {:era => :genroku, :e_y =>  8, :e_m =>  2, :g_y => 1695, :g_m =>  3, :g_d => 15},
             {:era => :genroku, :e_y =>  8, :e_m =>  3, :g_y => 1695, :g_m =>  4, :g_d => 13},
             {:era => :genroku, :e_y =>  8, :e_m =>  4, :g_y => 1695, :g_m =>  5, :g_d => 13},
             {:era => :genroku, :e_y =>  8, :e_m =>  5, :g_y => 1695, :g_m =>  6, :g_d => 12},
             {:era => :genroku, :e_y =>  8, :e_m =>  6, :g_y => 1695, :g_m =>  7, :g_d => 11},
             {:era => :genroku, :e_y =>  8, :e_m =>  7, :g_y => 1695, :g_m =>  8, :g_d => 10},
             {:era => :genroku, :e_y =>  8, :e_m =>  8, :g_y => 1695, :g_m =>  9, :g_d =>  8},
             {:era => :genroku, :e_y =>  8, :e_m =>  9, :g_y => 1695, :g_m => 10, :g_d =>  8},
             {:era => :genroku, :e_y =>  8, :e_m => 10, :g_y => 1695, :g_m => 11, :g_d =>  7},
             {:era => :genroku, :e_y =>  8, :e_m => 11, :g_y => 1695, :g_m => 12, :g_d =>  6},
             {:era => :genroku, :e_y =>  8, :e_m => 12, :g_y => 1696, :g_m =>  1, :g_d =>  5},

             {:era => :genroku, :e_y =>  9, :e_m =>  1, :g_y => 1696, :g_m =>  2, :g_d =>  3},
             {:era => :genroku, :e_y =>  9, :e_m =>  2, :g_y => 1696, :g_m =>  3, :g_d =>  4},
             {:era => :genroku, :e_y =>  9, :e_m =>  3, :g_y => 1696, :g_m =>  4, :g_d =>  2},
             {:era => :genroku, :e_y =>  9, :e_m =>  4, :g_y => 1696, :g_m =>  5, :g_d =>  1},
             {:era => :genroku, :e_y =>  9, :e_m =>  5, :g_y => 1696, :g_m =>  5, :g_d => 31},
             {:era => :genroku, :e_y =>  9, :e_m =>  6, :g_y => 1696, :g_m =>  6, :g_d => 29},
             {:era => :genroku, :e_y =>  9, :e_m =>  7, :g_y => 1696, :g_m =>  7, :g_d => 29},
             {:era => :genroku, :e_y =>  9, :e_m =>  8, :g_y => 1696, :g_m =>  8, :g_d => 28},
             {:era => :genroku, :e_y =>  9, :e_m =>  9, :g_y => 1696, :g_m =>  9, :g_d => 26},
             {:era => :genroku, :e_y =>  9, :e_m => 10, :g_y => 1696, :g_m => 10, :g_d => 26},
             {:era => :genroku, :e_y =>  9, :e_m => 11, :g_y => 1696, :g_m => 11, :g_d => 25},
             {:era => :genroku, :e_y =>  9, :e_m => 12, :g_y => 1696, :g_m => 12, :g_d => 24},

             {:era => :genroku, :e_y => 10, :e_m =>  1, :g_y => 1697, :g_m =>  1, :g_d => 23},
             {:era => :genroku, :e_y => 10, :e_m =>  2, :g_y => 1697, :g_m =>  2, :g_d => 21},
             {:era => :genroku, :e_y => 10, :e_m =>  2, :g_y => 1697, :g_m =>  3, :g_d => 23, :leap_month => true},
             {:era => :genroku, :e_y => 10, :e_m =>  3, :g_y => 1697, :g_m =>  4, :g_d => 21},
             {:era => :genroku, :e_y => 10, :e_m =>  4, :g_y => 1697, :g_m =>  5, :g_d => 21},
             {:era => :genroku, :e_y => 10, :e_m =>  5, :g_y => 1697, :g_m =>  6, :g_d => 19},
             {:era => :genroku, :e_y => 10, :e_m =>  6, :g_y => 1697, :g_m =>  7, :g_d => 19},
             {:era => :genroku, :e_y => 10, :e_m =>  7, :g_y => 1697, :g_m =>  8, :g_d => 17},
             {:era => :genroku, :e_y => 10, :e_m =>  8, :g_y => 1697, :g_m =>  9, :g_d => 16},
             {:era => :genroku, :e_y => 10, :e_m =>  9, :g_y => 1697, :g_m => 10, :g_d => 15},
             {:era => :genroku, :e_y => 10, :e_m => 10, :g_y => 1697, :g_m => 11, :g_d => 14},
             {:era => :genroku, :e_y => 10, :e_m => 11, :g_y => 1697, :g_m => 12, :g_d => 13},
             {:era => :genroku, :e_y => 10, :e_m => 12, :g_y => 1698, :g_m =>  1, :g_d => 12},

             {:era => :genroku, :e_y => 11, :e_m =>  1, :g_y => 1698, :g_m =>  2, :g_d => 11},
             {:era => :genroku, :e_y => 11, :e_m =>  2, :g_y => 1698, :g_m =>  3, :g_d => 12},
             {:era => :genroku, :e_y => 11, :e_m =>  3, :g_y => 1698, :g_m =>  4, :g_d => 11},
             {:era => :genroku, :e_y => 11, :e_m =>  4, :g_y => 1698, :g_m =>  5, :g_d => 10},
             {:era => :genroku, :e_y => 11, :e_m =>  5, :g_y => 1698, :g_m =>  6, :g_d =>  8},
             {:era => :genroku, :e_y => 11, :e_m =>  6, :g_y => 1698, :g_m =>  7, :g_d =>  8},
             {:era => :genroku, :e_y => 11, :e_m =>  7, :g_y => 1698, :g_m =>  8, :g_d =>  6},
             {:era => :genroku, :e_y => 11, :e_m =>  8, :g_y => 1698, :g_m =>  9, :g_d =>  4},
             {:era => :genroku, :e_y => 11, :e_m =>  9, :g_y => 1698, :g_m => 10, :g_d =>  4},
             {:era => :genroku, :e_y => 11, :e_m => 10, :g_y => 1698, :g_m => 11, :g_d =>  3},
             {:era => :genroku, :e_y => 11, :e_m => 11, :g_y => 1698, :g_m => 12, :g_d =>  2},
             {:era => :genroku, :e_y => 11, :e_m => 12, :g_y => 1699, :g_m =>  1, :g_d =>  1},

             {:era => :genroku, :e_y => 12, :e_m =>  1, :g_y => 1699, :g_m =>  1, :g_d => 31},
             {:era => :genroku, :e_y => 12, :e_m =>  2, :g_y => 1699, :g_m =>  3, :g_d =>  2},
             {:era => :genroku, :e_y => 12, :e_m =>  3, :g_y => 1699, :g_m =>  3, :g_d => 31},
             {:era => :genroku, :e_y => 12, :e_m =>  4, :g_y => 1699, :g_m =>  4, :g_d => 30},
             {:era => :genroku, :e_y => 12, :e_m =>  5, :g_y => 1699, :g_m =>  5, :g_d => 29},
             {:era => :genroku, :e_y => 12, :e_m =>  6, :g_y => 1699, :g_m =>  6, :g_d => 27},
             {:era => :genroku, :e_y => 12, :e_m =>  7, :g_y => 1699, :g_m =>  7, :g_d => 27},
             {:era => :genroku, :e_y => 12, :e_m =>  8, :g_y => 1699, :g_m =>  8, :g_d => 25},
             {:era => :genroku, :e_y => 12, :e_m =>  9, :g_y => 1699, :g_m =>  9, :g_d => 23},
             {:era => :genroku, :e_y => 12, :e_m =>  9, :g_y => 1699, :g_m => 10, :g_d => 23, :leap_month => true},
             {:era => :genroku, :e_y => 12, :e_m => 10, :g_y => 1699, :g_m => 11, :g_d => 21},
             {:era => :genroku, :e_y => 12, :e_m => 11, :g_y => 1699, :g_m => 12, :g_d => 21},
             {:era => :genroku, :e_y => 12, :e_m => 12, :g_y => 1700, :g_m =>  1, :g_d => 20},

             {:era => :genroku, :e_y => 13, :e_m =>  1, :g_y => 1700, :g_m =>  2, :g_d => 19},
             {:era => :genroku, :e_y => 13, :e_m =>  2, :g_y => 1700, :g_m =>  3, :g_d => 21},
             {:era => :genroku, :e_y => 13, :e_m =>  3, :g_y => 1700, :g_m =>  4, :g_d => 19},
             {:era => :genroku, :e_y => 13, :e_m =>  4, :g_y => 1700, :g_m =>  5, :g_d => 19},
             {:era => :genroku, :e_y => 13, :e_m =>  5, :g_y => 1700, :g_m =>  6, :g_d => 17},
             {:era => :genroku, :e_y => 13, :e_m =>  6, :g_y => 1700, :g_m =>  7, :g_d => 16},
             {:era => :genroku, :e_y => 13, :e_m =>  7, :g_y => 1700, :g_m =>  8, :g_d => 15},
             {:era => :genroku, :e_y => 13, :e_m =>  8, :g_y => 1700, :g_m =>  9, :g_d => 13},
             {:era => :genroku, :e_y => 13, :e_m =>  9, :g_y => 1700, :g_m => 10, :g_d => 12},
             {:era => :genroku, :e_y => 13, :e_m => 10, :g_y => 1700, :g_m => 11, :g_d => 11},
             {:era => :genroku, :e_y => 13, :e_m => 11, :g_y => 1700, :g_m => 12, :g_d => 10},
             {:era => :genroku, :e_y => 13, :e_m => 12, :g_y => 1701, :g_m =>  1, :g_d =>  9},

             {:era => :genroku, :e_y => 14, :e_m =>  1, :g_y => 1701, :g_m =>  2, :g_d =>  8},
             {:era => :genroku, :e_y => 14, :e_m =>  2, :g_y => 1701, :g_m =>  3, :g_d => 10},
             {:era => :genroku, :e_y => 14, :e_m =>  3, :g_y => 1701, :g_m =>  4, :g_d =>  8},
             {:era => :genroku, :e_y => 14, :e_m =>  4, :g_y => 1701, :g_m =>  5, :g_d =>  8},
             {:era => :genroku, :e_y => 14, :e_m =>  5, :g_y => 1701, :g_m =>  6, :g_d =>  6},
             {:era => :genroku, :e_y => 14, :e_m =>  6, :g_y => 1701, :g_m =>  7, :g_d =>  6},
             {:era => :genroku, :e_y => 14, :e_m =>  7, :g_y => 1701, :g_m =>  8, :g_d =>  4},
             {:era => :genroku, :e_y => 14, :e_m =>  8, :g_y => 1701, :g_m =>  9, :g_d =>  3},
             {:era => :genroku, :e_y => 14, :e_m =>  9, :g_y => 1701, :g_m => 10, :g_d =>  2},
             {:era => :genroku, :e_y => 14, :e_m => 10, :g_y => 1701, :g_m => 10, :g_d => 31},
             {:era => :genroku, :e_y => 14, :e_m => 11, :g_y => 1701, :g_m => 11, :g_d => 30},
             {:era => :genroku, :e_y => 14, :e_m => 12, :g_y => 1701, :g_m => 12, :g_d => 29},

             {:era => :genroku, :e_y => 15, :e_m =>  1, :g_y => 1702, :g_m =>  1, :g_d => 28},
             {:era => :genroku, :e_y => 15, :e_m =>  2, :g_y => 1702, :g_m =>  2, :g_d => 27},
             {:era => :genroku, :e_y => 15, :e_m =>  3, :g_y => 1702, :g_m =>  3, :g_d => 28},
             {:era => :genroku, :e_y => 15, :e_m =>  4, :g_y => 1702, :g_m =>  4, :g_d => 27},
             {:era => :genroku, :e_y => 15, :e_m =>  5, :g_y => 1702, :g_m =>  5, :g_d => 27},
             {:era => :genroku, :e_y => 15, :e_m =>  6, :g_y => 1702, :g_m =>  6, :g_d => 25},
             {:era => :genroku, :e_y => 15, :e_m =>  7, :g_y => 1702, :g_m =>  7, :g_d => 25},
             {:era => :genroku, :e_y => 15, :e_m =>  8, :g_y => 1702, :g_m =>  8, :g_d => 23},
             {:era => :genroku, :e_y => 15, :e_m =>  8, :g_y => 1702, :g_m =>  9, :g_d => 22, :leap_month => true},
             {:era => :genroku, :e_y => 15, :e_m =>  9, :g_y => 1702, :g_m => 10, :g_d => 21},
             {:era => :genroku, :e_y => 15, :e_m => 10, :g_y => 1702, :g_m => 11, :g_d => 19},
             {:era => :genroku, :e_y => 15, :e_m => 11, :g_y => 1702, :g_m => 12, :g_d => 19},
             {:era => :genroku, :e_y => 15, :e_m => 12, :g_y => 1703, :g_m =>  1, :g_d => 17},

             {:era => :genroku, :e_y => 16, :e_m =>  1, :g_y => 1703, :g_m =>  2, :g_d => 16},
             {:era => :genroku, :e_y => 16, :e_m =>  2, :g_y => 1703, :g_m =>  3, :g_d => 17},
             {:era => :genroku, :e_y => 16, :e_m =>  3, :g_y => 1703, :g_m =>  4, :g_d => 16},
             {:era => :genroku, :e_y => 16, :e_m =>  4, :g_y => 1703, :g_m =>  5, :g_d => 16},
             {:era => :genroku, :e_y => 16, :e_m =>  5, :g_y => 1703, :g_m =>  6, :g_d => 14},
             {:era => :genroku, :e_y => 16, :e_m =>  6, :g_y => 1703, :g_m =>  7, :g_d => 14},
             {:era => :genroku, :e_y => 16, :e_m =>  7, :g_y => 1703, :g_m =>  8, :g_d => 13},
             {:era => :genroku, :e_y => 16, :e_m =>  8, :g_y => 1703, :g_m =>  9, :g_d => 11},
             {:era => :genroku, :e_y => 16, :e_m =>  9, :g_y => 1703, :g_m => 10, :g_d => 11},
             {:era => :genroku, :e_y => 16, :e_m => 10, :g_y => 1703, :g_m => 11, :g_d =>  9},
             {:era => :genroku, :e_y => 16, :e_m => 11, :g_y => 1703, :g_m => 12, :g_d =>  9},
             {:era => :genroku, :e_y => 16, :e_m => 12, :g_y => 1704, :g_m =>  1, :g_d =>  7},

             {:era => :genroku, :e_y => 17, :e_m =>  1, :g_y => 1704, :g_m =>  2, :g_d =>  5},
             {:era => :genroku, :e_y => 17, :e_m =>  2, :g_y => 1704, :g_m =>  3, :g_d =>  6},
             {:era => :genroku, :e_y => 17, :e_m =>  3, :g_y => 1704, :g_m =>  4, :g_d =>  4},
             {:era => :genroku, :e_y => 17, :e_m =>  4, :g_y => 1704, :g_m =>  5, :g_d =>  4},
             {:era => :genroku, :e_y => 17, :e_m =>  5, :g_y => 1704, :g_m =>  6, :g_d =>  2},
             {:era => :genroku, :e_y => 17, :e_m =>  6, :g_y => 1704, :g_m =>  7, :g_d =>  2},
             {:era => :genroku, :e_y => 17, :e_m =>  7, :g_y => 1704, :g_m =>  8, :g_d =>  1},
             {:era => :genroku, :e_y => 17, :e_m =>  8, :g_y => 1704, :g_m =>  8, :g_d => 30},
             {:era => :genroku, :e_y => 17, :e_m =>  9, :g_y => 1704, :g_m =>  9, :g_d => 29},
             {:era => :genroku, :e_y => 17, :e_m => 10, :g_y => 1704, :g_m => 10, :g_d => 29},
             {:era => :genroku, :e_y => 17, :e_m => 11, :g_y => 1704, :g_m => 11, :g_d => 27},
             {:era => :genroku, :e_y => 17, :e_m => 12, :g_y => 1704, :g_m => 12, :g_d => 27},

            ]

    add_era_table table
  end # Date
end # Wareki
