# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'H%C5%8Dreki' # 
    # KANJI_ERA_NAME = '宝暦'

    # 宝暦
    # http://ja.wikipedia.org/wiki/%E5%AE%9D%E6%9A%A6
    # | 宝暦元年 (辛未)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |     閏六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1751/01/27 | 1751/02/26 | 1751/03/27 | 1751/04/26 | 1751/05/25 | 1751/06/23 | 1751/07/23 | 1751/08/21 | 1751/09/20 | 1751/10/19 | 1751/11/18 | 1751/12/18 | 1752/01/16 |
    # | 宝暦二年 (壬申)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1752/02/15 | 1752/03/16 | 1752/04/14 | 1752/05/14 | 1752/06/12 | 1752/07/11 | 1752/08/10 | 1752/09/08 | 1752/10/07 | 1752/11/06 | 1752/12/06 | 1753/01/04 |
    # | 宝暦三年 (癸酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1753/02/03 | 1753/03/05 | 1753/04/04 | 1753/05/03 | 1753/06/02 | 1753/07/01 | 1753/07/30 | 1753/08/29 | 1753/09/27 | 1753/10/26 | 1753/11/25 | 1753/12/25 |
    # | 宝暦四年 (甲戌)     |       一月 |       二月 |     閏二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1754/01/23 | 1754/02/22 | 1754/03/24 | 1754/04/22 | 1754/05/22 | 1754/06/21 | 1754/07/20 | 1754/08/18 | 1754/09/17 | 1754/10/16 | 1754/11/14 | 1754/12/14 | 1755/01/12 |
    # | 宝暦五年 (乙亥)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1755/02/11 | 1755/03/13 | 1755/04/12 | 1755/05/11 | 1755/06/10 | 1755/07/09 | 1755/08/08 | 1755/09/06 | 1755/10/06 | 1755/11/04 | 1755/12/03 | 1756/01/02 |
    # | 宝暦六年 (丙子)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |   閏十一月 |     十二月 |
    # |        グレゴリオ暦 | 1756/01/31 | 1756/03/01 | 1756/03/31 | 1756/04/29 | 1756/05/29 | 1756/06/27 | 1756/07/27 | 1756/08/26 | 1756/09/24 | 1756/10/24 | 1756/11/22 | 1756/12/22 | 1757/01/20 |
    # | 宝暦七年 (丁丑)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1757/02/18 | 1757/03/20 | 1757/04/18 | 1757/05/18 | 1757/06/17 | 1757/07/16 | 1757/08/15 | 1757/09/13 | 1757/10/13 | 1757/11/12 | 1757/12/11 | 1758/01/10 |
    # | 宝暦八年 (戊寅)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1758/02/08 | 1758/03/10 | 1758/04/08 | 1758/05/07 | 1758/06/06 | 1758/07/05 | 1758/08/04 | 1758/09/02 | 1758/10/02 | 1758/11/01 | 1758/12/01 | 1758/12/30 |
    # | 宝暦九年 (己卯)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |     閏七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1759/01/29 | 1759/02/27 | 1759/03/29 | 1759/04/27 | 1759/05/26 | 1759/06/25 | 1759/07/24 | 1759/08/23 | 1759/09/21 | 1759/10/21 | 1759/11/20 | 1759/12/19 | 1760/01/18 |
    # | 宝暦十年 (庚辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1760/02/17 | 1760/03/17 | 1760/04/16 | 1760/05/15 | 1760/06/13 | 1760/07/13 | 1760/08/11 | 1760/09/09 | 1760/10/09 | 1760/11/08 | 1760/12/07 | 1761/01/06 |
    # | 宝暦十一年 (辛巳)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1761/02/05 | 1761/03/07 | 1761/04/05 | 1761/05/05 | 1761/06/03 | 1761/07/02 | 1761/08/01 | 1761/08/30 | 1761/09/28 | 1761/10/28 | 1761/11/26 | 1761/12/26 |
    # | 宝暦十二年 (壬午)   |       一月 |       二月 |       三月 |       四月 |     閏四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1762/01/25 | 1762/02/24 | 1762/03/26 | 1762/04/24 | 1762/05/24 | 1762/06/22 | 1762/07/21 | 1762/08/20 | 1762/09/18 | 1762/10/17 | 1762/11/16 | 1762/12/15 | 1763/01/14 |
    # | 宝暦十三年 (癸未)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1763/02/13 | 1763/03/15 | 1763/04/13 | 1763/05/13 | 1763/06/11 | 1763/07/11 | 1763/08/09 | 1763/09/08 | 1763/10/07 | 1763/11/05 | 1763/12/05 | 1764/01/03 |
    # | 宝暦十四年 (甲申)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |   閏十二月 |
    # |        グレゴリオ暦 | 1764/02/02 | 1764/03/03 | 1764/04/01 | 1764/05/01 | 1764/05/31 | 1764/06/29 | 1764/07/29 | 1764/08/27 | 1764/09/26 | 1764/10/25 | 1764/11/23 | 1764/12/23 | 1765/01/21 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :horeki, :e_y =>  1, :e_m =>  1, :g_y => 1751, :g_m =>  1, :g_d => 27},
             {:era => :horeki, :e_y =>  1, :e_m =>  2, :g_y => 1751, :g_m =>  2, :g_d => 26},
             {:era => :horeki, :e_y =>  1, :e_m =>  3, :g_y => 1751, :g_m =>  3, :g_d => 27},
             {:era => :horeki, :e_y =>  1, :e_m =>  4, :g_y => 1751, :g_m =>  4, :g_d => 26},
             {:era => :horeki, :e_y =>  1, :e_m =>  5, :g_y => 1751, :g_m =>  5, :g_d => 25},
             {:era => :horeki, :e_y =>  1, :e_m =>  6, :g_y => 1751, :g_m =>  6, :g_d => 23},
             {:era => :horeki, :e_y =>  1, :e_m =>  6, :g_y => 1751, :g_m =>  7, :g_d => 23, :leap_month => true},
             {:era => :horeki, :e_y =>  1, :e_m =>  7, :g_y => 1751, :g_m =>  8, :g_d => 21},
             {:era => :horeki, :e_y =>  1, :e_m =>  8, :g_y => 1751, :g_m =>  9, :g_d => 20},
             {:era => :horeki, :e_y =>  1, :e_m =>  9, :g_y => 1751, :g_m => 10, :g_d => 19},
             {:era => :horeki, :e_y =>  1, :e_m => 10, :g_y => 1751, :g_m => 11, :g_d => 18},
             {:era => :horeki, :e_y =>  1, :e_m => 11, :g_y => 1751, :g_m => 12, :g_d => 18},
             {:era => :horeki, :e_y =>  1, :e_m => 12, :g_y => 1752, :g_m =>  1, :g_d => 16},

             {:era => :horeki, :e_y =>  2, :e_m =>  1, :g_y => 1752, :g_m =>  2, :g_d => 15},
             {:era => :horeki, :e_y =>  2, :e_m =>  2, :g_y => 1752, :g_m =>  3, :g_d => 16},
             {:era => :horeki, :e_y =>  2, :e_m =>  3, :g_y => 1752, :g_m =>  4, :g_d => 14},
             {:era => :horeki, :e_y =>  2, :e_m =>  4, :g_y => 1752, :g_m =>  5, :g_d => 14},
             {:era => :horeki, :e_y =>  2, :e_m =>  5, :g_y => 1752, :g_m =>  6, :g_d => 12},
             {:era => :horeki, :e_y =>  2, :e_m =>  6, :g_y => 1752, :g_m =>  7, :g_d => 11},
             {:era => :horeki, :e_y =>  2, :e_m =>  7, :g_y => 1752, :g_m =>  8, :g_d => 10},
             {:era => :horeki, :e_y =>  2, :e_m =>  8, :g_y => 1752, :g_m =>  9, :g_d =>  8},
             {:era => :horeki, :e_y =>  2, :e_m =>  9, :g_y => 1752, :g_m => 10, :g_d =>  7},
             {:era => :horeki, :e_y =>  2, :e_m => 10, :g_y => 1752, :g_m => 11, :g_d =>  6},
             {:era => :horeki, :e_y =>  2, :e_m => 11, :g_y => 1752, :g_m => 12, :g_d =>  6},
             {:era => :horeki, :e_y =>  2, :e_m => 12, :g_y => 1753, :g_m =>  1, :g_d =>  4},

             {:era => :horeki, :e_y =>  3, :e_m =>  1, :g_y => 1753, :g_m =>  2, :g_d =>  3},
             {:era => :horeki, :e_y =>  3, :e_m =>  2, :g_y => 1753, :g_m =>  3, :g_d =>  5},
             {:era => :horeki, :e_y =>  3, :e_m =>  3, :g_y => 1753, :g_m =>  4, :g_d =>  4},
             {:era => :horeki, :e_y =>  3, :e_m =>  4, :g_y => 1753, :g_m =>  5, :g_d =>  3},
             {:era => :horeki, :e_y =>  3, :e_m =>  5, :g_y => 1753, :g_m =>  6, :g_d =>  2},
             {:era => :horeki, :e_y =>  3, :e_m =>  6, :g_y => 1753, :g_m =>  7, :g_d =>  1},
             {:era => :horeki, :e_y =>  3, :e_m =>  7, :g_y => 1753, :g_m =>  7, :g_d => 30},
             {:era => :horeki, :e_y =>  3, :e_m =>  8, :g_y => 1753, :g_m =>  8, :g_d => 29},
             {:era => :horeki, :e_y =>  3, :e_m =>  9, :g_y => 1753, :g_m =>  9, :g_d => 27},
             {:era => :horeki, :e_y =>  3, :e_m => 10, :g_y => 1753, :g_m => 10, :g_d => 26},
             {:era => :horeki, :e_y =>  3, :e_m => 11, :g_y => 1753, :g_m => 11, :g_d => 25},
             {:era => :horeki, :e_y =>  3, :e_m => 12, :g_y => 1753, :g_m => 12, :g_d => 25},

             {:era => :horeki, :e_y =>  4, :e_m =>  1, :g_y => 1754, :g_m =>  1, :g_d => 23},
             {:era => :horeki, :e_y =>  4, :e_m =>  2, :g_y => 1754, :g_m =>  2, :g_d => 22},
             {:era => :horeki, :e_y =>  4, :e_m =>  2, :g_y => 1754, :g_m =>  3, :g_d => 24, :leap_month => true},
             {:era => :horeki, :e_y =>  4, :e_m =>  3, :g_y => 1754, :g_m =>  4, :g_d => 22},
             {:era => :horeki, :e_y =>  4, :e_m =>  4, :g_y => 1754, :g_m =>  5, :g_d => 22},
             {:era => :horeki, :e_y =>  4, :e_m =>  5, :g_y => 1754, :g_m =>  6, :g_d => 21},
             {:era => :horeki, :e_y =>  4, :e_m =>  6, :g_y => 1754, :g_m =>  7, :g_d => 20},
             {:era => :horeki, :e_y =>  4, :e_m =>  7, :g_y => 1754, :g_m =>  8, :g_d => 18},
             {:era => :horeki, :e_y =>  4, :e_m =>  8, :g_y => 1754, :g_m =>  9, :g_d => 17},
             {:era => :horeki, :e_y =>  4, :e_m =>  9, :g_y => 1754, :g_m => 10, :g_d => 16},
             {:era => :horeki, :e_y =>  4, :e_m => 10, :g_y => 1754, :g_m => 11, :g_d => 14},
             {:era => :horeki, :e_y =>  4, :e_m => 11, :g_y => 1754, :g_m => 12, :g_d => 14},
             {:era => :horeki, :e_y =>  4, :e_m => 12, :g_y => 1755, :g_m =>  1, :g_d => 12},

             {:era => :horeki, :e_y =>  5, :e_m =>  1, :g_y => 1755, :g_m =>  2, :g_d => 11},
             {:era => :horeki, :e_y =>  5, :e_m =>  2, :g_y => 1755, :g_m =>  3, :g_d => 13},
             {:era => :horeki, :e_y =>  5, :e_m =>  3, :g_y => 1755, :g_m =>  4, :g_d => 12},
             {:era => :horeki, :e_y =>  5, :e_m =>  4, :g_y => 1755, :g_m =>  5, :g_d => 11},
             {:era => :horeki, :e_y =>  5, :e_m =>  5, :g_y => 1755, :g_m =>  6, :g_d => 10},
             {:era => :horeki, :e_y =>  5, :e_m =>  6, :g_y => 1755, :g_m =>  7, :g_d =>  9},
             {:era => :horeki, :e_y =>  5, :e_m =>  7, :g_y => 1755, :g_m =>  8, :g_d =>  8},
             {:era => :horeki, :e_y =>  5, :e_m =>  8, :g_y => 1755, :g_m =>  9, :g_d =>  6},
             {:era => :horeki, :e_y =>  5, :e_m =>  9, :g_y => 1755, :g_m => 10, :g_d =>  6},
             {:era => :horeki, :e_y =>  5, :e_m => 10, :g_y => 1755, :g_m => 11, :g_d =>  4},
             {:era => :horeki, :e_y =>  5, :e_m => 11, :g_y => 1755, :g_m => 12, :g_d =>  3},
             {:era => :horeki, :e_y =>  5, :e_m => 12, :g_y => 1756, :g_m =>  1, :g_d =>  2},

             {:era => :horeki, :e_y =>  6, :e_m =>  1, :g_y => 1756, :g_m =>  1, :g_d => 31},
             {:era => :horeki, :e_y =>  6, :e_m =>  2, :g_y => 1756, :g_m =>  3, :g_d =>  1},
             {:era => :horeki, :e_y =>  6, :e_m =>  3, :g_y => 1756, :g_m =>  3, :g_d => 31},
             {:era => :horeki, :e_y =>  6, :e_m =>  4, :g_y => 1756, :g_m =>  4, :g_d => 29},
             {:era => :horeki, :e_y =>  6, :e_m =>  5, :g_y => 1756, :g_m =>  5, :g_d => 29},
             {:era => :horeki, :e_y =>  6, :e_m =>  6, :g_y => 1756, :g_m =>  6, :g_d => 27},
             {:era => :horeki, :e_y =>  6, :e_m =>  7, :g_y => 1756, :g_m =>  7, :g_d => 27},
             {:era => :horeki, :e_y =>  6, :e_m =>  8, :g_y => 1756, :g_m =>  8, :g_d => 26},
             {:era => :horeki, :e_y =>  6, :e_m =>  9, :g_y => 1756, :g_m =>  9, :g_d => 24},
             {:era => :horeki, :e_y =>  6, :e_m => 10, :g_y => 1756, :g_m => 10, :g_d => 24},
             {:era => :horeki, :e_y =>  6, :e_m => 11, :g_y => 1756, :g_m => 11, :g_d => 22},
             {:era => :horeki, :e_y =>  6, :e_m => 11, :g_y => 1756, :g_m => 12, :g_d => 22, :leap_month => true},
             {:era => :horeki, :e_y =>  6, :e_m => 12, :g_y => 1757, :g_m =>  1, :g_d => 20},

             {:era => :horeki, :e_y =>  7, :e_m =>  1, :g_y => 1757, :g_m =>  2, :g_d => 18},
             {:era => :horeki, :e_y =>  7, :e_m =>  2, :g_y => 1757, :g_m =>  3, :g_d => 20},
             {:era => :horeki, :e_y =>  7, :e_m =>  3, :g_y => 1757, :g_m =>  4, :g_d => 18},
             {:era => :horeki, :e_y =>  7, :e_m =>  4, :g_y => 1757, :g_m =>  5, :g_d => 18},
             {:era => :horeki, :e_y =>  7, :e_m =>  5, :g_y => 1757, :g_m =>  6, :g_d => 17},
             {:era => :horeki, :e_y =>  7, :e_m =>  6, :g_y => 1757, :g_m =>  7, :g_d => 16},
             {:era => :horeki, :e_y =>  7, :e_m =>  7, :g_y => 1757, :g_m =>  8, :g_d => 15},
             {:era => :horeki, :e_y =>  7, :e_m =>  8, :g_y => 1757, :g_m =>  9, :g_d => 13},
             {:era => :horeki, :e_y =>  7, :e_m =>  9, :g_y => 1757, :g_m => 10, :g_d => 13},
             {:era => :horeki, :e_y =>  7, :e_m => 10, :g_y => 1757, :g_m => 11, :g_d => 12},
             {:era => :horeki, :e_y =>  7, :e_m => 11, :g_y => 1757, :g_m => 12, :g_d => 11},
             {:era => :horeki, :e_y =>  7, :e_m => 12, :g_y => 1758, :g_m =>  1, :g_d => 10},

             {:era => :horeki, :e_y =>  8, :e_m =>  1, :g_y => 1758, :g_m =>  2, :g_d =>  8},
             {:era => :horeki, :e_y =>  8, :e_m =>  2, :g_y => 1758, :g_m =>  3, :g_d => 10},
             {:era => :horeki, :e_y =>  8, :e_m =>  3, :g_y => 1758, :g_m =>  4, :g_d =>  8},
             {:era => :horeki, :e_y =>  8, :e_m =>  4, :g_y => 1758, :g_m =>  5, :g_d =>  7},
             {:era => :horeki, :e_y =>  8, :e_m =>  5, :g_y => 1758, :g_m =>  6, :g_d =>  6},
             {:era => :horeki, :e_y =>  8, :e_m =>  6, :g_y => 1758, :g_m =>  7, :g_d =>  5},
             {:era => :horeki, :e_y =>  8, :e_m =>  7, :g_y => 1758, :g_m =>  8, :g_d =>  4},
             {:era => :horeki, :e_y =>  8, :e_m =>  8, :g_y => 1758, :g_m =>  9, :g_d =>  2},
             {:era => :horeki, :e_y =>  8, :e_m =>  9, :g_y => 1758, :g_m => 10, :g_d =>  2},
             {:era => :horeki, :e_y =>  8, :e_m => 10, :g_y => 1758, :g_m => 11, :g_d =>  1},
             {:era => :horeki, :e_y =>  8, :e_m => 11, :g_y => 1758, :g_m => 12, :g_d =>  1},
             {:era => :horeki, :e_y =>  8, :e_m => 12, :g_y => 1758, :g_m => 12, :g_d => 30},

             {:era => :horeki, :e_y =>  9, :e_m =>  1, :g_y => 1759, :g_m =>  1, :g_d => 29},
             {:era => :horeki, :e_y =>  9, :e_m =>  2, :g_y => 1759, :g_m =>  2, :g_d => 27},
             {:era => :horeki, :e_y =>  9, :e_m =>  3, :g_y => 1759, :g_m =>  3, :g_d => 29},
             {:era => :horeki, :e_y =>  9, :e_m =>  4, :g_y => 1759, :g_m =>  4, :g_d => 27},
             {:era => :horeki, :e_y =>  9, :e_m =>  5, :g_y => 1759, :g_m =>  5, :g_d => 26},
             {:era => :horeki, :e_y =>  9, :e_m =>  6, :g_y => 1759, :g_m =>  6, :g_d => 25},
             {:era => :horeki, :e_y =>  9, :e_m =>  7, :g_y => 1759, :g_m =>  7, :g_d => 24},
             {:era => :horeki, :e_y =>  9, :e_m =>  7, :g_y => 1759, :g_m =>  8, :g_d => 23, :leap_month => true},
             {:era => :horeki, :e_y =>  9, :e_m =>  8, :g_y => 1759, :g_m =>  9, :g_d => 21},
             {:era => :horeki, :e_y =>  9, :e_m =>  9, :g_y => 1759, :g_m => 10, :g_d => 21},
             {:era => :horeki, :e_y =>  9, :e_m => 10, :g_y => 1759, :g_m => 11, :g_d => 20},
             {:era => :horeki, :e_y =>  9, :e_m => 11, :g_y => 1759, :g_m => 12, :g_d => 19},
             {:era => :horeki, :e_y =>  9, :e_m => 12, :g_y => 1760, :g_m =>  1, :g_d => 18},

             {:era => :horeki, :e_y => 10, :e_m =>  1, :g_y => 1760, :g_m =>  2, :g_d => 17},
             {:era => :horeki, :e_y => 10, :e_m =>  2, :g_y => 1760, :g_m =>  3, :g_d => 17},
             {:era => :horeki, :e_y => 10, :e_m =>  3, :g_y => 1760, :g_m =>  4, :g_d => 16},
             {:era => :horeki, :e_y => 10, :e_m =>  4, :g_y => 1760, :g_m =>  5, :g_d => 15},
             {:era => :horeki, :e_y => 10, :e_m =>  5, :g_y => 1760, :g_m =>  6, :g_d => 13},
             {:era => :horeki, :e_y => 10, :e_m =>  6, :g_y => 1760, :g_m =>  7, :g_d => 13},
             {:era => :horeki, :e_y => 10, :e_m =>  7, :g_y => 1760, :g_m =>  8, :g_d => 11},
             {:era => :horeki, :e_y => 10, :e_m =>  8, :g_y => 1760, :g_m =>  9, :g_d =>  9},
             {:era => :horeki, :e_y => 10, :e_m =>  9, :g_y => 1760, :g_m => 10, :g_d =>  9},
             {:era => :horeki, :e_y => 10, :e_m => 10, :g_y => 1760, :g_m => 11, :g_d =>  8},
             {:era => :horeki, :e_y => 10, :e_m => 11, :g_y => 1760, :g_m => 12, :g_d =>  7},
             {:era => :horeki, :e_y => 10, :e_m => 12, :g_y => 1761, :g_m =>  1, :g_d =>  6},

             {:era => :horeki, :e_y => 11, :e_m =>  1, :g_y => 1761, :g_m =>  2, :g_d =>  5},
             {:era => :horeki, :e_y => 11, :e_m =>  2, :g_y => 1761, :g_m =>  3, :g_d =>  7},
             {:era => :horeki, :e_y => 11, :e_m =>  3, :g_y => 1761, :g_m =>  4, :g_d =>  5},
             {:era => :horeki, :e_y => 11, :e_m =>  4, :g_y => 1761, :g_m =>  5, :g_d =>  5},
             {:era => :horeki, :e_y => 11, :e_m =>  5, :g_y => 1761, :g_m =>  6, :g_d =>  3},
             {:era => :horeki, :e_y => 11, :e_m =>  6, :g_y => 1761, :g_m =>  7, :g_d =>  2},
             {:era => :horeki, :e_y => 11, :e_m =>  7, :g_y => 1761, :g_m =>  8, :g_d =>  1},
             {:era => :horeki, :e_y => 11, :e_m =>  8, :g_y => 1761, :g_m =>  8, :g_d => 30},
             {:era => :horeki, :e_y => 11, :e_m =>  9, :g_y => 1761, :g_m =>  9, :g_d => 28},
             {:era => :horeki, :e_y => 11, :e_m => 10, :g_y => 1761, :g_m => 10, :g_d => 28},
             {:era => :horeki, :e_y => 11, :e_m => 11, :g_y => 1761, :g_m => 11, :g_d => 26},
             {:era => :horeki, :e_y => 11, :e_m => 12, :g_y => 1761, :g_m => 12, :g_d => 26},

             {:era => :horeki, :e_y => 12, :e_m =>  1, :g_y => 1762, :g_m =>  1, :g_d => 25},
             {:era => :horeki, :e_y => 12, :e_m =>  2, :g_y => 1762, :g_m =>  2, :g_d => 24},
             {:era => :horeki, :e_y => 12, :e_m =>  3, :g_y => 1762, :g_m =>  3, :g_d => 26},
             {:era => :horeki, :e_y => 12, :e_m =>  4, :g_y => 1762, :g_m =>  4, :g_d => 24},
             {:era => :horeki, :e_y => 12, :e_m =>  4, :g_y => 1762, :g_m =>  5, :g_d => 24, :leap_month => true},
             {:era => :horeki, :e_y => 12, :e_m =>  5, :g_y => 1762, :g_m =>  6, :g_d => 22},
             {:era => :horeki, :e_y => 12, :e_m =>  6, :g_y => 1762, :g_m =>  7, :g_d => 21},
             {:era => :horeki, :e_y => 12, :e_m =>  7, :g_y => 1762, :g_m =>  8, :g_d => 20},
             {:era => :horeki, :e_y => 12, :e_m =>  8, :g_y => 1762, :g_m =>  9, :g_d => 18},
             {:era => :horeki, :e_y => 12, :e_m =>  9, :g_y => 1762, :g_m => 10, :g_d => 17},
             {:era => :horeki, :e_y => 12, :e_m => 10, :g_y => 1762, :g_m => 11, :g_d => 16},
             {:era => :horeki, :e_y => 12, :e_m => 11, :g_y => 1762, :g_m => 12, :g_d => 15},
             {:era => :horeki, :e_y => 12, :e_m => 12, :g_y => 1763, :g_m =>  1, :g_d => 14},

             {:era => :horeki, :e_y => 13, :e_m =>  1, :g_y => 1763, :g_m =>  2, :g_d => 13},
             {:era => :horeki, :e_y => 13, :e_m =>  2, :g_y => 1763, :g_m =>  3, :g_d => 15},
             {:era => :horeki, :e_y => 13, :e_m =>  3, :g_y => 1763, :g_m =>  4, :g_d => 13},
             {:era => :horeki, :e_y => 13, :e_m =>  4, :g_y => 1763, :g_m =>  5, :g_d => 13},
             {:era => :horeki, :e_y => 13, :e_m =>  5, :g_y => 1763, :g_m =>  6, :g_d => 11},
             {:era => :horeki, :e_y => 13, :e_m =>  6, :g_y => 1763, :g_m =>  7, :g_d => 11},
             {:era => :horeki, :e_y => 13, :e_m =>  7, :g_y => 1763, :g_m =>  8, :g_d =>  9},
             {:era => :horeki, :e_y => 13, :e_m =>  8, :g_y => 1763, :g_m =>  9, :g_d =>  8},
             {:era => :horeki, :e_y => 13, :e_m =>  9, :g_y => 1763, :g_m => 10, :g_d =>  7},
             {:era => :horeki, :e_y => 13, :e_m => 10, :g_y => 1763, :g_m => 11, :g_d =>  5},
             {:era => :horeki, :e_y => 13, :e_m => 11, :g_y => 1763, :g_m => 12, :g_d =>  5},
             {:era => :horeki, :e_y => 13, :e_m => 12, :g_y => 1764, :g_m =>  1, :g_d =>  3},

             {:era => :horeki, :e_y => 14, :e_m =>  1, :g_y => 1764, :g_m =>  2, :g_d =>  2},
             {:era => :horeki, :e_y => 14, :e_m =>  2, :g_y => 1764, :g_m =>  3, :g_d =>  3},
             {:era => :horeki, :e_y => 14, :e_m =>  3, :g_y => 1764, :g_m =>  4, :g_d =>  1},
             {:era => :horeki, :e_y => 14, :e_m =>  4, :g_y => 1764, :g_m =>  5, :g_d =>  1},
             {:era => :horeki, :e_y => 14, :e_m =>  5, :g_y => 1764, :g_m =>  5, :g_d => 31},
             {:era => :horeki, :e_y => 14, :e_m =>  6, :g_y => 1764, :g_m =>  6, :g_d => 29},
             {:era => :horeki, :e_y => 14, :e_m =>  7, :g_y => 1764, :g_m =>  7, :g_d => 29},
             {:era => :horeki, :e_y => 14, :e_m =>  8, :g_y => 1764, :g_m =>  8, :g_d => 27},
             {:era => :horeki, :e_y => 14, :e_m =>  9, :g_y => 1764, :g_m =>  9, :g_d => 26},
             {:era => :horeki, :e_y => 14, :e_m => 10, :g_y => 1764, :g_m => 10, :g_d => 25},
             {:era => :horeki, :e_y => 14, :e_m => 11, :g_y => 1764, :g_m => 11, :g_d => 23},
             {:era => :horeki, :e_y => 14, :e_m => 12, :g_y => 1764, :g_m => 12, :g_d => 23},
             {:era => :horeki, :e_y => 14, :e_m => 12, :g_y => 1765, :g_m =>  1, :g_d => 21, :leap_month => true},

            ]

    add_era_table table
  end # Date
end # Wareki
