# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'J%C5%8Dky%C5%8D' # 
    # KANJI_ERA_NAME = '貞享'

    # 貞享
    # http://ja.wikipedia.org/wiki/%E8%B2%9E%E4%BA%AB
    # | 貞享元年 (甲子)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1684/02/16 | 1684/03/16 | 1684/04/15 | 1684/05/15 | 1684/06/13 | 1684/07/13 | 1684/08/11 | 1684/09/10 | 1684/10/09 | 1684/11/07 | 1684/12/07 | 1685/01/05 |
    # | 貞享二年 (乙丑)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1685/02/04 | 1685/03/05 | 1685/04/04 | 1685/05/03 | 1685/06/02 | 1685/07/02 | 1685/07/31 | 1685/08/30 | 1685/09/28 | 1685/10/28 | 1685/11/26 | 1685/12/26 |
    # | 貞享三年 (丙寅)     |       一月 |       二月 |       三月 |     閏三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1686/01/24 | 1686/02/23 | 1686/03/24 | 1686/04/23 | 1686/05/22 | 1686/06/21 | 1686/07/20 | 1686/08/19 | 1686/09/18 | 1686/10/17 | 1686/11/16 | 1686/12/15 | 1687/01/14 |
    # | 貞享四年 (丁卯)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1687/02/12 | 1687/03/14 | 1687/04/12 | 1687/05/11 | 1687/06/10 | 1687/07/09 | 1687/08/08 | 1687/09/07 | 1687/10/06 | 1687/11/05 | 1687/12/05 | 1688/01/03 |
    # | 貞享五年 (戊辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1688/02/02 | 1688/03/02 | 1688/04/01 | 1688/04/30 | 1688/05/29 | 1688/06/28 | 1688/07/27 | 1688/08/26 | 1688/09/24 | 1688/10/24 | 1688/11/23 | 1688/12/23 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :jokyo, :e_y =>  1, :e_m =>  1, :g_y => 1684, :g_m =>  2, :g_d => 16},
             {:era => :jokyo, :e_y =>  1, :e_m =>  2, :g_y => 1684, :g_m =>  3, :g_d => 16},
             {:era => :jokyo, :e_y =>  1, :e_m =>  3, :g_y => 1684, :g_m =>  4, :g_d => 15},
             {:era => :jokyo, :e_y =>  1, :e_m =>  4, :g_y => 1684, :g_m =>  5, :g_d => 15},
             {:era => :jokyo, :e_y =>  1, :e_m =>  5, :g_y => 1684, :g_m =>  6, :g_d => 13},
             {:era => :jokyo, :e_y =>  1, :e_m =>  6, :g_y => 1684, :g_m =>  7, :g_d => 13},
             {:era => :jokyo, :e_y =>  1, :e_m =>  7, :g_y => 1684, :g_m =>  8, :g_d => 11},
             {:era => :jokyo, :e_y =>  1, :e_m =>  8, :g_y => 1684, :g_m =>  9, :g_d => 10},
             {:era => :jokyo, :e_y =>  1, :e_m =>  9, :g_y => 1684, :g_m => 10, :g_d =>  9},
             {:era => :jokyo, :e_y =>  1, :e_m => 10, :g_y => 1684, :g_m => 11, :g_d =>  7},
             {:era => :jokyo, :e_y =>  1, :e_m => 11, :g_y => 1684, :g_m => 12, :g_d =>  7},
             {:era => :jokyo, :e_y =>  1, :e_m => 12, :g_y => 1685, :g_m =>  1, :g_d =>  5},

             {:era => :jokyo, :e_y =>  2, :e_m =>  1, :g_y => 1685, :g_m =>  2, :g_d =>  4},
             {:era => :jokyo, :e_y =>  2, :e_m =>  2, :g_y => 1685, :g_m =>  3, :g_d =>  5},
             {:era => :jokyo, :e_y =>  2, :e_m =>  3, :g_y => 1685, :g_m =>  4, :g_d =>  4},
             {:era => :jokyo, :e_y =>  2, :e_m =>  4, :g_y => 1685, :g_m =>  5, :g_d =>  3},
             {:era => :jokyo, :e_y =>  2, :e_m =>  5, :g_y => 1685, :g_m =>  6, :g_d =>  2},
             {:era => :jokyo, :e_y =>  2, :e_m =>  6, :g_y => 1685, :g_m =>  7, :g_d =>  2},
             {:era => :jokyo, :e_y =>  2, :e_m =>  7, :g_y => 1685, :g_m =>  7, :g_d => 31},
             {:era => :jokyo, :e_y =>  2, :e_m =>  8, :g_y => 1685, :g_m =>  8, :g_d => 30},
             {:era => :jokyo, :e_y =>  2, :e_m =>  9, :g_y => 1685, :g_m =>  9, :g_d => 28},
             {:era => :jokyo, :e_y =>  2, :e_m => 10, :g_y => 1685, :g_m => 10, :g_d => 28},
             {:era => :jokyo, :e_y =>  2, :e_m => 11, :g_y => 1685, :g_m => 11, :g_d => 26},
             {:era => :jokyo, :e_y =>  2, :e_m => 12, :g_y => 1685, :g_m => 12, :g_d => 26},

             {:era => :jokyo, :e_y =>  3, :e_m =>  1, :g_y => 1686, :g_m =>  1, :g_d => 24},
             {:era => :jokyo, :e_y =>  3, :e_m =>  2, :g_y => 1686, :g_m =>  2, :g_d => 23},
             {:era => :jokyo, :e_y =>  3, :e_m =>  3, :g_y => 1686, :g_m =>  3, :g_d => 24},
             {:era => :jokyo, :e_y =>  3, :e_m =>  3, :g_y => 1686, :g_m =>  4, :g_d => 23, :leap_month => true},
             {:era => :jokyo, :e_y =>  3, :e_m =>  4, :g_y => 1686, :g_m =>  5, :g_d => 22},
             {:era => :jokyo, :e_y =>  3, :e_m =>  5, :g_y => 1686, :g_m =>  6, :g_d => 21},
             {:era => :jokyo, :e_y =>  3, :e_m =>  6, :g_y => 1686, :g_m =>  7, :g_d => 20},
             {:era => :jokyo, :e_y =>  3, :e_m =>  7, :g_y => 1686, :g_m =>  8, :g_d => 19},
             {:era => :jokyo, :e_y =>  3, :e_m =>  8, :g_y => 1686, :g_m =>  9, :g_d => 18},
             {:era => :jokyo, :e_y =>  3, :e_m =>  9, :g_y => 1686, :g_m => 10, :g_d => 17},
             {:era => :jokyo, :e_y =>  3, :e_m => 10, :g_y => 1686, :g_m => 11, :g_d => 16},
             {:era => :jokyo, :e_y =>  3, :e_m => 11, :g_y => 1686, :g_m => 12, :g_d => 15},
             {:era => :jokyo, :e_y =>  3, :e_m => 12, :g_y => 1687, :g_m =>  1, :g_d => 14},

             {:era => :jokyo, :e_y =>  4, :e_m =>  1, :g_y => 1687, :g_m =>  2, :g_d => 12},
             {:era => :jokyo, :e_y =>  4, :e_m =>  2, :g_y => 1687, :g_m =>  3, :g_d => 14},
             {:era => :jokyo, :e_y =>  4, :e_m =>  3, :g_y => 1687, :g_m =>  4, :g_d => 12},
             {:era => :jokyo, :e_y =>  4, :e_m =>  4, :g_y => 1687, :g_m =>  5, :g_d => 11},
             {:era => :jokyo, :e_y =>  4, :e_m =>  5, :g_y => 1687, :g_m =>  6, :g_d => 10},
             {:era => :jokyo, :e_y =>  4, :e_m =>  6, :g_y => 1687, :g_m =>  7, :g_d =>  9},
             {:era => :jokyo, :e_y =>  4, :e_m =>  7, :g_y => 1687, :g_m =>  8, :g_d =>  8},
             {:era => :jokyo, :e_y =>  4, :e_m =>  8, :g_y => 1687, :g_m =>  9, :g_d =>  7},
             {:era => :jokyo, :e_y =>  4, :e_m =>  9, :g_y => 1687, :g_m => 10, :g_d =>  6},
             {:era => :jokyo, :e_y =>  4, :e_m => 10, :g_y => 1687, :g_m => 11, :g_d =>  5},
             {:era => :jokyo, :e_y =>  4, :e_m => 11, :g_y => 1687, :g_m => 12, :g_d =>  5},
             {:era => :jokyo, :e_y =>  4, :e_m => 12, :g_y => 1688, :g_m =>  1, :g_d =>  3},

             {:era => :jokyo, :e_y =>  5, :e_m =>  1, :g_y => 1688, :g_m =>  2, :g_d =>  2},
             {:era => :jokyo, :e_y =>  5, :e_m =>  2, :g_y => 1688, :g_m =>  3, :g_d =>  2},
             {:era => :jokyo, :e_y =>  5, :e_m =>  3, :g_y => 1688, :g_m =>  4, :g_d =>  1},
             {:era => :jokyo, :e_y =>  5, :e_m =>  4, :g_y => 1688, :g_m =>  4, :g_d => 30},
             {:era => :jokyo, :e_y =>  5, :e_m =>  5, :g_y => 1688, :g_m =>  5, :g_d => 29},
             {:era => :jokyo, :e_y =>  5, :e_m =>  6, :g_y => 1688, :g_m =>  6, :g_d => 28},
             {:era => :jokyo, :e_y =>  5, :e_m =>  7, :g_y => 1688, :g_m =>  7, :g_d => 27},
             {:era => :jokyo, :e_y =>  5, :e_m =>  8, :g_y => 1688, :g_m =>  8, :g_d => 26},
             {:era => :jokyo, :e_y =>  5, :e_m =>  9, :g_y => 1688, :g_m =>  9, :g_d => 24},
             {:era => :jokyo, :e_y =>  5, :e_m => 10, :g_y => 1688, :g_m => 10, :g_d => 24},
             {:era => :jokyo, :e_y =>  5, :e_m => 11, :g_y => 1688, :g_m => 11, :g_d => 23},
             {:era => :jokyo, :e_y =>  5, :e_m => 12, :g_y => 1688, :g_m => 12, :g_d => 23},

            ]

    add_era_table table
  end # Date
end # Wareki
