# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'kaei' # かえい
    # KANJI_ERA_NAME = '嘉永'

    # http://ja.wikipedia.org/wiki/%E5%98%89%E6%B0%B8
    # 嘉永元年（戊申）      一月     二月     三月     四月     五月     六月     七月     八月     九月      十月     十一月     十二月     
    # グレゴリオ暦      1848/2/5      3/5      4/4      5/3      6/1      7/1     7/30     8/29     9/27     10/27      11/26      12/26     
    # 嘉永二年（己酉）      一月     二月     三月     四月   閏四月     五月     六月     七月     八月      九月       十月     十一月     十二月 
    # グレゴリオ暦     1849/1/24     2/23     3/24     4/23     5/22     6/20     7/20     8/18     9/17     10/16      11/15      12/15     1850/1/13 
    # 嘉永三年（庚戌）      一月     二月     三月     四月     五月     六月     七月     八月     九月      十月     十一月     十二月     
    # グレゴリオ暦     1850/2/12     3/14     4/12     5/12     6/10      7/9      8/8      9/6     10/6      11/4       12/4   1851/1/2     
    # 嘉永四年（辛亥）      一月     二月     三月     四月     五月     六月     七月     八月     九月      十月     十一月     十二月     
    # グレゴリオ暦      1851/2/1      3/3      4/2      5/1     5/31     6/29     7/28     8/27     9/25     10/25      11/23      12/23     
    # 嘉永五年（壬子）      一月     二月   閏二月     三月     四月     五月     六月     七月     八月      九月       十月     十一月     十二月 
    # グレゴリオ暦     1852/1/21     2/20     3/21     4/19     5/19     6/18     7/17     8/15     9/14     10/13      11/12      12/11     1853/1/10 
    # 嘉永六年（癸丑）      一月     二月     三月     四月     五月     六月     七月     八月     九月      十月     十一月     十二月     
    # グレゴリオ暦      1853/2/8     3/10      4/8      5/8      6/7      7/6      8/5      9/3     10/3      11/1       12/1      12/30     
    # 嘉永七年（甲寅）      一月     二月     三月     四月     五月     六月     七月   閏七月     八月      九月       十月     十一月     十二月 
    # グレゴリオ暦     1854/1/29     2/27     3/29     4/27     5/27     6/25     7/25     8/24     9/22     10/22      11/20      12/20     1855/1/18 

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :kaei, :e_y => 1, :e_m => 1, :g_y => 1848, :g_m => 2, :g_d => 5},
             {:era => :kaei, :e_y => 1, :e_m => 2, :g_y => 1848, :g_m => 3, :g_d => 5},
             {:era => :kaei, :e_y => 1, :e_m => 3, :g_y => 1848, :g_m => 4, :g_d => 4},
             {:era => :kaei, :e_y => 1, :e_m => 4, :g_y => 1848, :g_m => 5, :g_d => 3},
             {:era => :kaei, :e_y => 1, :e_m => 5, :g_y => 1848, :g_m => 6, :g_d => 1},
             {:era => :kaei, :e_y => 1, :e_m => 6, :g_y => 1848, :g_m => 7, :g_d => 1},
             {:era => :kaei, :e_y => 1, :e_m => 7, :g_y => 1848, :g_m => 7, :g_d => 30},
             {:era => :kaei, :e_y => 1, :e_m => 8, :g_y => 1848, :g_m => 8, :g_d => 29},
             {:era => :kaei, :e_y => 1, :e_m => 9, :g_y => 1848, :g_m => 9, :g_d => 27},
             {:era => :kaei, :e_y => 1, :e_m => 10, :g_y => 1848, :g_m => 10, :g_d => 27},
             {:era => :kaei, :e_y => 1, :e_m => 11, :g_y => 1848, :g_m => 11, :g_d => 26},
             {:era => :kaei, :e_y => 1, :e_m => 12, :g_y => 1848, :g_m => 12, :g_d => 26},

             {:era => :kaei, :e_y => 2, :e_m => 1, :g_y => 1849, :g_m => 1, :g_d => 24},
             {:era => :kaei, :e_y => 2, :e_m => 2, :g_y => 1849, :g_m => 2, :g_d => 23},
             {:era => :kaei, :e_y => 2, :e_m => 3, :g_y => 1849, :g_m => 3, :g_d => 24},
             {:era => :kaei, :e_y => 2, :e_m => 4, :g_y => 1849, :g_m => 4, :g_d => 23},
             {:era => :kaei, :e_y => 2, :e_m => 4, :g_y => 1849, :g_m => 5, :g_d => 22, :leap_month => true},
             {:era => :kaei, :e_y => 2, :e_m => 5, :g_y => 1849, :g_m => 6, :g_d => 20},
             {:era => :kaei, :e_y => 2, :e_m => 6, :g_y => 1849, :g_m => 7, :g_d => 20},
             {:era => :kaei, :e_y => 2, :e_m => 7, :g_y => 1849, :g_m => 8, :g_d => 18},
             {:era => :kaei, :e_y => 2, :e_m => 8, :g_y => 1849, :g_m => 9, :g_d => 17},
             {:era => :kaei, :e_y => 2, :e_m => 9,  :g_y => 1849, :g_m => 10, :g_d => 16},
             {:era => :kaei, :e_y => 2, :e_m => 10, :g_y => 1849, :g_m => 11, :g_d => 15},
             {:era => :kaei, :e_y => 2, :e_m => 11, :g_y => 1849, :g_m => 12, :g_d => 15},
             {:era => :kaei, :e_y => 2, :e_m => 12, :g_y => 1850, :g_m => 1, :g_d => 13},

             {:era => :kaei, :e_y => 3, :e_m => 1, :g_y => 1850, :g_m => 2, :g_d => 12},
             {:era => :kaei, :e_y => 3, :e_m => 2, :g_y => 1850, :g_m => 3, :g_d => 14},
             {:era => :kaei, :e_y => 3, :e_m => 3, :g_y => 1850, :g_m => 4, :g_d => 12},
             {:era => :kaei, :e_y => 3, :e_m => 4, :g_y => 1850, :g_m => 5, :g_d => 12},
             {:era => :kaei, :e_y => 3, :e_m => 5, :g_y => 1850, :g_m => 6, :g_d => 10},
             {:era => :kaei, :e_y => 3, :e_m => 6, :g_y => 1850, :g_m => 7, :g_d => 9},
             {:era => :kaei, :e_y => 3, :e_m => 7, :g_y => 1850, :g_m => 8, :g_d => 8},
             {:era => :kaei, :e_y => 3, :e_m => 8, :g_y => 1850, :g_m => 9, :g_d => 6},
             {:era => :kaei, :e_y => 3, :e_m => 9, :g_y => 1850, :g_m => 10, :g_d => 6},
             {:era => :kaei, :e_y => 3, :e_m => 10, :g_y => 1850, :g_m => 11, :g_d => 4},
             {:era => :kaei, :e_y => 3, :e_m => 11, :g_y => 1850, :g_m => 12, :g_d => 4},
             {:era => :kaei, :e_y => 3, :e_m => 12, :g_y => 1851, :g_m => 1, :g_d => 2},

             {:era => :kaei, :e_y => 4, :e_m => 1, :g_y => 1851, :g_m => 2, :g_d => 1},
             {:era => :kaei, :e_y => 4, :e_m => 2, :g_y => 1851, :g_m => 3, :g_d => 3},
             {:era => :kaei, :e_y => 4, :e_m => 3, :g_y => 1851, :g_m => 4, :g_d => 2},
             {:era => :kaei, :e_y => 4, :e_m => 4, :g_y => 1851, :g_m => 5, :g_d => 1},
             {:era => :kaei, :e_y => 4, :e_m => 5, :g_y => 1851, :g_m => 5, :g_d => 31},
             {:era => :kaei, :e_y => 4, :e_m => 6, :g_y => 1851, :g_m => 6, :g_d => 29},
             {:era => :kaei, :e_y => 4, :e_m => 7, :g_y => 1851, :g_m => 7, :g_d => 28},
             {:era => :kaei, :e_y => 4, :e_m => 8, :g_y => 1851, :g_m => 8, :g_d => 27},
             {:era => :kaei, :e_y => 4, :e_m => 9, :g_y => 1851, :g_m => 9, :g_d => 25},
             {:era => :kaei, :e_y => 4, :e_m => 10, :g_y => 1851, :g_m => 10, :g_d => 25},
             {:era => :kaei, :e_y => 4, :e_m => 11, :g_y => 1851, :g_m => 11, :g_d => 23},
             {:era => :kaei, :e_y => 4, :e_m => 12, :g_y => 1851, :g_m => 12, :g_d => 23},

             {:era => :kaei, :e_y => 5, :e_m => 1, :g_y => 1852, :g_m => 1, :g_d => 21},
             {:era => :kaei, :e_y => 5, :e_m => 2, :g_y => 1852, :g_m => 2, :g_d => 20},
             {:era => :kaei, :e_y => 5, :e_m => 2, :g_y => 1852, :g_m => 3, :g_d => 21, :leap_month => true},
             {:era => :kaei, :e_y => 5, :e_m => 3, :g_y => 1852, :g_m => 4, :g_d => 19},
             {:era => :kaei, :e_y => 5, :e_m => 4, :g_y => 1852, :g_m => 5, :g_d => 19},
             {:era => :kaei, :e_y => 5, :e_m => 5, :g_y => 1852, :g_m => 6, :g_d => 18},
             {:era => :kaei, :e_y => 5, :e_m => 6, :g_y => 1852, :g_m => 7, :g_d => 17},
             {:era => :kaei, :e_y => 5, :e_m => 7, :g_y => 1852, :g_m => 8, :g_d => 15},
             {:era => :kaei, :e_y => 5, :e_m => 8, :g_y => 1852, :g_m => 9, :g_d => 14},
             {:era => :kaei, :e_y => 5, :e_m => 9,  :g_y => 1852, :g_m => 10, :g_d => 13},
             {:era => :kaei, :e_y => 5, :e_m => 10, :g_y => 1852, :g_m => 11, :g_d => 12},
             {:era => :kaei, :e_y => 5, :e_m => 11, :g_y => 1852, :g_m => 12, :g_d => 11},
             {:era => :kaei, :e_y => 5, :e_m => 12, :g_y => 1853, :g_m => 1, :g_d => 10},

             {:era => :kaei, :e_y => 6, :e_m => 1, :g_y => 1853, :g_m => 2, :g_d => 8},
             {:era => :kaei, :e_y => 6, :e_m => 2, :g_y => 1853, :g_m => 3, :g_d => 10},
             {:era => :kaei, :e_y => 6, :e_m => 3, :g_y => 1853, :g_m => 4, :g_d => 8},
             {:era => :kaei, :e_y => 6, :e_m => 4, :g_y => 1853, :g_m => 5, :g_d => 8},
             {:era => :kaei, :e_y => 6, :e_m => 5, :g_y => 1853, :g_m => 6, :g_d => 7},
             {:era => :kaei, :e_y => 6, :e_m => 6, :g_y => 1853, :g_m => 7, :g_d => 6},
             {:era => :kaei, :e_y => 6, :e_m => 7, :g_y => 1853, :g_m => 8, :g_d => 5},
             {:era => :kaei, :e_y => 6, :e_m => 8, :g_y => 1853, :g_m => 9, :g_d => 3},
             {:era => :kaei, :e_y => 6, :e_m => 9, :g_y => 1853, :g_m => 10, :g_d => 3},
             {:era => :kaei, :e_y => 6, :e_m => 10, :g_y => 1853, :g_m => 11, :g_d => 1},
             {:era => :kaei, :e_y => 6, :e_m => 11, :g_y => 1853, :g_m => 12, :g_d => 1},
             {:era => :kaei, :e_y => 6, :e_m => 12, :g_y => 1853, :g_m => 12, :g_d => 30},

             {:era => :kaei, :e_y => 7, :e_m => 1, :g_y => 1854, :g_m => 1, :g_d => 29},
             {:era => :kaei, :e_y => 7, :e_m => 2, :g_y => 1854, :g_m => 2, :g_d => 27},
             {:era => :kaei, :e_y => 7, :e_m => 3, :g_y => 1854, :g_m => 3, :g_d => 29},
             {:era => :kaei, :e_y => 7, :e_m => 4, :g_y => 1854, :g_m => 4, :g_d => 27},
             {:era => :kaei, :e_y => 7, :e_m => 5, :g_y => 1854, :g_m => 5, :g_d => 27},
             {:era => :kaei, :e_y => 7, :e_m => 6, :g_y => 1854, :g_m => 6, :g_d => 25},
             {:era => :kaei, :e_y => 7, :e_m => 7, :g_y => 1854, :g_m => 7, :g_d => 25},
             {:era => :kaei, :e_y => 7, :e_m => 7, :g_y => 1854, :g_m => 8, :g_d => 24, :leap_month => true},
             {:era => :kaei, :e_y => 7, :e_m => 8, :g_y => 1854, :g_m => 9, :g_d => 22},
             {:era => :kaei, :e_y => 7, :e_m => 9,  :g_y => 1854, :g_m => 10, :g_d => 22},
             {:era => :kaei, :e_y => 7, :e_m => 10, :g_y => 1854, :g_m => 11, :g_d => 20},
             {:era => :kaei, :e_y => 7, :e_m => 11, :g_y => 1854, :g_m => 12, :g_d => 20},
             {:era => :kaei, :e_y => 7, :e_m => 12, :g_y => 1855, :g_m => 1, :g_d => 18},
            ]
    add_era_table table
  end # Date
end # Wareki
