# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Kanbun_(era)' # 
    # KANJI_ERA_NAME = '寛文'

    # 寛文
    # http://ja.wikipedia.org/wiki/%E5%AF%9B%E6%96%87
    # | 寛文元年 (辛丑)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |     閏八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1661/01/31 | 1661/03/01 | 1661/03/31 | 1661/04/29 | 1661/05/28 | 1661/06/27 | 1661/07/26 | 1661/08/25 | 1661/09/24 | 1661/10/23 | 1661/11/22 | 1661/12/22 | 1662/01/20 |
    # | 寛文二年 (壬寅)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1662/02/19 | 1662/03/20 | 1662/04/19 | 1662/05/18 | 1662/06/16 | 1662/07/16 | 1662/08/14 | 1662/09/13 | 1662/10/12 | 1662/11/11 | 1662/12/11 | 1663/01/10 |
    # | 寛文三年 (癸卯)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1663/02/08 | 1663/03/10 | 1663/04/08 | 1663/05/08 | 1663/06/06 | 1663/07/05 | 1663/08/03 | 1663/09/02 | 1663/10/01 | 1663/10/31 | 1663/11/30 | 1663/12/30 |
    # | 寛文四年 (甲辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |     閏五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1664/01/28 | 1664/02/27 | 1664/03/28 | 1664/04/26 | 1664/05/26 | 1664/06/24 | 1664/07/23 | 1664/08/21 | 1664/09/20 | 1664/10/19 | 1664/11/18 | 1664/12/18 | 1665/01/16 |
    # | 寛文五年 (乙巳)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1665/02/15 | 1665/03/17 | 1665/04/16 | 1665/05/15 | 1665/06/14 | 1665/07/13 | 1665/08/11 | 1665/09/09 | 1665/10/09 | 1665/11/07 | 1665/12/07 | 1666/01/06 |
    # | 寛文六年 (丙午)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1666/02/04 | 1666/03/06 | 1666/04/05 | 1666/05/04 | 1666/06/03 | 1666/07/02 | 1666/08/01 | 1666/08/30 | 1666/09/29 | 1666/10/28 | 1666/11/26 | 1666/12/26 |
    # | 寛文七年 (丁未)     |       一月 |       二月 |     閏二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1667/01/24 | 1667/02/23 | 1667/03/25 | 1667/04/23 | 1667/05/23 | 1667/06/22 | 1667/07/21 | 1667/08/20 | 1667/09/18 | 1667/10/18 | 1667/11/16 | 1667/12/15 | 1668/01/14 |
    # | 寛文八年 (戊申)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1668/02/12 | 1668/03/13 | 1668/04/12 | 1668/05/11 | 1668/06/10 | 1668/07/09 | 1668/08/08 | 1668/09/07 | 1668/10/06 | 1668/11/05 | 1668/12/04 | 1669/01/03 |
    # | 寛文九年 (己酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     閏十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1669/02/01 | 1669/03/02 | 1669/04/01 | 1669/04/30 | 1669/05/30 | 1669/06/28 | 1669/07/28 | 1669/08/27 | 1669/09/25 | 1669/10/25 | 1669/11/24 | 1669/12/23 | 1670/01/22 |
    # | 寛文十年 (庚戌)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1670/02/20 | 1670/03/21 | 1670/04/20 | 1670/05/19 | 1670/06/18 | 1670/07/17 | 1670/08/16 | 1670/09/14 | 1670/10/14 | 1670/11/13 | 1670/12/13 | 1671/01/11 |
    # | 寛文十一年 (辛亥)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1671/02/10 | 1671/03/11 | 1671/04/10 | 1671/05/09 | 1671/06/07 | 1671/07/07 | 1671/08/05 | 1671/09/03 | 1671/10/03 | 1671/11/02 | 1671/12/02 | 1671/12/31 |
    # | 寛文十二年 (壬子)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |     閏六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1672/01/30 | 1672/02/29 | 1672/03/29 | 1672/04/28 | 1672/05/27 | 1672/06/25 | 1672/07/24 | 1672/08/23 | 1672/09/21 | 1672/10/21 | 1672/11/20 | 1672/12/19 | 1673/01/18 |
    # | 寛文十三年 (癸丑)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1673/02/17 | 1673/03/19 | 1673/04/17 | 1673/05/17 | 1673/06/15 | 1673/07/14 | 1673/08/12 | 1673/09/11 | 1673/10/10 | 1673/11/09 | 1673/12/08 | 1674/01/07 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :kanbun, :e_y =>  1, :e_m =>  1, :g_y => 1661, :g_m =>  1, :g_d => 31},
             {:era => :kanbun, :e_y =>  1, :e_m =>  2, :g_y => 1661, :g_m =>  3, :g_d =>  1},
             {:era => :kanbun, :e_y =>  1, :e_m =>  3, :g_y => 1661, :g_m =>  3, :g_d => 31},
             {:era => :kanbun, :e_y =>  1, :e_m =>  4, :g_y => 1661, :g_m =>  4, :g_d => 29},
             {:era => :kanbun, :e_y =>  1, :e_m =>  5, :g_y => 1661, :g_m =>  5, :g_d => 28},
             {:era => :kanbun, :e_y =>  1, :e_m =>  6, :g_y => 1661, :g_m =>  6, :g_d => 27},
             {:era => :kanbun, :e_y =>  1, :e_m =>  7, :g_y => 1661, :g_m =>  7, :g_d => 26},
             {:era => :kanbun, :e_y =>  1, :e_m =>  8, :g_y => 1661, :g_m =>  8, :g_d => 25},
             {:era => :kanbun, :e_y =>  1, :e_m =>  8, :g_y => 1661, :g_m =>  9, :g_d => 24, :leap_month => true},
             {:era => :kanbun, :e_y =>  1, :e_m =>  9, :g_y => 1661, :g_m => 10, :g_d => 23},
             {:era => :kanbun, :e_y =>  1, :e_m => 10, :g_y => 1661, :g_m => 11, :g_d => 22},
             {:era => :kanbun, :e_y =>  1, :e_m => 11, :g_y => 1661, :g_m => 12, :g_d => 22},
             {:era => :kanbun, :e_y =>  1, :e_m => 12, :g_y => 1662, :g_m =>  1, :g_d => 20},

             {:era => :kanbun, :e_y =>  2, :e_m =>  1, :g_y => 1662, :g_m =>  2, :g_d => 19},
             {:era => :kanbun, :e_y =>  2, :e_m =>  2, :g_y => 1662, :g_m =>  3, :g_d => 20},
             {:era => :kanbun, :e_y =>  2, :e_m =>  3, :g_y => 1662, :g_m =>  4, :g_d => 19},
             {:era => :kanbun, :e_y =>  2, :e_m =>  4, :g_y => 1662, :g_m =>  5, :g_d => 18},
             {:era => :kanbun, :e_y =>  2, :e_m =>  5, :g_y => 1662, :g_m =>  6, :g_d => 16},
             {:era => :kanbun, :e_y =>  2, :e_m =>  6, :g_y => 1662, :g_m =>  7, :g_d => 16},
             {:era => :kanbun, :e_y =>  2, :e_m =>  7, :g_y => 1662, :g_m =>  8, :g_d => 14},
             {:era => :kanbun, :e_y =>  2, :e_m =>  8, :g_y => 1662, :g_m =>  9, :g_d => 13},
             {:era => :kanbun, :e_y =>  2, :e_m =>  9, :g_y => 1662, :g_m => 10, :g_d => 12},
             {:era => :kanbun, :e_y =>  2, :e_m => 10, :g_y => 1662, :g_m => 11, :g_d => 11},
             {:era => :kanbun, :e_y =>  2, :e_m => 11, :g_y => 1662, :g_m => 12, :g_d => 11},
             {:era => :kanbun, :e_y =>  2, :e_m => 12, :g_y => 1663, :g_m =>  1, :g_d => 10},

             {:era => :kanbun, :e_y =>  3, :e_m =>  1, :g_y => 1663, :g_m =>  2, :g_d =>  8},
             {:era => :kanbun, :e_y =>  3, :e_m =>  2, :g_y => 1663, :g_m =>  3, :g_d => 10},
             {:era => :kanbun, :e_y =>  3, :e_m =>  3, :g_y => 1663, :g_m =>  4, :g_d =>  8},
             {:era => :kanbun, :e_y =>  3, :e_m =>  4, :g_y => 1663, :g_m =>  5, :g_d =>  8},
             {:era => :kanbun, :e_y =>  3, :e_m =>  5, :g_y => 1663, :g_m =>  6, :g_d =>  6},
             {:era => :kanbun, :e_y =>  3, :e_m =>  6, :g_y => 1663, :g_m =>  7, :g_d =>  5},
             {:era => :kanbun, :e_y =>  3, :e_m =>  7, :g_y => 1663, :g_m =>  8, :g_d =>  3},
             {:era => :kanbun, :e_y =>  3, :e_m =>  8, :g_y => 1663, :g_m =>  9, :g_d =>  2},
             {:era => :kanbun, :e_y =>  3, :e_m =>  9, :g_y => 1663, :g_m => 10, :g_d =>  1},
             {:era => :kanbun, :e_y =>  3, :e_m => 10, :g_y => 1663, :g_m => 10, :g_d => 31},
             {:era => :kanbun, :e_y =>  3, :e_m => 11, :g_y => 1663, :g_m => 11, :g_d => 30},
             {:era => :kanbun, :e_y =>  3, :e_m => 12, :g_y => 1663, :g_m => 12, :g_d => 30},

             {:era => :kanbun, :e_y =>  4, :e_m =>  1, :g_y => 1664, :g_m =>  1, :g_d => 28},
             {:era => :kanbun, :e_y =>  4, :e_m =>  2, :g_y => 1664, :g_m =>  2, :g_d => 27},
             {:era => :kanbun, :e_y =>  4, :e_m =>  3, :g_y => 1664, :g_m =>  3, :g_d => 28},
             {:era => :kanbun, :e_y =>  4, :e_m =>  4, :g_y => 1664, :g_m =>  4, :g_d => 26},
             {:era => :kanbun, :e_y =>  4, :e_m =>  5, :g_y => 1664, :g_m =>  5, :g_d => 26},
             {:era => :kanbun, :e_y =>  4, :e_m =>  5, :g_y => 1664, :g_m =>  6, :g_d => 24, :leap_month => true},
             {:era => :kanbun, :e_y =>  4, :e_m =>  6, :g_y => 1664, :g_m =>  7, :g_d => 23},
             {:era => :kanbun, :e_y =>  4, :e_m =>  7, :g_y => 1664, :g_m =>  8, :g_d => 21},
             {:era => :kanbun, :e_y =>  4, :e_m =>  8, :g_y => 1664, :g_m =>  9, :g_d => 20},
             {:era => :kanbun, :e_y =>  4, :e_m =>  9, :g_y => 1664, :g_m => 10, :g_d => 19},
             {:era => :kanbun, :e_y =>  4, :e_m => 10, :g_y => 1664, :g_m => 11, :g_d => 18},
             {:era => :kanbun, :e_y =>  4, :e_m => 11, :g_y => 1664, :g_m => 12, :g_d => 18},
             {:era => :kanbun, :e_y =>  4, :e_m => 12, :g_y => 1665, :g_m =>  1, :g_d => 16},

             {:era => :kanbun, :e_y =>  5, :e_m =>  1, :g_y => 1665, :g_m =>  2, :g_d => 15},
             {:era => :kanbun, :e_y =>  5, :e_m =>  2, :g_y => 1665, :g_m =>  3, :g_d => 17},
             {:era => :kanbun, :e_y =>  5, :e_m =>  3, :g_y => 1665, :g_m =>  4, :g_d => 16},
             {:era => :kanbun, :e_y =>  5, :e_m =>  4, :g_y => 1665, :g_m =>  5, :g_d => 15},
             {:era => :kanbun, :e_y =>  5, :e_m =>  5, :g_y => 1665, :g_m =>  6, :g_d => 14},
             {:era => :kanbun, :e_y =>  5, :e_m =>  6, :g_y => 1665, :g_m =>  7, :g_d => 13},
             {:era => :kanbun, :e_y =>  5, :e_m =>  7, :g_y => 1665, :g_m =>  8, :g_d => 11},
             {:era => :kanbun, :e_y =>  5, :e_m =>  8, :g_y => 1665, :g_m =>  9, :g_d =>  9},
             {:era => :kanbun, :e_y =>  5, :e_m =>  9, :g_y => 1665, :g_m => 10, :g_d =>  9},
             {:era => :kanbun, :e_y =>  5, :e_m => 10, :g_y => 1665, :g_m => 11, :g_d =>  7},
             {:era => :kanbun, :e_y =>  5, :e_m => 11, :g_y => 1665, :g_m => 12, :g_d =>  7},
             {:era => :kanbun, :e_y =>  5, :e_m => 12, :g_y => 1666, :g_m =>  1, :g_d =>  6},

             {:era => :kanbun, :e_y =>  6, :e_m =>  1, :g_y => 1666, :g_m =>  2, :g_d =>  4},
             {:era => :kanbun, :e_y =>  6, :e_m =>  2, :g_y => 1666, :g_m =>  3, :g_d =>  6},
             {:era => :kanbun, :e_y =>  6, :e_m =>  3, :g_y => 1666, :g_m =>  4, :g_d =>  5},
             {:era => :kanbun, :e_y =>  6, :e_m =>  4, :g_y => 1666, :g_m =>  5, :g_d =>  4},
             {:era => :kanbun, :e_y =>  6, :e_m =>  5, :g_y => 1666, :g_m =>  6, :g_d =>  3},
             {:era => :kanbun, :e_y =>  6, :e_m =>  6, :g_y => 1666, :g_m =>  7, :g_d =>  2},
             {:era => :kanbun, :e_y =>  6, :e_m =>  7, :g_y => 1666, :g_m =>  8, :g_d =>  1},
             {:era => :kanbun, :e_y =>  6, :e_m =>  8, :g_y => 1666, :g_m =>  8, :g_d => 30},
             {:era => :kanbun, :e_y =>  6, :e_m =>  9, :g_y => 1666, :g_m =>  9, :g_d => 29},
             {:era => :kanbun, :e_y =>  6, :e_m => 10, :g_y => 1666, :g_m => 10, :g_d => 28},
             {:era => :kanbun, :e_y =>  6, :e_m => 11, :g_y => 1666, :g_m => 11, :g_d => 26},
             {:era => :kanbun, :e_y =>  6, :e_m => 12, :g_y => 1666, :g_m => 12, :g_d => 26},

             {:era => :kanbun, :e_y =>  7, :e_m =>  1, :g_y => 1667, :g_m =>  1, :g_d => 24},
             {:era => :kanbun, :e_y =>  7, :e_m =>  2, :g_y => 1667, :g_m =>  2, :g_d => 23},
             {:era => :kanbun, :e_y =>  7, :e_m =>  2, :g_y => 1667, :g_m =>  3, :g_d => 25, :leap_month => true},
             {:era => :kanbun, :e_y =>  7, :e_m =>  3, :g_y => 1667, :g_m =>  4, :g_d => 23},
             {:era => :kanbun, :e_y =>  7, :e_m =>  4, :g_y => 1667, :g_m =>  5, :g_d => 23},
             {:era => :kanbun, :e_y =>  7, :e_m =>  5, :g_y => 1667, :g_m =>  6, :g_d => 22},
             {:era => :kanbun, :e_y =>  7, :e_m =>  6, :g_y => 1667, :g_m =>  7, :g_d => 21},
             {:era => :kanbun, :e_y =>  7, :e_m =>  7, :g_y => 1667, :g_m =>  8, :g_d => 20},
             {:era => :kanbun, :e_y =>  7, :e_m =>  8, :g_y => 1667, :g_m =>  9, :g_d => 18},
             {:era => :kanbun, :e_y =>  7, :e_m =>  9, :g_y => 1667, :g_m => 10, :g_d => 18},
             {:era => :kanbun, :e_y =>  7, :e_m => 10, :g_y => 1667, :g_m => 11, :g_d => 16},
             {:era => :kanbun, :e_y =>  7, :e_m => 11, :g_y => 1667, :g_m => 12, :g_d => 15},
             {:era => :kanbun, :e_y =>  7, :e_m => 12, :g_y => 1668, :g_m =>  1, :g_d => 14},

             {:era => :kanbun, :e_y =>  8, :e_m =>  1, :g_y => 1668, :g_m =>  2, :g_d => 12},
             {:era => :kanbun, :e_y =>  8, :e_m =>  2, :g_y => 1668, :g_m =>  3, :g_d => 13},
             {:era => :kanbun, :e_y =>  8, :e_m =>  3, :g_y => 1668, :g_m =>  4, :g_d => 12},
             {:era => :kanbun, :e_y =>  8, :e_m =>  4, :g_y => 1668, :g_m =>  5, :g_d => 11},
             {:era => :kanbun, :e_y =>  8, :e_m =>  5, :g_y => 1668, :g_m =>  6, :g_d => 10},
             {:era => :kanbun, :e_y =>  8, :e_m =>  6, :g_y => 1668, :g_m =>  7, :g_d =>  9},
             {:era => :kanbun, :e_y =>  8, :e_m =>  7, :g_y => 1668, :g_m =>  8, :g_d =>  8},
             {:era => :kanbun, :e_y =>  8, :e_m =>  8, :g_y => 1668, :g_m =>  9, :g_d =>  7},
             {:era => :kanbun, :e_y =>  8, :e_m =>  9, :g_y => 1668, :g_m => 10, :g_d =>  6},
             {:era => :kanbun, :e_y =>  8, :e_m => 10, :g_y => 1668, :g_m => 11, :g_d =>  5},
             {:era => :kanbun, :e_y =>  8, :e_m => 11, :g_y => 1668, :g_m => 12, :g_d =>  4},
             {:era => :kanbun, :e_y =>  8, :e_m => 12, :g_y => 1669, :g_m =>  1, :g_d =>  3},

             {:era => :kanbun, :e_y =>  9, :e_m =>  1, :g_y => 1669, :g_m =>  2, :g_d =>  1},
             {:era => :kanbun, :e_y =>  9, :e_m =>  2, :g_y => 1669, :g_m =>  3, :g_d =>  2},
             {:era => :kanbun, :e_y =>  9, :e_m =>  3, :g_y => 1669, :g_m =>  4, :g_d =>  1},
             {:era => :kanbun, :e_y =>  9, :e_m =>  4, :g_y => 1669, :g_m =>  4, :g_d => 30},
             {:era => :kanbun, :e_y =>  9, :e_m =>  5, :g_y => 1669, :g_m =>  5, :g_d => 30},
             {:era => :kanbun, :e_y =>  9, :e_m =>  6, :g_y => 1669, :g_m =>  6, :g_d => 28},
             {:era => :kanbun, :e_y =>  9, :e_m =>  7, :g_y => 1669, :g_m =>  7, :g_d => 28},
             {:era => :kanbun, :e_y =>  9, :e_m =>  8, :g_y => 1669, :g_m =>  8, :g_d => 27},
             {:era => :kanbun, :e_y =>  9, :e_m =>  9, :g_y => 1669, :g_m =>  9, :g_d => 25},
             {:era => :kanbun, :e_y =>  9, :e_m => 10, :g_y => 1669, :g_m => 10, :g_d => 25},
             {:era => :kanbun, :e_y =>  9, :e_m => 10, :g_y => 1669, :g_m => 11, :g_d => 24, :leap_month => true},
             {:era => :kanbun, :e_y =>  9, :e_m => 11, :g_y => 1669, :g_m => 12, :g_d => 23},
             {:era => :kanbun, :e_y =>  9, :e_m => 12, :g_y => 1670, :g_m =>  1, :g_d => 22},

             {:era => :kanbun, :e_y => 10, :e_m =>  1, :g_y => 1670, :g_m =>  2, :g_d => 20},
             {:era => :kanbun, :e_y => 10, :e_m =>  2, :g_y => 1670, :g_m =>  3, :g_d => 21},
             {:era => :kanbun, :e_y => 10, :e_m =>  3, :g_y => 1670, :g_m =>  4, :g_d => 20},
             {:era => :kanbun, :e_y => 10, :e_m =>  4, :g_y => 1670, :g_m =>  5, :g_d => 19},
             {:era => :kanbun, :e_y => 10, :e_m =>  5, :g_y => 1670, :g_m =>  6, :g_d => 18},
             {:era => :kanbun, :e_y => 10, :e_m =>  6, :g_y => 1670, :g_m =>  7, :g_d => 17},
             {:era => :kanbun, :e_y => 10, :e_m =>  7, :g_y => 1670, :g_m =>  8, :g_d => 16},
             {:era => :kanbun, :e_y => 10, :e_m =>  8, :g_y => 1670, :g_m =>  9, :g_d => 14},
             {:era => :kanbun, :e_y => 10, :e_m =>  9, :g_y => 1670, :g_m => 10, :g_d => 14},
             {:era => :kanbun, :e_y => 10, :e_m => 10, :g_y => 1670, :g_m => 11, :g_d => 13},
             {:era => :kanbun, :e_y => 10, :e_m => 11, :g_y => 1670, :g_m => 12, :g_d => 13},
             {:era => :kanbun, :e_y => 10, :e_m => 12, :g_y => 1671, :g_m =>  1, :g_d => 11},

             {:era => :kanbun, :e_y => 11, :e_m =>  1, :g_y => 1671, :g_m =>  2, :g_d => 10},
             {:era => :kanbun, :e_y => 11, :e_m =>  2, :g_y => 1671, :g_m =>  3, :g_d => 11},
             {:era => :kanbun, :e_y => 11, :e_m =>  3, :g_y => 1671, :g_m =>  4, :g_d => 10},
             {:era => :kanbun, :e_y => 11, :e_m =>  4, :g_y => 1671, :g_m =>  5, :g_d =>  9},
             {:era => :kanbun, :e_y => 11, :e_m =>  5, :g_y => 1671, :g_m =>  6, :g_d =>  7},
             {:era => :kanbun, :e_y => 11, :e_m =>  6, :g_y => 1671, :g_m =>  7, :g_d =>  7},
             {:era => :kanbun, :e_y => 11, :e_m =>  7, :g_y => 1671, :g_m =>  8, :g_d =>  5},
             {:era => :kanbun, :e_y => 11, :e_m =>  8, :g_y => 1671, :g_m =>  9, :g_d =>  3},
             {:era => :kanbun, :e_y => 11, :e_m =>  9, :g_y => 1671, :g_m => 10, :g_d =>  3},
             {:era => :kanbun, :e_y => 11, :e_m => 10, :g_y => 1671, :g_m => 11, :g_d =>  2},
             {:era => :kanbun, :e_y => 11, :e_m => 11, :g_y => 1671, :g_m => 12, :g_d =>  2},
             {:era => :kanbun, :e_y => 11, :e_m => 12, :g_y => 1671, :g_m => 12, :g_d => 31},

             {:era => :kanbun, :e_y => 12, :e_m =>  1, :g_y => 1672, :g_m =>  1, :g_d => 30},
             {:era => :kanbun, :e_y => 12, :e_m =>  2, :g_y => 1672, :g_m =>  2, :g_d => 29},
             {:era => :kanbun, :e_y => 12, :e_m =>  3, :g_y => 1672, :g_m =>  3, :g_d => 29},
             {:era => :kanbun, :e_y => 12, :e_m =>  4, :g_y => 1672, :g_m =>  4, :g_d => 28},
             {:era => :kanbun, :e_y => 12, :e_m =>  5, :g_y => 1672, :g_m =>  5, :g_d => 27},
             {:era => :kanbun, :e_y => 12, :e_m =>  6, :g_y => 1672, :g_m =>  6, :g_d => 25},
             {:era => :kanbun, :e_y => 12, :e_m =>  6, :g_y => 1672, :g_m =>  7, :g_d => 24, :leap_month => true},
             {:era => :kanbun, :e_y => 12, :e_m =>  7, :g_y => 1672, :g_m =>  8, :g_d => 23},
             {:era => :kanbun, :e_y => 12, :e_m =>  8, :g_y => 1672, :g_m =>  9, :g_d => 21},
             {:era => :kanbun, :e_y => 12, :e_m =>  9, :g_y => 1672, :g_m => 10, :g_d => 21},
             {:era => :kanbun, :e_y => 12, :e_m => 10, :g_y => 1672, :g_m => 11, :g_d => 20},
             {:era => :kanbun, :e_y => 12, :e_m => 11, :g_y => 1672, :g_m => 12, :g_d => 19},
             {:era => :kanbun, :e_y => 12, :e_m => 12, :g_y => 1673, :g_m =>  1, :g_d => 18},

             {:era => :kanbun, :e_y => 13, :e_m =>  1, :g_y => 1673, :g_m =>  2, :g_d => 17},
             {:era => :kanbun, :e_y => 13, :e_m =>  2, :g_y => 1673, :g_m =>  3, :g_d => 19},
             {:era => :kanbun, :e_y => 13, :e_m =>  3, :g_y => 1673, :g_m =>  4, :g_d => 17},
             {:era => :kanbun, :e_y => 13, :e_m =>  4, :g_y => 1673, :g_m =>  5, :g_d => 17},
             {:era => :kanbun, :e_y => 13, :e_m =>  5, :g_y => 1673, :g_m =>  6, :g_d => 15},
             {:era => :kanbun, :e_y => 13, :e_m =>  6, :g_y => 1673, :g_m =>  7, :g_d => 14},
             {:era => :kanbun, :e_y => 13, :e_m =>  7, :g_y => 1673, :g_m =>  8, :g_d => 12},
             {:era => :kanbun, :e_y => 13, :e_m =>  8, :g_y => 1673, :g_m =>  9, :g_d => 11},
             {:era => :kanbun, :e_y => 13, :e_m =>  9, :g_y => 1673, :g_m => 10, :g_d => 10},
             {:era => :kanbun, :e_y => 13, :e_m => 10, :g_y => 1673, :g_m => 11, :g_d =>  9},
             {:era => :kanbun, :e_y => 13, :e_m => 11, :g_y => 1673, :g_m => 12, :g_d =>  8},
             {:era => :kanbun, :e_y => 13, :e_m => 12, :g_y => 1674, :g_m =>  1, :g_d =>  7},

            ]

    add_era_table table
  end # Date
end # Wareki
