# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Kan%27en' # 
    # KANJI_ERA_NAME = '寛延'

    # 寛延
    # http://ja.wikipedia.org/wiki/%E5%AF%9B%E5%BB%B6
    # | 寛延元年 (戊辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     閏十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1748/01/30 | 1748/02/28 | 1748/03/29 | 1748/04/28 | 1748/05/27 | 1748/06/26 | 1748/07/25 | 1748/08/24 | 1748/09/23 | 1748/10/22 | 1748/11/21 | 1748/12/20 | 1749/01/19 |
    # | 寛延二年 (己巳)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1749/02/17 | 1749/03/19 | 1749/04/17 | 1749/05/16 | 1749/06/15 | 1749/07/14 | 1749/08/13 | 1749/09/12 | 1749/10/11 | 1749/11/10 | 1749/12/10 | 1750/01/08 |
    # | 寛延三年 (庚午)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1750/02/07 | 1750/03/08 | 1750/04/07 | 1750/05/06 | 1750/06/04 | 1750/07/04 | 1750/08/02 | 1750/09/01 | 1750/09/30 | 1750/10/30 | 1750/11/29 | 1750/12/29 |
    # | 寛延四年 (辛未)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |     閏六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1751/01/27 | 1751/02/26 | 1751/03/27 | 1751/04/26 | 1751/05/25 | 1751/06/23 | 1751/07/23 | 1751/08/21 | 1751/09/20 | 1751/10/19 | 1751/11/18 | 1751/12/18 | 1752/01/16 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :kanen, :e_y =>  1, :e_m =>  1, :g_y => 1748, :g_m =>  1, :g_d => 30},
             {:era => :kanen, :e_y =>  1, :e_m =>  2, :g_y => 1748, :g_m =>  2, :g_d => 28},
             {:era => :kanen, :e_y =>  1, :e_m =>  3, :g_y => 1748, :g_m =>  3, :g_d => 29},
             {:era => :kanen, :e_y =>  1, :e_m =>  4, :g_y => 1748, :g_m =>  4, :g_d => 28},
             {:era => :kanen, :e_y =>  1, :e_m =>  5, :g_y => 1748, :g_m =>  5, :g_d => 27},
             {:era => :kanen, :e_y =>  1, :e_m =>  6, :g_y => 1748, :g_m =>  6, :g_d => 26},
             {:era => :kanen, :e_y =>  1, :e_m =>  7, :g_y => 1748, :g_m =>  7, :g_d => 25},
             {:era => :kanen, :e_y =>  1, :e_m =>  8, :g_y => 1748, :g_m =>  8, :g_d => 24},
             {:era => :kanen, :e_y =>  1, :e_m =>  9, :g_y => 1748, :g_m =>  9, :g_d => 23},
             {:era => :kanen, :e_y =>  1, :e_m => 10, :g_y => 1748, :g_m => 10, :g_d => 22},
             {:era => :kanen, :e_y =>  1, :e_m => 10, :g_y => 1748, :g_m => 11, :g_d => 21, :leap_month => true},
             {:era => :kanen, :e_y =>  1, :e_m => 11, :g_y => 1748, :g_m => 12, :g_d => 20},
             {:era => :kanen, :e_y =>  1, :e_m => 12, :g_y => 1749, :g_m =>  1, :g_d => 19},

             {:era => :kanen, :e_y =>  2, :e_m =>  1, :g_y => 1749, :g_m =>  2, :g_d => 17},
             {:era => :kanen, :e_y =>  2, :e_m =>  2, :g_y => 1749, :g_m =>  3, :g_d => 19},
             {:era => :kanen, :e_y =>  2, :e_m =>  3, :g_y => 1749, :g_m =>  4, :g_d => 17},
             {:era => :kanen, :e_y =>  2, :e_m =>  4, :g_y => 1749, :g_m =>  5, :g_d => 16},
             {:era => :kanen, :e_y =>  2, :e_m =>  5, :g_y => 1749, :g_m =>  6, :g_d => 15},
             {:era => :kanen, :e_y =>  2, :e_m =>  6, :g_y => 1749, :g_m =>  7, :g_d => 14},
             {:era => :kanen, :e_y =>  2, :e_m =>  7, :g_y => 1749, :g_m =>  8, :g_d => 13},
             {:era => :kanen, :e_y =>  2, :e_m =>  8, :g_y => 1749, :g_m =>  9, :g_d => 12},
             {:era => :kanen, :e_y =>  2, :e_m =>  9, :g_y => 1749, :g_m => 10, :g_d => 11},
             {:era => :kanen, :e_y =>  2, :e_m => 10, :g_y => 1749, :g_m => 11, :g_d => 10},
             {:era => :kanen, :e_y =>  2, :e_m => 11, :g_y => 1749, :g_m => 12, :g_d => 10},
             {:era => :kanen, :e_y =>  2, :e_m => 12, :g_y => 1750, :g_m =>  1, :g_d =>  8},

             {:era => :kanen, :e_y =>  3, :e_m =>  1, :g_y => 1750, :g_m =>  2, :g_d =>  7},
             {:era => :kanen, :e_y =>  3, :e_m =>  2, :g_y => 1750, :g_m =>  3, :g_d =>  8},
             {:era => :kanen, :e_y =>  3, :e_m =>  3, :g_y => 1750, :g_m =>  4, :g_d =>  7},
             {:era => :kanen, :e_y =>  3, :e_m =>  4, :g_y => 1750, :g_m =>  5, :g_d =>  6},
             {:era => :kanen, :e_y =>  3, :e_m =>  5, :g_y => 1750, :g_m =>  6, :g_d =>  4},
             {:era => :kanen, :e_y =>  3, :e_m =>  6, :g_y => 1750, :g_m =>  7, :g_d =>  4},
             {:era => :kanen, :e_y =>  3, :e_m =>  7, :g_y => 1750, :g_m =>  8, :g_d =>  2},
             {:era => :kanen, :e_y =>  3, :e_m =>  8, :g_y => 1750, :g_m =>  9, :g_d =>  1},
             {:era => :kanen, :e_y =>  3, :e_m =>  9, :g_y => 1750, :g_m =>  9, :g_d => 30},
             {:era => :kanen, :e_y =>  3, :e_m => 10, :g_y => 1750, :g_m => 10, :g_d => 30},
             {:era => :kanen, :e_y =>  3, :e_m => 11, :g_y => 1750, :g_m => 11, :g_d => 29},
             {:era => :kanen, :e_y =>  3, :e_m => 12, :g_y => 1750, :g_m => 12, :g_d => 29},

             {:era => :kanen, :e_y =>  4, :e_m =>  1, :g_y => 1751, :g_m =>  1, :g_d => 27},
             {:era => :kanen, :e_y =>  4, :e_m =>  2, :g_y => 1751, :g_m =>  2, :g_d => 26},
             {:era => :kanen, :e_y =>  4, :e_m =>  3, :g_y => 1751, :g_m =>  3, :g_d => 27},
             {:era => :kanen, :e_y =>  4, :e_m =>  4, :g_y => 1751, :g_m =>  4, :g_d => 26},
             {:era => :kanen, :e_y =>  4, :e_m =>  5, :g_y => 1751, :g_m =>  5, :g_d => 25},
             {:era => :kanen, :e_y =>  4, :e_m =>  6, :g_y => 1751, :g_m =>  6, :g_d => 23},
             {:era => :kanen, :e_y =>  4, :e_m =>  6, :g_y => 1751, :g_m =>  7, :g_d => 23, :leap_month => true},
             {:era => :kanen, :e_y =>  4, :e_m =>  7, :g_y => 1751, :g_m =>  8, :g_d => 21},
             {:era => :kanen, :e_y =>  4, :e_m =>  8, :g_y => 1751, :g_m =>  9, :g_d => 20},
             {:era => :kanen, :e_y =>  4, :e_m =>  9, :g_y => 1751, :g_m => 10, :g_d => 19},
             {:era => :kanen, :e_y =>  4, :e_m => 10, :g_y => 1751, :g_m => 11, :g_d => 18},
             {:era => :kanen, :e_y =>  4, :e_m => 11, :g_y => 1751, :g_m => 12, :g_d => 18},
             {:era => :kanen, :e_y =>  4, :e_m => 12, :g_y => 1752, :g_m =>  1, :g_d => 16},

            ]

    add_era_table table
  end # Date
end # Wareki
