# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Kanp%C5%8D' # 
    # KANJI_ERA_NAME = '寛保'

    # 寛保
    # http://ja.wikipedia.org/wiki/%E5%AF%9B%E4%BF%9D
    # | 寛保元年 (辛酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1741/02/16 | 1741/03/17 | 1741/04/16 | 1741/05/15 | 1741/06/13 | 1741/07/13 | 1741/08/11 | 1741/09/10 | 1741/10/10 | 1741/11/08 | 1741/12/08 | 1742/01/07 |
    # | 寛保二年 (壬戌)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1742/02/05 | 1742/03/07 | 1742/04/05 | 1742/05/05 | 1742/06/03 | 1742/07/02 | 1742/08/01 | 1742/08/30 | 1742/09/29 | 1742/10/28 | 1742/11/27 | 1742/12/27 |
    # | 寛保三年 (癸亥)     |       一月 |       二月 |       三月 |       四月 |     閏四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1743/01/26 | 1743/02/24 | 1743/03/26 | 1743/04/24 | 1743/05/24 | 1743/06/22 | 1743/07/21 | 1743/08/20 | 1743/09/18 | 1743/10/17 | 1743/11/16 | 1743/12/16 | 1744/01/15 |
    # | 寛保四年 (甲子)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1744/02/14 | 1744/03/14 | 1744/04/13 | 1744/05/12 | 1744/06/11 | 1744/07/10 | 1744/08/08 | 1744/09/07 | 1744/10/06 | 1744/11/04 | 1744/12/04 | 1745/01/03 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :kanpo, :e_y =>  1, :e_m =>  1, :g_y => 1741, :g_m =>  2, :g_d => 16},
             {:era => :kanpo, :e_y =>  1, :e_m =>  2, :g_y => 1741, :g_m =>  3, :g_d => 17},
             {:era => :kanpo, :e_y =>  1, :e_m =>  3, :g_y => 1741, :g_m =>  4, :g_d => 16},
             {:era => :kanpo, :e_y =>  1, :e_m =>  4, :g_y => 1741, :g_m =>  5, :g_d => 15},
             {:era => :kanpo, :e_y =>  1, :e_m =>  5, :g_y => 1741, :g_m =>  6, :g_d => 13},
             {:era => :kanpo, :e_y =>  1, :e_m =>  6, :g_y => 1741, :g_m =>  7, :g_d => 13},
             {:era => :kanpo, :e_y =>  1, :e_m =>  7, :g_y => 1741, :g_m =>  8, :g_d => 11},
             {:era => :kanpo, :e_y =>  1, :e_m =>  8, :g_y => 1741, :g_m =>  9, :g_d => 10},
             {:era => :kanpo, :e_y =>  1, :e_m =>  9, :g_y => 1741, :g_m => 10, :g_d => 10},
             {:era => :kanpo, :e_y =>  1, :e_m => 10, :g_y => 1741, :g_m => 11, :g_d =>  8},
             {:era => :kanpo, :e_y =>  1, :e_m => 11, :g_y => 1741, :g_m => 12, :g_d =>  8},
             {:era => :kanpo, :e_y =>  1, :e_m => 12, :g_y => 1742, :g_m =>  1, :g_d =>  7},

             {:era => :kanpo, :e_y =>  2, :e_m =>  1, :g_y => 1742, :g_m =>  2, :g_d =>  5},
             {:era => :kanpo, :e_y =>  2, :e_m =>  2, :g_y => 1742, :g_m =>  3, :g_d =>  7},
             {:era => :kanpo, :e_y =>  2, :e_m =>  3, :g_y => 1742, :g_m =>  4, :g_d =>  5},
             {:era => :kanpo, :e_y =>  2, :e_m =>  4, :g_y => 1742, :g_m =>  5, :g_d =>  5},
             {:era => :kanpo, :e_y =>  2, :e_m =>  5, :g_y => 1742, :g_m =>  6, :g_d =>  3},
             {:era => :kanpo, :e_y =>  2, :e_m =>  6, :g_y => 1742, :g_m =>  7, :g_d =>  2},
             {:era => :kanpo, :e_y =>  2, :e_m =>  7, :g_y => 1742, :g_m =>  8, :g_d =>  1},
             {:era => :kanpo, :e_y =>  2, :e_m =>  8, :g_y => 1742, :g_m =>  8, :g_d => 30},
             {:era => :kanpo, :e_y =>  2, :e_m =>  9, :g_y => 1742, :g_m =>  9, :g_d => 29},
             {:era => :kanpo, :e_y =>  2, :e_m => 10, :g_y => 1742, :g_m => 10, :g_d => 28},
             {:era => :kanpo, :e_y =>  2, :e_m => 11, :g_y => 1742, :g_m => 11, :g_d => 27},
             {:era => :kanpo, :e_y =>  2, :e_m => 12, :g_y => 1742, :g_m => 12, :g_d => 27},

             {:era => :kanpo, :e_y =>  3, :e_m =>  1, :g_y => 1743, :g_m =>  1, :g_d => 26},
             {:era => :kanpo, :e_y =>  3, :e_m =>  2, :g_y => 1743, :g_m =>  2, :g_d => 24},
             {:era => :kanpo, :e_y =>  3, :e_m =>  3, :g_y => 1743, :g_m =>  3, :g_d => 26},
             {:era => :kanpo, :e_y =>  3, :e_m =>  4, :g_y => 1743, :g_m =>  4, :g_d => 24},
             {:era => :kanpo, :e_y =>  3, :e_m =>  4, :g_y => 1743, :g_m =>  5, :g_d => 24, :leap_month => true},
             {:era => :kanpo, :e_y =>  3, :e_m =>  5, :g_y => 1743, :g_m =>  6, :g_d => 22},
             {:era => :kanpo, :e_y =>  3, :e_m =>  6, :g_y => 1743, :g_m =>  7, :g_d => 21},
             {:era => :kanpo, :e_y =>  3, :e_m =>  7, :g_y => 1743, :g_m =>  8, :g_d => 20},
             {:era => :kanpo, :e_y =>  3, :e_m =>  8, :g_y => 1743, :g_m =>  9, :g_d => 18},
             {:era => :kanpo, :e_y =>  3, :e_m =>  9, :g_y => 1743, :g_m => 10, :g_d => 17},
             {:era => :kanpo, :e_y =>  3, :e_m => 10, :g_y => 1743, :g_m => 11, :g_d => 16},
             {:era => :kanpo, :e_y =>  3, :e_m => 11, :g_y => 1743, :g_m => 12, :g_d => 16},
             {:era => :kanpo, :e_y =>  3, :e_m => 12, :g_y => 1744, :g_m =>  1, :g_d => 15},

             {:era => :kanpo, :e_y =>  4, :e_m =>  1, :g_y => 1744, :g_m =>  2, :g_d => 14},
             {:era => :kanpo, :e_y =>  4, :e_m =>  2, :g_y => 1744, :g_m =>  3, :g_d => 14},
             {:era => :kanpo, :e_y =>  4, :e_m =>  3, :g_y => 1744, :g_m =>  4, :g_d => 13},
             {:era => :kanpo, :e_y =>  4, :e_m =>  4, :g_y => 1744, :g_m =>  5, :g_d => 12},
             {:era => :kanpo, :e_y =>  4, :e_m =>  5, :g_y => 1744, :g_m =>  6, :g_d => 11},
             {:era => :kanpo, :e_y =>  4, :e_m =>  6, :g_y => 1744, :g_m =>  7, :g_d => 10},
             {:era => :kanpo, :e_y =>  4, :e_m =>  7, :g_y => 1744, :g_m =>  8, :g_d =>  8},
             {:era => :kanpo, :e_y =>  4, :e_m =>  8, :g_y => 1744, :g_m =>  9, :g_d =>  7},
             {:era => :kanpo, :e_y =>  4, :e_m =>  9, :g_y => 1744, :g_m => 10, :g_d =>  6},
             {:era => :kanpo, :e_y =>  4, :e_m => 10, :g_y => 1744, :g_m => 11, :g_d =>  4},
             {:era => :kanpo, :e_y =>  4, :e_m => 11, :g_y => 1744, :g_m => 12, :g_d =>  4},
             {:era => :kanpo, :e_y =>  4, :e_m => 12, :g_y => 1745, :g_m =>  1, :g_d =>  3},

            ]

    add_era_table table
  end # Date
end # Wareki
