# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Kansei' # 
    # KANJI_ERA_NAME = '寛政'

    # 寛政
    # http://ja.wikipedia.org/wiki/%E5%AF%9B%E6%94%BF
    # | 寛政元年 (己酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |     閏六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1789/01/26 | 1789/02/25 | 1789/03/27 | 1789/04/25 | 1789/05/25 | 1789/06/23 | 1789/07/23 | 1789/08/21 | 1789/09/19 | 1789/10/19 | 1789/11/17 | 1789/12/17 | 1790/01/15 |
    # | 寛政二年 (庚戌)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1790/02/14 | 1790/03/16 | 1790/04/14 | 1790/05/14 | 1790/06/13 | 1790/07/12 | 1790/08/11 | 1790/09/09 | 1790/10/08 | 1790/11/07 | 1790/12/06 | 1791/01/05 |
    # | 寛政三年 (辛亥)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1791/02/03 | 1791/03/05 | 1791/04/03 | 1791/05/03 | 1791/06/02 | 1791/07/01 | 1791/07/31 | 1791/08/29 | 1791/09/28 | 1791/10/27 | 1791/11/26 | 1791/12/25 |
    # | 寛政四年 (壬子)     |       一月 |       二月 |     閏二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1792/01/24 | 1792/02/22 | 1792/03/23 | 1792/04/21 | 1792/05/21 | 1792/06/19 | 1792/07/19 | 1792/08/18 | 1792/09/16 | 1792/10/16 | 1792/11/14 | 1792/12/14 | 1793/01/12 |
    # | 寛政五年 (癸丑)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1793/02/11 | 1793/03/12 | 1793/04/11 | 1793/05/10 | 1793/06/09 | 1793/07/08 | 1793/08/07 | 1793/09/05 | 1793/10/05 | 1793/11/04 | 1793/12/03 | 1794/01/02 |
    # | 寛政六年 (甲寅)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |   閏十一月 |     十二月 |
    # |        グレゴリオ暦 | 1794/01/31 | 1794/03/02 | 1794/03/31 | 1794/04/30 | 1794/05/29 | 1794/06/27 | 1794/07/27 | 1794/08/25 | 1794/09/24 | 1794/10/24 | 1794/11/23 | 1794/12/22 | 1795/01/21 |
    # | 寛政七年 (乙卯)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1795/02/19 | 1795/03/21 | 1795/04/19 | 1795/05/19 | 1795/06/17 | 1795/07/16 | 1795/08/15 | 1795/09/13 | 1795/10/13 | 1795/11/12 | 1795/12/11 | 1796/01/10 |
    # | 寛政八年 (丙辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1796/02/09 | 1796/03/09 | 1796/04/08 | 1796/05/07 | 1796/06/06 | 1796/07/05 | 1796/08/03 | 1796/09/02 | 1796/10/01 | 1796/10/31 | 1796/11/29 | 1796/12/29 |
    # | 寛政九年 (丁巳)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |     閏七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1797/01/28 | 1797/02/27 | 1797/03/28 | 1797/04/27 | 1797/05/26 | 1797/06/25 | 1797/07/24 | 1797/08/22 | 1797/09/20 | 1797/10/20 | 1797/11/18 | 1797/12/18 | 1798/01/17 |
    # | 寛政十年 (戊午)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1798/02/16 | 1798/03/17 | 1798/04/16 | 1798/05/16 | 1798/06/14 | 1798/07/14 | 1798/08/12 | 1798/09/10 | 1798/10/10 | 1798/11/08 | 1798/12/07 | 1799/01/06 |
    # | 寛政十一年 (己未)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1799/02/05 | 1799/03/06 | 1799/04/05 | 1799/05/05 | 1799/06/04 | 1799/07/03 | 1799/08/01 | 1799/08/31 | 1799/09/29 | 1799/10/29 | 1799/11/27 | 1799/12/26 |
    # | 寛政十二年 (庚申)   |       一月 |       二月 |       三月 |       四月 |     閏四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1800/01/25 | 1800/02/24 | 1800/03/25 | 1800/04/24 | 1800/05/24 | 1800/06/22 | 1800/07/22 | 1800/08/20 | 1800/09/19 | 1800/10/18 | 1800/11/17 | 1800/12/16 | 1801/01/15 |
    # | 寛政十三年 (辛酉)   |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1801/02/13 | 1801/03/15 | 1801/04/13 | 1801/05/13 | 1801/06/11 | 1801/07/11 | 1801/08/09 | 1801/09/08 | 1801/10/08 | 1801/11/06 | 1801/12/06 | 1802/01/04 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :kansei, :e_y =>  1, :e_m =>  1, :g_y => 1789, :g_m =>  1, :g_d => 26},
             {:era => :kansei, :e_y =>  1, :e_m =>  2, :g_y => 1789, :g_m =>  2, :g_d => 25},
             {:era => :kansei, :e_y =>  1, :e_m =>  3, :g_y => 1789, :g_m =>  3, :g_d => 27},
             {:era => :kansei, :e_y =>  1, :e_m =>  4, :g_y => 1789, :g_m =>  4, :g_d => 25},
             {:era => :kansei, :e_y =>  1, :e_m =>  5, :g_y => 1789, :g_m =>  5, :g_d => 25},
             {:era => :kansei, :e_y =>  1, :e_m =>  6, :g_y => 1789, :g_m =>  6, :g_d => 23},
             {:era => :kansei, :e_y =>  1, :e_m =>  6, :g_y => 1789, :g_m =>  7, :g_d => 23, :leap_month => true},
             {:era => :kansei, :e_y =>  1, :e_m =>  7, :g_y => 1789, :g_m =>  8, :g_d => 21},
             {:era => :kansei, :e_y =>  1, :e_m =>  8, :g_y => 1789, :g_m =>  9, :g_d => 19},
             {:era => :kansei, :e_y =>  1, :e_m =>  9, :g_y => 1789, :g_m => 10, :g_d => 19},
             {:era => :kansei, :e_y =>  1, :e_m => 10, :g_y => 1789, :g_m => 11, :g_d => 17},
             {:era => :kansei, :e_y =>  1, :e_m => 11, :g_y => 1789, :g_m => 12, :g_d => 17},
             {:era => :kansei, :e_y =>  1, :e_m => 12, :g_y => 1790, :g_m =>  1, :g_d => 15},

             {:era => :kansei, :e_y =>  2, :e_m =>  1, :g_y => 1790, :g_m =>  2, :g_d => 14},
             {:era => :kansei, :e_y =>  2, :e_m =>  2, :g_y => 1790, :g_m =>  3, :g_d => 16},
             {:era => :kansei, :e_y =>  2, :e_m =>  3, :g_y => 1790, :g_m =>  4, :g_d => 14},
             {:era => :kansei, :e_y =>  2, :e_m =>  4, :g_y => 1790, :g_m =>  5, :g_d => 14},
             {:era => :kansei, :e_y =>  2, :e_m =>  5, :g_y => 1790, :g_m =>  6, :g_d => 13},
             {:era => :kansei, :e_y =>  2, :e_m =>  6, :g_y => 1790, :g_m =>  7, :g_d => 12},
             {:era => :kansei, :e_y =>  2, :e_m =>  7, :g_y => 1790, :g_m =>  8, :g_d => 11},
             {:era => :kansei, :e_y =>  2, :e_m =>  8, :g_y => 1790, :g_m =>  9, :g_d =>  9},
             {:era => :kansei, :e_y =>  2, :e_m =>  9, :g_y => 1790, :g_m => 10, :g_d =>  8},
             {:era => :kansei, :e_y =>  2, :e_m => 10, :g_y => 1790, :g_m => 11, :g_d =>  7},
             {:era => :kansei, :e_y =>  2, :e_m => 11, :g_y => 1790, :g_m => 12, :g_d =>  6},
             {:era => :kansei, :e_y =>  2, :e_m => 12, :g_y => 1791, :g_m =>  1, :g_d =>  5},

             {:era => :kansei, :e_y =>  3, :e_m =>  1, :g_y => 1791, :g_m =>  2, :g_d =>  3},
             {:era => :kansei, :e_y =>  3, :e_m =>  2, :g_y => 1791, :g_m =>  3, :g_d =>  5},
             {:era => :kansei, :e_y =>  3, :e_m =>  3, :g_y => 1791, :g_m =>  4, :g_d =>  3},
             {:era => :kansei, :e_y =>  3, :e_m =>  4, :g_y => 1791, :g_m =>  5, :g_d =>  3},
             {:era => :kansei, :e_y =>  3, :e_m =>  5, :g_y => 1791, :g_m =>  6, :g_d =>  2},
             {:era => :kansei, :e_y =>  3, :e_m =>  6, :g_y => 1791, :g_m =>  7, :g_d =>  1},
             {:era => :kansei, :e_y =>  3, :e_m =>  7, :g_y => 1791, :g_m =>  7, :g_d => 31},
             {:era => :kansei, :e_y =>  3, :e_m =>  8, :g_y => 1791, :g_m =>  8, :g_d => 29},
             {:era => :kansei, :e_y =>  3, :e_m =>  9, :g_y => 1791, :g_m =>  9, :g_d => 28},
             {:era => :kansei, :e_y =>  3, :e_m => 10, :g_y => 1791, :g_m => 10, :g_d => 27},
             {:era => :kansei, :e_y =>  3, :e_m => 11, :g_y => 1791, :g_m => 11, :g_d => 26},
             {:era => :kansei, :e_y =>  3, :e_m => 12, :g_y => 1791, :g_m => 12, :g_d => 25},

             {:era => :kansei, :e_y =>  4, :e_m =>  1, :g_y => 1792, :g_m =>  1, :g_d => 24},
             {:era => :kansei, :e_y =>  4, :e_m =>  2, :g_y => 1792, :g_m =>  2, :g_d => 22},
             {:era => :kansei, :e_y =>  4, :e_m =>  2, :g_y => 1792, :g_m =>  3, :g_d => 23, :leap_month => true},
             {:era => :kansei, :e_y =>  4, :e_m =>  3, :g_y => 1792, :g_m =>  4, :g_d => 21},
             {:era => :kansei, :e_y =>  4, :e_m =>  4, :g_y => 1792, :g_m =>  5, :g_d => 21},
             {:era => :kansei, :e_y =>  4, :e_m =>  5, :g_y => 1792, :g_m =>  6, :g_d => 19},
             {:era => :kansei, :e_y =>  4, :e_m =>  6, :g_y => 1792, :g_m =>  7, :g_d => 19},
             {:era => :kansei, :e_y =>  4, :e_m =>  7, :g_y => 1792, :g_m =>  8, :g_d => 18},
             {:era => :kansei, :e_y =>  4, :e_m =>  8, :g_y => 1792, :g_m =>  9, :g_d => 16},
             {:era => :kansei, :e_y =>  4, :e_m =>  9, :g_y => 1792, :g_m => 10, :g_d => 16},
             {:era => :kansei, :e_y =>  4, :e_m => 10, :g_y => 1792, :g_m => 11, :g_d => 14},
             {:era => :kansei, :e_y =>  4, :e_m => 11, :g_y => 1792, :g_m => 12, :g_d => 14},
             {:era => :kansei, :e_y =>  4, :e_m => 12, :g_y => 1793, :g_m =>  1, :g_d => 12},

             {:era => :kansei, :e_y =>  5, :e_m =>  1, :g_y => 1793, :g_m =>  2, :g_d => 11},
             {:era => :kansei, :e_y =>  5, :e_m =>  2, :g_y => 1793, :g_m =>  3, :g_d => 12},
             {:era => :kansei, :e_y =>  5, :e_m =>  3, :g_y => 1793, :g_m =>  4, :g_d => 11},
             {:era => :kansei, :e_y =>  5, :e_m =>  4, :g_y => 1793, :g_m =>  5, :g_d => 10},
             {:era => :kansei, :e_y =>  5, :e_m =>  5, :g_y => 1793, :g_m =>  6, :g_d =>  9},
             {:era => :kansei, :e_y =>  5, :e_m =>  6, :g_y => 1793, :g_m =>  7, :g_d =>  8},
             {:era => :kansei, :e_y =>  5, :e_m =>  7, :g_y => 1793, :g_m =>  8, :g_d =>  7},
             {:era => :kansei, :e_y =>  5, :e_m =>  8, :g_y => 1793, :g_m =>  9, :g_d =>  5},
             {:era => :kansei, :e_y =>  5, :e_m =>  9, :g_y => 1793, :g_m => 10, :g_d =>  5},
             {:era => :kansei, :e_y =>  5, :e_m => 10, :g_y => 1793, :g_m => 11, :g_d =>  4},
             {:era => :kansei, :e_y =>  5, :e_m => 11, :g_y => 1793, :g_m => 12, :g_d =>  3},
             {:era => :kansei, :e_y =>  5, :e_m => 12, :g_y => 1794, :g_m =>  1, :g_d =>  2},

             {:era => :kansei, :e_y =>  6, :e_m =>  1, :g_y => 1794, :g_m =>  1, :g_d => 31},
             {:era => :kansei, :e_y =>  6, :e_m =>  2, :g_y => 1794, :g_m =>  3, :g_d =>  2},
             {:era => :kansei, :e_y =>  6, :e_m =>  3, :g_y => 1794, :g_m =>  3, :g_d => 31},
             {:era => :kansei, :e_y =>  6, :e_m =>  4, :g_y => 1794, :g_m =>  4, :g_d => 30},
             {:era => :kansei, :e_y =>  6, :e_m =>  5, :g_y => 1794, :g_m =>  5, :g_d => 29},
             {:era => :kansei, :e_y =>  6, :e_m =>  6, :g_y => 1794, :g_m =>  6, :g_d => 27},
             {:era => :kansei, :e_y =>  6, :e_m =>  7, :g_y => 1794, :g_m =>  7, :g_d => 27},
             {:era => :kansei, :e_y =>  6, :e_m =>  8, :g_y => 1794, :g_m =>  8, :g_d => 25},
             {:era => :kansei, :e_y =>  6, :e_m =>  9, :g_y => 1794, :g_m =>  9, :g_d => 24},
             {:era => :kansei, :e_y =>  6, :e_m => 10, :g_y => 1794, :g_m => 10, :g_d => 24},
             {:era => :kansei, :e_y =>  6, :e_m => 11, :g_y => 1794, :g_m => 11, :g_d => 23},
             {:era => :kansei, :e_y =>  6, :e_m => 11, :g_y => 1794, :g_m => 12, :g_d => 22, :leap_month => true},
             {:era => :kansei, :e_y =>  6, :e_m => 12, :g_y => 1795, :g_m =>  1, :g_d => 21},

             {:era => :kansei, :e_y =>  7, :e_m =>  1, :g_y => 1795, :g_m =>  2, :g_d => 19},
             {:era => :kansei, :e_y =>  7, :e_m =>  2, :g_y => 1795, :g_m =>  3, :g_d => 21},
             {:era => :kansei, :e_y =>  7, :e_m =>  3, :g_y => 1795, :g_m =>  4, :g_d => 19},
             {:era => :kansei, :e_y =>  7, :e_m =>  4, :g_y => 1795, :g_m =>  5, :g_d => 19},
             {:era => :kansei, :e_y =>  7, :e_m =>  5, :g_y => 1795, :g_m =>  6, :g_d => 17},
             {:era => :kansei, :e_y =>  7, :e_m =>  6, :g_y => 1795, :g_m =>  7, :g_d => 16},
             {:era => :kansei, :e_y =>  7, :e_m =>  7, :g_y => 1795, :g_m =>  8, :g_d => 15},
             {:era => :kansei, :e_y =>  7, :e_m =>  8, :g_y => 1795, :g_m =>  9, :g_d => 13},
             {:era => :kansei, :e_y =>  7, :e_m =>  9, :g_y => 1795, :g_m => 10, :g_d => 13},
             {:era => :kansei, :e_y =>  7, :e_m => 10, :g_y => 1795, :g_m => 11, :g_d => 12},
             {:era => :kansei, :e_y =>  7, :e_m => 11, :g_y => 1795, :g_m => 12, :g_d => 11},
             {:era => :kansei, :e_y =>  7, :e_m => 12, :g_y => 1796, :g_m =>  1, :g_d => 10},

             {:era => :kansei, :e_y =>  8, :e_m =>  1, :g_y => 1796, :g_m =>  2, :g_d =>  9},
             {:era => :kansei, :e_y =>  8, :e_m =>  2, :g_y => 1796, :g_m =>  3, :g_d =>  9},
             {:era => :kansei, :e_y =>  8, :e_m =>  3, :g_y => 1796, :g_m =>  4, :g_d =>  8},
             {:era => :kansei, :e_y =>  8, :e_m =>  4, :g_y => 1796, :g_m =>  5, :g_d =>  7},
             {:era => :kansei, :e_y =>  8, :e_m =>  5, :g_y => 1796, :g_m =>  6, :g_d =>  6},
             {:era => :kansei, :e_y =>  8, :e_m =>  6, :g_y => 1796, :g_m =>  7, :g_d =>  5},
             {:era => :kansei, :e_y =>  8, :e_m =>  7, :g_y => 1796, :g_m =>  8, :g_d =>  3},
             {:era => :kansei, :e_y =>  8, :e_m =>  8, :g_y => 1796, :g_m =>  9, :g_d =>  2},
             {:era => :kansei, :e_y =>  8, :e_m =>  9, :g_y => 1796, :g_m => 10, :g_d =>  1},
             {:era => :kansei, :e_y =>  8, :e_m => 10, :g_y => 1796, :g_m => 10, :g_d => 31},
             {:era => :kansei, :e_y =>  8, :e_m => 11, :g_y => 1796, :g_m => 11, :g_d => 29},
             {:era => :kansei, :e_y =>  8, :e_m => 12, :g_y => 1796, :g_m => 12, :g_d => 29},

             {:era => :kansei, :e_y =>  9, :e_m =>  1, :g_y => 1797, :g_m =>  1, :g_d => 28},
             {:era => :kansei, :e_y =>  9, :e_m =>  2, :g_y => 1797, :g_m =>  2, :g_d => 27},
             {:era => :kansei, :e_y =>  9, :e_m =>  3, :g_y => 1797, :g_m =>  3, :g_d => 28},
             {:era => :kansei, :e_y =>  9, :e_m =>  4, :g_y => 1797, :g_m =>  4, :g_d => 27},
             {:era => :kansei, :e_y =>  9, :e_m =>  5, :g_y => 1797, :g_m =>  5, :g_d => 26},
             {:era => :kansei, :e_y =>  9, :e_m =>  6, :g_y => 1797, :g_m =>  6, :g_d => 25},
             {:era => :kansei, :e_y =>  9, :e_m =>  7, :g_y => 1797, :g_m =>  7, :g_d => 24},
             {:era => :kansei, :e_y =>  9, :e_m =>  7, :g_y => 1797, :g_m =>  8, :g_d => 22, :leap_month => true},
             {:era => :kansei, :e_y =>  9, :e_m =>  8, :g_y => 1797, :g_m =>  9, :g_d => 20},
             {:era => :kansei, :e_y =>  9, :e_m =>  9, :g_y => 1797, :g_m => 10, :g_d => 20},
             {:era => :kansei, :e_y =>  9, :e_m => 10, :g_y => 1797, :g_m => 11, :g_d => 18},
             {:era => :kansei, :e_y =>  9, :e_m => 11, :g_y => 1797, :g_m => 12, :g_d => 18},
             {:era => :kansei, :e_y =>  9, :e_m => 12, :g_y => 1798, :g_m =>  1, :g_d => 17},

             {:era => :kansei, :e_y => 10, :e_m =>  1, :g_y => 1798, :g_m =>  2, :g_d => 16},
             {:era => :kansei, :e_y => 10, :e_m =>  2, :g_y => 1798, :g_m =>  3, :g_d => 17},
             {:era => :kansei, :e_y => 10, :e_m =>  3, :g_y => 1798, :g_m =>  4, :g_d => 16},
             {:era => :kansei, :e_y => 10, :e_m =>  4, :g_y => 1798, :g_m =>  5, :g_d => 16},
             {:era => :kansei, :e_y => 10, :e_m =>  5, :g_y => 1798, :g_m =>  6, :g_d => 14},
             {:era => :kansei, :e_y => 10, :e_m =>  6, :g_y => 1798, :g_m =>  7, :g_d => 14},
             {:era => :kansei, :e_y => 10, :e_m =>  7, :g_y => 1798, :g_m =>  8, :g_d => 12},
             {:era => :kansei, :e_y => 10, :e_m =>  8, :g_y => 1798, :g_m =>  9, :g_d => 10},
             {:era => :kansei, :e_y => 10, :e_m =>  9, :g_y => 1798, :g_m => 10, :g_d => 10},
             {:era => :kansei, :e_y => 10, :e_m => 10, :g_y => 1798, :g_m => 11, :g_d =>  8},
             {:era => :kansei, :e_y => 10, :e_m => 11, :g_y => 1798, :g_m => 12, :g_d =>  7},
             {:era => :kansei, :e_y => 10, :e_m => 12, :g_y => 1799, :g_m =>  1, :g_d =>  6},

             {:era => :kansei, :e_y => 11, :e_m =>  1, :g_y => 1799, :g_m =>  2, :g_d =>  5},
             {:era => :kansei, :e_y => 11, :e_m =>  2, :g_y => 1799, :g_m =>  3, :g_d =>  6},
             {:era => :kansei, :e_y => 11, :e_m =>  3, :g_y => 1799, :g_m =>  4, :g_d =>  5},
             {:era => :kansei, :e_y => 11, :e_m =>  4, :g_y => 1799, :g_m =>  5, :g_d =>  5},
             {:era => :kansei, :e_y => 11, :e_m =>  5, :g_y => 1799, :g_m =>  6, :g_d =>  4},
             {:era => :kansei, :e_y => 11, :e_m =>  6, :g_y => 1799, :g_m =>  7, :g_d =>  3},
             {:era => :kansei, :e_y => 11, :e_m =>  7, :g_y => 1799, :g_m =>  8, :g_d =>  1},
             {:era => :kansei, :e_y => 11, :e_m =>  8, :g_y => 1799, :g_m =>  8, :g_d => 31},
             {:era => :kansei, :e_y => 11, :e_m =>  9, :g_y => 1799, :g_m =>  9, :g_d => 29},
             {:era => :kansei, :e_y => 11, :e_m => 10, :g_y => 1799, :g_m => 10, :g_d => 29},
             {:era => :kansei, :e_y => 11, :e_m => 11, :g_y => 1799, :g_m => 11, :g_d => 27},
             {:era => :kansei, :e_y => 11, :e_m => 12, :g_y => 1799, :g_m => 12, :g_d => 26},

             {:era => :kansei, :e_y => 12, :e_m =>  1, :g_y => 1800, :g_m =>  1, :g_d => 25},
             {:era => :kansei, :e_y => 12, :e_m =>  2, :g_y => 1800, :g_m =>  2, :g_d => 24},
             {:era => :kansei, :e_y => 12, :e_m =>  3, :g_y => 1800, :g_m =>  3, :g_d => 25},
             {:era => :kansei, :e_y => 12, :e_m =>  4, :g_y => 1800, :g_m =>  4, :g_d => 24},
             {:era => :kansei, :e_y => 12, :e_m =>  4, :g_y => 1800, :g_m =>  5, :g_d => 24, :leap_month => true},
             {:era => :kansei, :e_y => 12, :e_m =>  5, :g_y => 1800, :g_m =>  6, :g_d => 22},
             {:era => :kansei, :e_y => 12, :e_m =>  6, :g_y => 1800, :g_m =>  7, :g_d => 22},
             {:era => :kansei, :e_y => 12, :e_m =>  7, :g_y => 1800, :g_m =>  8, :g_d => 20},
             {:era => :kansei, :e_y => 12, :e_m =>  8, :g_y => 1800, :g_m =>  9, :g_d => 19},
             {:era => :kansei, :e_y => 12, :e_m =>  9, :g_y => 1800, :g_m => 10, :g_d => 18},
             {:era => :kansei, :e_y => 12, :e_m => 10, :g_y => 1800, :g_m => 11, :g_d => 17},
             {:era => :kansei, :e_y => 12, :e_m => 11, :g_y => 1800, :g_m => 12, :g_d => 16},
             {:era => :kansei, :e_y => 12, :e_m => 12, :g_y => 1801, :g_m =>  1, :g_d => 15},

             {:era => :kansei, :e_y => 13, :e_m =>  1, :g_y => 1801, :g_m =>  2, :g_d => 13},
             {:era => :kansei, :e_y => 13, :e_m =>  2, :g_y => 1801, :g_m =>  3, :g_d => 15},
             {:era => :kansei, :e_y => 13, :e_m =>  3, :g_y => 1801, :g_m =>  4, :g_d => 13},
             {:era => :kansei, :e_y => 13, :e_m =>  4, :g_y => 1801, :g_m =>  5, :g_d => 13},
             {:era => :kansei, :e_y => 13, :e_m =>  5, :g_y => 1801, :g_m =>  6, :g_d => 11},
             {:era => :kansei, :e_y => 13, :e_m =>  6, :g_y => 1801, :g_m =>  7, :g_d => 11},
             {:era => :kansei, :e_y => 13, :e_m =>  7, :g_y => 1801, :g_m =>  8, :g_d =>  9},
             {:era => :kansei, :e_y => 13, :e_m =>  8, :g_y => 1801, :g_m =>  9, :g_d =>  8},
             {:era => :kansei, :e_y => 13, :e_m =>  9, :g_y => 1801, :g_m => 10, :g_d =>  8},
             {:era => :kansei, :e_y => 13, :e_m => 10, :g_y => 1801, :g_m => 11, :g_d =>  6},
             {:era => :kansei, :e_y => 13, :e_m => 11, :g_y => 1801, :g_m => 12, :g_d =>  6},
             {:era => :kansei, :e_y => 13, :e_m => 12, :g_y => 1802, :g_m =>  1, :g_d =>  4},

            ]

    add_era_table table
  end # Date
end # Wareki
