# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Keian' # 
    # KANJI_ERA_NAME = '慶安'

    # 慶安
    # http://ja.wikipedia.org/wiki/%E6%85%B6%E5%AE%89
    # | 慶安元年 (戊子)     |       一月 |     閏一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1648/01/25 | 1648/02/24 | 1648/03/24 | 1648/04/23 | 1648/05/23 | 1648/06/21 | 1648/07/20 | 1648/08/19 | 1648/09/17 | 1648/10/17 | 1648/11/15 | 1648/12/15 | 1649/01/13 |
    # | 慶安二年 (己丑)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1649/02/12 | 1649/03/13 | 1649/04/12 | 1649/05/12 | 1649/06/10 | 1649/07/10 | 1649/08/08 | 1649/09/07 | 1649/10/06 | 1649/11/05 | 1649/12/04 | 1650/01/03 |
    # | 慶安三年 (庚寅)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     閏十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1650/02/01 | 1650/03/03 | 1650/04/01 | 1650/05/01 | 1650/05/30 | 1650/06/29 | 1650/07/29 | 1650/08/27 | 1650/09/26 | 1650/10/25 | 1650/11/24 | 1650/12/23 | 1651/01/22 |
    # | 慶安四年 (辛卯)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1651/02/20 | 1651/03/22 | 1651/04/20 | 1651/05/20 | 1651/06/18 | 1651/07/18 | 1651/08/16 | 1651/09/15 | 1651/10/15 | 1651/11/13 | 1651/12/13 | 1652/01/11 |
    # | 慶安五年 (壬辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1652/02/10 | 1652/03/10 | 1652/04/09 | 1652/05/08 | 1652/06/06 | 1652/07/06 | 1652/08/04 | 1652/09/03 | 1652/10/03 | 1652/11/01 | 1652/12/01 | 1652/12/31 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :keian, :e_y =>  1, :e_m =>  1, :g_y => 1648, :g_m =>  1, :g_d => 25},
             {:era => :keian, :e_y =>  1, :e_m =>  1, :g_y => 1648, :g_m =>  2, :g_d => 24, :leap_month => true},
             {:era => :keian, :e_y =>  1, :e_m =>  2, :g_y => 1648, :g_m =>  3, :g_d => 24},
             {:era => :keian, :e_y =>  1, :e_m =>  3, :g_y => 1648, :g_m =>  4, :g_d => 23},
             {:era => :keian, :e_y =>  1, :e_m =>  4, :g_y => 1648, :g_m =>  5, :g_d => 23},
             {:era => :keian, :e_y =>  1, :e_m =>  5, :g_y => 1648, :g_m =>  6, :g_d => 21},
             {:era => :keian, :e_y =>  1, :e_m =>  6, :g_y => 1648, :g_m =>  7, :g_d => 20},
             {:era => :keian, :e_y =>  1, :e_m =>  7, :g_y => 1648, :g_m =>  8, :g_d => 19},
             {:era => :keian, :e_y =>  1, :e_m =>  8, :g_y => 1648, :g_m =>  9, :g_d => 17},
             {:era => :keian, :e_y =>  1, :e_m =>  9, :g_y => 1648, :g_m => 10, :g_d => 17},
             {:era => :keian, :e_y =>  1, :e_m => 10, :g_y => 1648, :g_m => 11, :g_d => 15},
             {:era => :keian, :e_y =>  1, :e_m => 11, :g_y => 1648, :g_m => 12, :g_d => 15},
             {:era => :keian, :e_y =>  1, :e_m => 12, :g_y => 1649, :g_m =>  1, :g_d => 13},

             {:era => :keian, :e_y =>  2, :e_m =>  1, :g_y => 1649, :g_m =>  2, :g_d => 12},
             {:era => :keian, :e_y =>  2, :e_m =>  2, :g_y => 1649, :g_m =>  3, :g_d => 13},
             {:era => :keian, :e_y =>  2, :e_m =>  3, :g_y => 1649, :g_m =>  4, :g_d => 12},
             {:era => :keian, :e_y =>  2, :e_m =>  4, :g_y => 1649, :g_m =>  5, :g_d => 12},
             {:era => :keian, :e_y =>  2, :e_m =>  5, :g_y => 1649, :g_m =>  6, :g_d => 10},
             {:era => :keian, :e_y =>  2, :e_m =>  6, :g_y => 1649, :g_m =>  7, :g_d => 10},
             {:era => :keian, :e_y =>  2, :e_m =>  7, :g_y => 1649, :g_m =>  8, :g_d =>  8},
             {:era => :keian, :e_y =>  2, :e_m =>  8, :g_y => 1649, :g_m =>  9, :g_d =>  7},
             {:era => :keian, :e_y =>  2, :e_m =>  9, :g_y => 1649, :g_m => 10, :g_d =>  6},
             {:era => :keian, :e_y =>  2, :e_m => 10, :g_y => 1649, :g_m => 11, :g_d =>  5},
             {:era => :keian, :e_y =>  2, :e_m => 11, :g_y => 1649, :g_m => 12, :g_d =>  4},
             {:era => :keian, :e_y =>  2, :e_m => 12, :g_y => 1650, :g_m =>  1, :g_d =>  3},

             {:era => :keian, :e_y =>  3, :e_m =>  1, :g_y => 1650, :g_m =>  2, :g_d =>  1},
             {:era => :keian, :e_y =>  3, :e_m =>  2, :g_y => 1650, :g_m =>  3, :g_d =>  3},
             {:era => :keian, :e_y =>  3, :e_m =>  3, :g_y => 1650, :g_m =>  4, :g_d =>  1},
             {:era => :keian, :e_y =>  3, :e_m =>  4, :g_y => 1650, :g_m =>  5, :g_d =>  1},
             {:era => :keian, :e_y =>  3, :e_m =>  5, :g_y => 1650, :g_m =>  5, :g_d => 30},
             {:era => :keian, :e_y =>  3, :e_m =>  6, :g_y => 1650, :g_m =>  6, :g_d => 29},
             {:era => :keian, :e_y =>  3, :e_m =>  7, :g_y => 1650, :g_m =>  7, :g_d => 29},
             {:era => :keian, :e_y =>  3, :e_m =>  8, :g_y => 1650, :g_m =>  8, :g_d => 27},
             {:era => :keian, :e_y =>  3, :e_m =>  9, :g_y => 1650, :g_m =>  9, :g_d => 26},
             {:era => :keian, :e_y =>  3, :e_m => 10, :g_y => 1650, :g_m => 10, :g_d => 25},
             {:era => :keian, :e_y =>  3, :e_m => 10, :g_y => 1650, :g_m => 11, :g_d => 24, :leap_month => true},
             {:era => :keian, :e_y =>  3, :e_m => 11, :g_y => 1650, :g_m => 12, :g_d => 23},
             {:era => :keian, :e_y =>  3, :e_m => 12, :g_y => 1651, :g_m =>  1, :g_d => 22},

             {:era => :keian, :e_y =>  4, :e_m =>  1, :g_y => 1651, :g_m =>  2, :g_d => 20},
             {:era => :keian, :e_y =>  4, :e_m =>  2, :g_y => 1651, :g_m =>  3, :g_d => 22},
             {:era => :keian, :e_y =>  4, :e_m =>  3, :g_y => 1651, :g_m =>  4, :g_d => 20},
             {:era => :keian, :e_y =>  4, :e_m =>  4, :g_y => 1651, :g_m =>  5, :g_d => 20},
             {:era => :keian, :e_y =>  4, :e_m =>  5, :g_y => 1651, :g_m =>  6, :g_d => 18},
             {:era => :keian, :e_y =>  4, :e_m =>  6, :g_y => 1651, :g_m =>  7, :g_d => 18},
             {:era => :keian, :e_y =>  4, :e_m =>  7, :g_y => 1651, :g_m =>  8, :g_d => 16},
             {:era => :keian, :e_y =>  4, :e_m =>  8, :g_y => 1651, :g_m =>  9, :g_d => 15},
             {:era => :keian, :e_y =>  4, :e_m =>  9, :g_y => 1651, :g_m => 10, :g_d => 15},
             {:era => :keian, :e_y =>  4, :e_m => 10, :g_y => 1651, :g_m => 11, :g_d => 13},
             {:era => :keian, :e_y =>  4, :e_m => 11, :g_y => 1651, :g_m => 12, :g_d => 13},
             {:era => :keian, :e_y =>  4, :e_m => 12, :g_y => 1652, :g_m =>  1, :g_d => 11},

             {:era => :keian, :e_y =>  5, :e_m =>  1, :g_y => 1652, :g_m =>  2, :g_d => 10},
             {:era => :keian, :e_y =>  5, :e_m =>  2, :g_y => 1652, :g_m =>  3, :g_d => 10},
             {:era => :keian, :e_y =>  5, :e_m =>  3, :g_y => 1652, :g_m =>  4, :g_d =>  9},
             {:era => :keian, :e_y =>  5, :e_m =>  4, :g_y => 1652, :g_m =>  5, :g_d =>  8},
             {:era => :keian, :e_y =>  5, :e_m =>  5, :g_y => 1652, :g_m =>  6, :g_d =>  6},
             {:era => :keian, :e_y =>  5, :e_m =>  6, :g_y => 1652, :g_m =>  7, :g_d =>  6},
             {:era => :keian, :e_y =>  5, :e_m =>  7, :g_y => 1652, :g_m =>  8, :g_d =>  4},
             {:era => :keian, :e_y =>  5, :e_m =>  8, :g_y => 1652, :g_m =>  9, :g_d =>  3},
             {:era => :keian, :e_y =>  5, :e_m =>  9, :g_y => 1652, :g_m => 10, :g_d =>  3},
             {:era => :keian, :e_y =>  5, :e_m => 10, :g_y => 1652, :g_m => 11, :g_d =>  1},
             {:era => :keian, :e_y =>  5, :e_m => 11, :g_y => 1652, :g_m => 12, :g_d =>  1},
             {:era => :keian, :e_y =>  5, :e_m => 12, :g_y => 1652, :g_m => 12, :g_d => 31},

            ]

    add_era_table table
  end # Date
end # Wareki
