# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Kei%C5%8D' # 
    # KANJI_ERA_NAME = '慶応'

    # 慶応
    # http://ja.wikipedia.org/wiki/%E6%85%B6%E5%BF%9C
    # | 慶応元年 (乙丑)     |       一月 |       二月 |       三月 |       四月 |       五月 |     閏五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1865/01/27 | 1865/02/26 | 1865/03/27 | 1865/04/25 | 1865/05/25 | 1865/06/23 | 1865/07/23 | 1865/08/21 | 1865/09/20 | 1865/10/20 | 1865/11/18 | 1865/12/18 | 1866/01/17 |
    # | 慶応二年 (丙寅)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1866/02/15 | 1866/03/17 | 1866/04/15 | 1866/05/15 | 1866/06/13 | 1866/07/12 | 1866/08/10 | 1866/09/09 | 1866/10/09 | 1866/11/07 | 1866/12/07 | 1867/01/06 |
    # | 慶応三年 (丁卯)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1867/02/05 | 1867/03/06 | 1867/04/05 | 1867/05/04 | 1867/06/03 | 1867/07/02 | 1867/07/31 | 1867/08/29 | 1867/09/28 | 1867/10/27 | 1867/11/26 | 1867/12/26 |
    # | 慶応四年 (戊辰)     |       一月 |       二月 |       三月 |       四月 |     閏四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1868/01/25 | 1868/02/23 | 1868/03/24 | 1868/04/23 | 1868/05/22 | 1868/06/20 | 1868/07/20 | 1868/08/18 | 1868/09/16 | 1868/10/16 | 1868/11/14 | 1868/12/14 | 1869/01/13 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :keio, :e_y =>  1, :e_m =>  1, :g_y => 1865, :g_m =>  1, :g_d => 27},
             {:era => :keio, :e_y =>  1, :e_m =>  2, :g_y => 1865, :g_m =>  2, :g_d => 26},
             {:era => :keio, :e_y =>  1, :e_m =>  3, :g_y => 1865, :g_m =>  3, :g_d => 27},
             {:era => :keio, :e_y =>  1, :e_m =>  4, :g_y => 1865, :g_m =>  4, :g_d => 25},
             {:era => :keio, :e_y =>  1, :e_m =>  5, :g_y => 1865, :g_m =>  5, :g_d => 25},
             {:era => :keio, :e_y =>  1, :e_m =>  5, :g_y => 1865, :g_m =>  6, :g_d => 23, :leap_month => true},
             {:era => :keio, :e_y =>  1, :e_m =>  6, :g_y => 1865, :g_m =>  7, :g_d => 23},
             {:era => :keio, :e_y =>  1, :e_m =>  7, :g_y => 1865, :g_m =>  8, :g_d => 21},
             {:era => :keio, :e_y =>  1, :e_m =>  8, :g_y => 1865, :g_m =>  9, :g_d => 20},
             {:era => :keio, :e_y =>  1, :e_m =>  9, :g_y => 1865, :g_m => 10, :g_d => 20},
             {:era => :keio, :e_y =>  1, :e_m => 10, :g_y => 1865, :g_m => 11, :g_d => 18},
             {:era => :keio, :e_y =>  1, :e_m => 11, :g_y => 1865, :g_m => 12, :g_d => 18},
             {:era => :keio, :e_y =>  1, :e_m => 12, :g_y => 1866, :g_m =>  1, :g_d => 17},

             {:era => :keio, :e_y =>  2, :e_m =>  1, :g_y => 1866, :g_m =>  2, :g_d => 15},
             {:era => :keio, :e_y =>  2, :e_m =>  2, :g_y => 1866, :g_m =>  3, :g_d => 17},
             {:era => :keio, :e_y =>  2, :e_m =>  3, :g_y => 1866, :g_m =>  4, :g_d => 15},
             {:era => :keio, :e_y =>  2, :e_m =>  4, :g_y => 1866, :g_m =>  5, :g_d => 15},
             {:era => :keio, :e_y =>  2, :e_m =>  5, :g_y => 1866, :g_m =>  6, :g_d => 13},
             {:era => :keio, :e_y =>  2, :e_m =>  6, :g_y => 1866, :g_m =>  7, :g_d => 12},
             {:era => :keio, :e_y =>  2, :e_m =>  7, :g_y => 1866, :g_m =>  8, :g_d => 10},
             {:era => :keio, :e_y =>  2, :e_m =>  8, :g_y => 1866, :g_m =>  9, :g_d =>  9},
             {:era => :keio, :e_y =>  2, :e_m =>  9, :g_y => 1866, :g_m => 10, :g_d =>  9},
             {:era => :keio, :e_y =>  2, :e_m => 10, :g_y => 1866, :g_m => 11, :g_d =>  7},
             {:era => :keio, :e_y =>  2, :e_m => 11, :g_y => 1866, :g_m => 12, :g_d =>  7},
             {:era => :keio, :e_y =>  2, :e_m => 12, :g_y => 1867, :g_m =>  1, :g_d =>  6},

             {:era => :keio, :e_y =>  3, :e_m =>  1, :g_y => 1867, :g_m =>  2, :g_d =>  5},
             {:era => :keio, :e_y =>  3, :e_m =>  2, :g_y => 1867, :g_m =>  3, :g_d =>  6},
             {:era => :keio, :e_y =>  3, :e_m =>  3, :g_y => 1867, :g_m =>  4, :g_d =>  5},
             {:era => :keio, :e_y =>  3, :e_m =>  4, :g_y => 1867, :g_m =>  5, :g_d =>  4},
             {:era => :keio, :e_y =>  3, :e_m =>  5, :g_y => 1867, :g_m =>  6, :g_d =>  3},
             {:era => :keio, :e_y =>  3, :e_m =>  6, :g_y => 1867, :g_m =>  7, :g_d =>  2},
             {:era => :keio, :e_y =>  3, :e_m =>  7, :g_y => 1867, :g_m =>  7, :g_d => 31},
             {:era => :keio, :e_y =>  3, :e_m =>  8, :g_y => 1867, :g_m =>  8, :g_d => 29},
             {:era => :keio, :e_y =>  3, :e_m =>  9, :g_y => 1867, :g_m =>  9, :g_d => 28},
             {:era => :keio, :e_y =>  3, :e_m => 10, :g_y => 1867, :g_m => 10, :g_d => 27},
             {:era => :keio, :e_y =>  3, :e_m => 11, :g_y => 1867, :g_m => 11, :g_d => 26},
             {:era => :keio, :e_y =>  3, :e_m => 12, :g_y => 1867, :g_m => 12, :g_d => 26},

             {:era => :keio, :e_y =>  4, :e_m =>  1, :g_y => 1868, :g_m =>  1, :g_d => 25},
             {:era => :keio, :e_y =>  4, :e_m =>  2, :g_y => 1868, :g_m =>  2, :g_d => 23},
             {:era => :keio, :e_y =>  4, :e_m =>  3, :g_y => 1868, :g_m =>  3, :g_d => 24},
             {:era => :keio, :e_y =>  4, :e_m =>  4, :g_y => 1868, :g_m =>  4, :g_d => 23},
             {:era => :keio, :e_y =>  4, :e_m =>  4, :g_y => 1868, :g_m =>  5, :g_d => 22, :leap_month => true},
             {:era => :keio, :e_y =>  4, :e_m =>  5, :g_y => 1868, :g_m =>  6, :g_d => 20},
             {:era => :keio, :e_y =>  4, :e_m =>  6, :g_y => 1868, :g_m =>  7, :g_d => 20},
             {:era => :keio, :e_y =>  4, :e_m =>  7, :g_y => 1868, :g_m =>  8, :g_d => 18},
             {:era => :keio, :e_y =>  4, :e_m =>  8, :g_y => 1868, :g_m =>  9, :g_d => 16},
             {:era => :keio, :e_y =>  4, :e_m =>  9, :g_y => 1868, :g_m => 10, :g_d => 16},
             {:era => :keio, :e_y =>  4, :e_m => 10, :g_y => 1868, :g_m => 11, :g_d => 14},
             {:era => :keio, :e_y =>  4, :e_m => 11, :g_y => 1868, :g_m => 12, :g_d => 14},
             {:era => :keio, :e_y =>  4, :e_m => 12, :g_y => 1869, :g_m =>  1, :g_d => 13},

            ]

    add_era_table table
  end # Date
end # Wareki
