# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'koka' # こうか
    # KANJI_ERA_NAME = '弘化'

    # http://ja.wikipedia.org/wiki/%E5%BC%98%E5%8C%96
    # | 弘化元年（甲辰） | 一月      | 二月 | 三月 | 四月 | 五月 | 六月   | 七月 | 八月 | 九月  | 十月  | 十一月 | 十二月   |           |
    # | グレゴリオ暦     | 1844/2/18 | 3/19 | 4/18 | 5/17 | 6/16 | 7/15   | 8/14 | 9/12 | 10/12 | 11/10 | 12/10  | 1845/1/8 |           |
    # | 弘化二年（乙巳） | 一月      | 二月 | 三月 | 四月 | 五月 | 六月   | 七月 | 八月 | 九月  | 十月  | 十一月 | 十二月   |           |
    # | グレゴリオ暦     | 1845/2/7  | 3/8  | 4/7  | 5/6  | 6/5  | 7/5    | 8/3  | 9/2  | 10/1  | 10/31 | 11/29  | 12/29    |           |
    # | 弘化三年（丙午） | 一月      | 二月 | 三月 | 四月 | 五月 | 閏五月 | 六月 | 七月 | 八月  | 九月  | 十月   | 十一月   | 十二月    |
    # | グレゴリオ暦     | 1846/1/27 | 2/26 | 3/27 | 4/26 | 5/25 | 6/24   | 7/23 | 8/22 | 9/21  | 10/20 | 11/19  | 12/18    | 1847/1/17 |
    # | 弘化四年（丁未） | 一月      | 二月 | 三月 | 四月 | 五月 | 六月   | 七月 | 八月 | 九月  | 十月  | 十一月 | 十二月   |           |
    # | グレゴリオ暦     | 1847/2/15 | 3/17 | 4/15 | 5/15 | 6/13 | 7/12   | 8/11 | 9/10 | 10/9  | 11/8  | 12/8   | 1848/1/6 |           |
    # | 弘化五年（戊申） | 一月      | 二月 | 三月 | 四月 | 五月 | 六月   | 七月 | 八月 | 九月  | 十月  | 十一月 | 十二月   |           |
    # | グレゴリオ暦     | 1848/2/5  | 3/5  | 4/4  | 5/3  | 6/1  | 7/1    | 7/30 | 8/29 | 9/27  | 10/27 | 11/26  | 12/26    |           |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :koka, :e_y => 1, :e_m => 1, :g_y => 1844, :g_m => 2, :g_d => 18},
             {:era => :koka, :e_y => 1, :e_m => 2, :g_y => 1844, :g_m => 3, :g_d => 19},
             {:era => :koka, :e_y => 1, :e_m => 3, :g_y => 1844, :g_m => 4, :g_d => 18},
             {:era => :koka, :e_y => 1, :e_m => 4, :g_y => 1844, :g_m => 5, :g_d => 17},
             {:era => :koka, :e_y => 1, :e_m => 5, :g_y => 1844, :g_m => 6, :g_d => 16},
             {:era => :koka, :e_y => 1, :e_m => 6, :g_y => 1844, :g_m => 7, :g_d => 15},
             {:era => :koka, :e_y => 1, :e_m => 7, :g_y => 1844, :g_m => 8, :g_d => 14},
             {:era => :koka, :e_y => 1, :e_m => 8, :g_y => 1844, :g_m => 9, :g_d => 12},
             {:era => :koka, :e_y => 1, :e_m => 9, :g_y => 1844, :g_m => 10, :g_d => 12},
             {:era => :koka, :e_y => 1, :e_m => 10, :g_y => 1844, :g_m => 11, :g_d => 10},
             {:era => :koka, :e_y => 1, :e_m => 11, :g_y => 1844, :g_m => 12, :g_d => 10},
             {:era => :koka, :e_y => 1, :e_m => 12, :g_y => 1845, :g_m => 1, :g_d => 8},

             {:era => :koka, :e_y => 2, :e_m => 1, :g_y => 1845, :g_m => 2, :g_d => 7},
             {:era => :koka, :e_y => 2, :e_m => 2, :g_y => 1845, :g_m => 3, :g_d => 8},
             {:era => :koka, :e_y => 2, :e_m => 3, :g_y => 1845, :g_m => 4, :g_d => 7},
             {:era => :koka, :e_y => 2, :e_m => 4, :g_y => 1845, :g_m => 5, :g_d => 6},
             {:era => :koka, :e_y => 2, :e_m => 5, :g_y => 1845, :g_m => 6, :g_d => 5},
             {:era => :koka, :e_y => 2, :e_m => 6, :g_y => 1845, :g_m => 7, :g_d => 5},
             {:era => :koka, :e_y => 2, :e_m => 7, :g_y => 1845, :g_m => 8, :g_d => 3},
             {:era => :koka, :e_y => 2, :e_m => 8, :g_y => 1845, :g_m => 9, :g_d => 2},
             {:era => :koka, :e_y => 2, :e_m => 9, :g_y => 1845, :g_m => 10, :g_d => 1},
             {:era => :koka, :e_y => 2, :e_m => 10, :g_y => 1845, :g_m => 10, :g_d => 31},
             {:era => :koka, :e_y => 2, :e_m => 11, :g_y => 1845, :g_m => 11, :g_d => 29},
             {:era => :koka, :e_y => 2, :e_m => 12, :g_y => 1845, :g_m => 12, :g_d => 29},

             {:era => :koka, :e_y => 3, :e_m => 1, :g_y => 1846, :g_m => 1, :g_d => 27},
             {:era => :koka, :e_y => 3, :e_m => 2, :g_y => 1846, :g_m => 2, :g_d => 26},
             {:era => :koka, :e_y => 3, :e_m => 3, :g_y => 1846, :g_m => 3, :g_d => 27},
             {:era => :koka, :e_y => 3, :e_m => 4, :g_y => 1846, :g_m => 4, :g_d => 26},
             {:era => :koka, :e_y => 3, :e_m => 5, :g_y => 1846, :g_m => 5, :g_d => 25},
             {:era => :koka, :e_y => 3, :e_m => 5, :g_y => 1846, :g_m => 6, :g_d => 24, :leap_month => true},
             {:era => :koka, :e_y => 3, :e_m => 6, :g_y => 1846, :g_m => 7, :g_d => 23},
             {:era => :koka, :e_y => 3, :e_m => 7, :g_y => 1846, :g_m => 8, :g_d => 22},
             {:era => :koka, :e_y => 3, :e_m => 8, :g_y => 1846, :g_m => 9, :g_d => 21},
             {:era => :koka, :e_y => 3, :e_m => 9,  :g_y => 1846, :g_m => 10, :g_d => 20},
             {:era => :koka, :e_y => 3, :e_m => 10, :g_y => 1846, :g_m => 11, :g_d => 19},
             {:era => :koka, :e_y => 3, :e_m => 11, :g_y => 1846, :g_m => 12, :g_d => 18},
             {:era => :koka, :e_y => 3, :e_m => 12, :g_y => 1847, :g_m => 1, :g_d => 17},

             {:era => :koka, :e_y => 4, :e_m => 1, :g_y => 1847, :g_m => 2, :g_d => 15},
             {:era => :koka, :e_y => 4, :e_m => 2, :g_y => 1847, :g_m => 3, :g_d => 17},
             {:era => :koka, :e_y => 4, :e_m => 3, :g_y => 1847, :g_m => 4, :g_d => 15},
             {:era => :koka, :e_y => 4, :e_m => 4, :g_y => 1847, :g_m => 5, :g_d => 15},
             {:era => :koka, :e_y => 4, :e_m => 5, :g_y => 1847, :g_m => 6, :g_d => 13},
             {:era => :koka, :e_y => 4, :e_m => 6, :g_y => 1847, :g_m => 7, :g_d => 12},
             {:era => :koka, :e_y => 4, :e_m => 7, :g_y => 1847, :g_m => 8, :g_d => 11},
             {:era => :koka, :e_y => 4, :e_m => 8, :g_y => 1847, :g_m => 9, :g_d => 10},
             {:era => :koka, :e_y => 4, :e_m => 9, :g_y => 1847, :g_m => 10, :g_d => 9},
             {:era => :koka, :e_y => 4, :e_m => 10, :g_y => 1847, :g_m => 11, :g_d => 8},
             {:era => :koka, :e_y => 4, :e_m => 11, :g_y => 1847, :g_m => 12, :g_d => 8},
             {:era => :koka, :e_y => 4, :e_m => 12, :g_y => 1848, :g_m => 1, :g_d => 6},

             {:era => :koka, :e_y => 5, :e_m => 1, :g_y => 1848, :g_m => 2, :g_d => 5},
             {:era => :koka, :e_y => 5, :e_m => 2, :g_y => 1848, :g_m => 3, :g_d => 5},
             {:era => :koka, :e_y => 5, :e_m => 3, :g_y => 1848, :g_m => 4, :g_d => 4},
             {:era => :koka, :e_y => 5, :e_m => 4, :g_y => 1848, :g_m => 5, :g_d => 3},
             {:era => :koka, :e_y => 5, :e_m => 5, :g_y => 1848, :g_m => 6, :g_d => 1},
             {:era => :koka, :e_y => 5, :e_m => 6, :g_y => 1848, :g_m => 7, :g_d => 1},
             {:era => :koka, :e_y => 5, :e_m => 7, :g_y => 1848, :g_m => 7, :g_d => 30},
             {:era => :koka, :e_y => 5, :e_m => 8, :g_y => 1848, :g_m => 8, :g_d => 29},
             {:era => :koka, :e_y => 5, :e_m => 9, :g_y => 1848, :g_m => 9, :g_d => 27},
             {:era => :koka, :e_y => 5, :e_m => 10, :g_y => 1848, :g_m => 10, :g_d => 27},
             {:era => :koka, :e_y => 5, :e_m => 11, :g_y => 1848, :g_m => 11, :g_d => 26},
             {:era => :koka, :e_y => 5, :e_m => 12, :g_y => 1848, :g_m => 12, :g_d => 26},
            ]
    add_era_table table
  end # Date
end # Wareki
