# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Ky%C5%8Dwa' # 
    # KANJI_ERA_NAME = '享和'

    # 享和
    # http://ja.wikipedia.org/wiki/%E4%BA%AB%E5%92%8C
    # | 享和元年 (辛酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1801/02/13 | 1801/03/15 | 1801/04/13 | 1801/05/13 | 1801/06/11 | 1801/07/11 | 1801/08/09 | 1801/09/08 | 1801/10/08 | 1801/11/06 | 1801/12/06 | 1802/01/04 |
    # | 享和二年 (壬戌)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1802/02/03 | 1802/03/04 | 1802/04/03 | 1802/05/02 | 1802/05/31 | 1802/06/30 | 1802/07/29 | 1802/08/28 | 1802/09/27 | 1802/10/27 | 1802/11/25 | 1802/12/25 |
    # | 享和三年 (癸亥)     |       一月 |     閏一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1803/01/23 | 1803/02/22 | 1803/03/23 | 1803/04/22 | 1803/05/21 | 1803/06/19 | 1803/07/19 | 1803/08/17 | 1803/09/16 | 1803/10/16 | 1803/11/14 | 1803/12/14 | 1804/01/13 |
    # | 享和四年 (甲子)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1804/02/11 | 1804/03/12 | 1804/04/10 | 1804/05/10 | 1804/06/08 | 1804/07/07 | 1804/08/06 | 1804/09/04 | 1804/10/04 | 1804/11/02 | 1804/12/02 | 1805/01/01 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :kyowa, :e_y =>  1, :e_m =>  1, :g_y => 1801, :g_m =>  2, :g_d => 13},
             {:era => :kyowa, :e_y =>  1, :e_m =>  2, :g_y => 1801, :g_m =>  3, :g_d => 15},
             {:era => :kyowa, :e_y =>  1, :e_m =>  3, :g_y => 1801, :g_m =>  4, :g_d => 13},
             {:era => :kyowa, :e_y =>  1, :e_m =>  4, :g_y => 1801, :g_m =>  5, :g_d => 13},
             {:era => :kyowa, :e_y =>  1, :e_m =>  5, :g_y => 1801, :g_m =>  6, :g_d => 11},
             {:era => :kyowa, :e_y =>  1, :e_m =>  6, :g_y => 1801, :g_m =>  7, :g_d => 11},
             {:era => :kyowa, :e_y =>  1, :e_m =>  7, :g_y => 1801, :g_m =>  8, :g_d =>  9},
             {:era => :kyowa, :e_y =>  1, :e_m =>  8, :g_y => 1801, :g_m =>  9, :g_d =>  8},
             {:era => :kyowa, :e_y =>  1, :e_m =>  9, :g_y => 1801, :g_m => 10, :g_d =>  8},
             {:era => :kyowa, :e_y =>  1, :e_m => 10, :g_y => 1801, :g_m => 11, :g_d =>  6},
             {:era => :kyowa, :e_y =>  1, :e_m => 11, :g_y => 1801, :g_m => 12, :g_d =>  6},
             {:era => :kyowa, :e_y =>  1, :e_m => 12, :g_y => 1802, :g_m =>  1, :g_d =>  4},

             {:era => :kyowa, :e_y =>  2, :e_m =>  1, :g_y => 1802, :g_m =>  2, :g_d =>  3},
             {:era => :kyowa, :e_y =>  2, :e_m =>  2, :g_y => 1802, :g_m =>  3, :g_d =>  4},
             {:era => :kyowa, :e_y =>  2, :e_m =>  3, :g_y => 1802, :g_m =>  4, :g_d =>  3},
             {:era => :kyowa, :e_y =>  2, :e_m =>  4, :g_y => 1802, :g_m =>  5, :g_d =>  2},
             {:era => :kyowa, :e_y =>  2, :e_m =>  5, :g_y => 1802, :g_m =>  5, :g_d => 31},
             {:era => :kyowa, :e_y =>  2, :e_m =>  6, :g_y => 1802, :g_m =>  6, :g_d => 30},
             {:era => :kyowa, :e_y =>  2, :e_m =>  7, :g_y => 1802, :g_m =>  7, :g_d => 29},
             {:era => :kyowa, :e_y =>  2, :e_m =>  8, :g_y => 1802, :g_m =>  8, :g_d => 28},
             {:era => :kyowa, :e_y =>  2, :e_m =>  9, :g_y => 1802, :g_m =>  9, :g_d => 27},
             {:era => :kyowa, :e_y =>  2, :e_m => 10, :g_y => 1802, :g_m => 10, :g_d => 27},
             {:era => :kyowa, :e_y =>  2, :e_m => 11, :g_y => 1802, :g_m => 11, :g_d => 25},
             {:era => :kyowa, :e_y =>  2, :e_m => 12, :g_y => 1802, :g_m => 12, :g_d => 25},

             {:era => :kyowa, :e_y =>  3, :e_m =>  1, :g_y => 1803, :g_m =>  1, :g_d => 23},
             {:era => :kyowa, :e_y =>  3, :e_m =>  1, :g_y => 1803, :g_m =>  2, :g_d => 22, :leap_month => true},
             {:era => :kyowa, :e_y =>  3, :e_m =>  2, :g_y => 1803, :g_m =>  3, :g_d => 23},
             {:era => :kyowa, :e_y =>  3, :e_m =>  3, :g_y => 1803, :g_m =>  4, :g_d => 22},
             {:era => :kyowa, :e_y =>  3, :e_m =>  4, :g_y => 1803, :g_m =>  5, :g_d => 21},
             {:era => :kyowa, :e_y =>  3, :e_m =>  5, :g_y => 1803, :g_m =>  6, :g_d => 19},
             {:era => :kyowa, :e_y =>  3, :e_m =>  6, :g_y => 1803, :g_m =>  7, :g_d => 19},
             {:era => :kyowa, :e_y =>  3, :e_m =>  7, :g_y => 1803, :g_m =>  8, :g_d => 17},
             {:era => :kyowa, :e_y =>  3, :e_m =>  8, :g_y => 1803, :g_m =>  9, :g_d => 16},
             {:era => :kyowa, :e_y =>  3, :e_m =>  9, :g_y => 1803, :g_m => 10, :g_d => 16},
             {:era => :kyowa, :e_y =>  3, :e_m => 10, :g_y => 1803, :g_m => 11, :g_d => 14},
             {:era => :kyowa, :e_y =>  3, :e_m => 11, :g_y => 1803, :g_m => 12, :g_d => 14},
             {:era => :kyowa, :e_y =>  3, :e_m => 12, :g_y => 1804, :g_m =>  1, :g_d => 13},

             {:era => :kyowa, :e_y =>  4, :e_m =>  1, :g_y => 1804, :g_m =>  2, :g_d => 11},
             {:era => :kyowa, :e_y =>  4, :e_m =>  2, :g_y => 1804, :g_m =>  3, :g_d => 12},
             {:era => :kyowa, :e_y =>  4, :e_m =>  3, :g_y => 1804, :g_m =>  4, :g_d => 10},
             {:era => :kyowa, :e_y =>  4, :e_m =>  4, :g_y => 1804, :g_m =>  5, :g_d => 10},
             {:era => :kyowa, :e_y =>  4, :e_m =>  5, :g_y => 1804, :g_m =>  6, :g_d =>  8},
             {:era => :kyowa, :e_y =>  4, :e_m =>  6, :g_y => 1804, :g_m =>  7, :g_d =>  7},
             {:era => :kyowa, :e_y =>  4, :e_m =>  7, :g_y => 1804, :g_m =>  8, :g_d =>  6},
             {:era => :kyowa, :e_y =>  4, :e_m =>  8, :g_y => 1804, :g_m =>  9, :g_d =>  4},
             {:era => :kyowa, :e_y =>  4, :e_m =>  9, :g_y => 1804, :g_m => 10, :g_d =>  4},
             {:era => :kyowa, :e_y =>  4, :e_m => 10, :g_y => 1804, :g_m => 11, :g_d =>  2},
             {:era => :kyowa, :e_y =>  4, :e_m => 11, :g_y => 1804, :g_m => 12, :g_d =>  2},
             {:era => :kyowa, :e_y =>  4, :e_m => 12, :g_y => 1805, :g_m =>  1, :g_d =>  1},

            ]

    add_era_table table
  end # Date
end # Wareki
