# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Manji_(era)' # 
    # KANJI_ERA_NAME = '万治'

    # 万治
    # http://ja.wikipedia.org/wiki/%E4%B8%87%E6%B2%BB
    # | 万治元年 (戊戌)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |   閏十二月 |
    # |        グレゴリオ暦 | 1658/02/03 | 1658/03/04 | 1658/04/03 | 1658/05/03 | 1658/06/01 | 1658/07/01 | 1658/07/30 | 1658/08/29 | 1658/09/27 | 1658/10/27 | 1658/11/25 | 1658/12/24 | 1659/01/23 |
    # | 万治二年 (己亥)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1659/02/22 | 1659/03/23 | 1659/04/22 | 1659/05/21 | 1659/06/20 | 1659/07/20 | 1659/08/18 | 1659/09/17 | 1659/10/16 | 1659/11/15 | 1659/12/14 | 1660/01/13 |
    # | 万治三年 (庚子)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1660/02/11 | 1660/03/12 | 1660/04/10 | 1660/05/09 | 1660/06/08 | 1660/07/08 | 1660/08/06 | 1660/09/05 | 1660/10/05 | 1660/11/03 | 1660/12/03 | 1661/01/01 |
    # | 万治四年 (辛丑)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |     閏八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1661/01/31 | 1661/03/01 | 1661/03/31 | 1661/04/29 | 1661/05/28 | 1661/06/27 | 1661/07/26 | 1661/08/25 | 1661/09/24 | 1661/10/23 | 1661/11/22 | 1661/12/22 | 1662/01/20 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :manji, :e_y =>  1, :e_m =>  1, :g_y => 1658, :g_m =>  2, :g_d =>  3},
             {:era => :manji, :e_y =>  1, :e_m =>  2, :g_y => 1658, :g_m =>  3, :g_d =>  4},
             {:era => :manji, :e_y =>  1, :e_m =>  3, :g_y => 1658, :g_m =>  4, :g_d =>  3},
             {:era => :manji, :e_y =>  1, :e_m =>  4, :g_y => 1658, :g_m =>  5, :g_d =>  3},
             {:era => :manji, :e_y =>  1, :e_m =>  5, :g_y => 1658, :g_m =>  6, :g_d =>  1},
             {:era => :manji, :e_y =>  1, :e_m =>  6, :g_y => 1658, :g_m =>  7, :g_d =>  1},
             {:era => :manji, :e_y =>  1, :e_m =>  7, :g_y => 1658, :g_m =>  7, :g_d => 30},
             {:era => :manji, :e_y =>  1, :e_m =>  8, :g_y => 1658, :g_m =>  8, :g_d => 29},
             {:era => :manji, :e_y =>  1, :e_m =>  9, :g_y => 1658, :g_m =>  9, :g_d => 27},
             {:era => :manji, :e_y =>  1, :e_m => 10, :g_y => 1658, :g_m => 10, :g_d => 27},
             {:era => :manji, :e_y =>  1, :e_m => 11, :g_y => 1658, :g_m => 11, :g_d => 25},
             {:era => :manji, :e_y =>  1, :e_m => 12, :g_y => 1658, :g_m => 12, :g_d => 24},
             {:era => :manji, :e_y =>  1, :e_m => 12, :g_y => 1659, :g_m =>  1, :g_d => 23, :leap_month => true},

             {:era => :manji, :e_y =>  2, :e_m =>  1, :g_y => 1659, :g_m =>  2, :g_d => 22},
             {:era => :manji, :e_y =>  2, :e_m =>  2, :g_y => 1659, :g_m =>  3, :g_d => 23},
             {:era => :manji, :e_y =>  2, :e_m =>  3, :g_y => 1659, :g_m =>  4, :g_d => 22},
             {:era => :manji, :e_y =>  2, :e_m =>  4, :g_y => 1659, :g_m =>  5, :g_d => 21},
             {:era => :manji, :e_y =>  2, :e_m =>  5, :g_y => 1659, :g_m =>  6, :g_d => 20},
             {:era => :manji, :e_y =>  2, :e_m =>  6, :g_y => 1659, :g_m =>  7, :g_d => 20},
             {:era => :manji, :e_y =>  2, :e_m =>  7, :g_y => 1659, :g_m =>  8, :g_d => 18},
             {:era => :manji, :e_y =>  2, :e_m =>  8, :g_y => 1659, :g_m =>  9, :g_d => 17},
             {:era => :manji, :e_y =>  2, :e_m =>  9, :g_y => 1659, :g_m => 10, :g_d => 16},
             {:era => :manji, :e_y =>  2, :e_m => 10, :g_y => 1659, :g_m => 11, :g_d => 15},
             {:era => :manji, :e_y =>  2, :e_m => 11, :g_y => 1659, :g_m => 12, :g_d => 14},
             {:era => :manji, :e_y =>  2, :e_m => 12, :g_y => 1660, :g_m =>  1, :g_d => 13},

             {:era => :manji, :e_y =>  3, :e_m =>  1, :g_y => 1660, :g_m =>  2, :g_d => 11},
             {:era => :manji, :e_y =>  3, :e_m =>  2, :g_y => 1660, :g_m =>  3, :g_d => 12},
             {:era => :manji, :e_y =>  3, :e_m =>  3, :g_y => 1660, :g_m =>  4, :g_d => 10},
             {:era => :manji, :e_y =>  3, :e_m =>  4, :g_y => 1660, :g_m =>  5, :g_d =>  9},
             {:era => :manji, :e_y =>  3, :e_m =>  5, :g_y => 1660, :g_m =>  6, :g_d =>  8},
             {:era => :manji, :e_y =>  3, :e_m =>  6, :g_y => 1660, :g_m =>  7, :g_d =>  8},
             {:era => :manji, :e_y =>  3, :e_m =>  7, :g_y => 1660, :g_m =>  8, :g_d =>  6},
             {:era => :manji, :e_y =>  3, :e_m =>  8, :g_y => 1660, :g_m =>  9, :g_d =>  5},
             {:era => :manji, :e_y =>  3, :e_m =>  9, :g_y => 1660, :g_m => 10, :g_d =>  5},
             {:era => :manji, :e_y =>  3, :e_m => 10, :g_y => 1660, :g_m => 11, :g_d =>  3},
             {:era => :manji, :e_y =>  3, :e_m => 11, :g_y => 1660, :g_m => 12, :g_d =>  3},
             {:era => :manji, :e_y =>  3, :e_m => 12, :g_y => 1661, :g_m =>  1, :g_d =>  1},

             {:era => :manji, :e_y =>  4, :e_m =>  1, :g_y => 1661, :g_m =>  1, :g_d => 31},
             {:era => :manji, :e_y =>  4, :e_m =>  2, :g_y => 1661, :g_m =>  3, :g_d =>  1},
             {:era => :manji, :e_y =>  4, :e_m =>  3, :g_y => 1661, :g_m =>  3, :g_d => 31},
             {:era => :manji, :e_y =>  4, :e_m =>  4, :g_y => 1661, :g_m =>  4, :g_d => 29},
             {:era => :manji, :e_y =>  4, :e_m =>  5, :g_y => 1661, :g_m =>  5, :g_d => 28},
             {:era => :manji, :e_y =>  4, :e_m =>  6, :g_y => 1661, :g_m =>  6, :g_d => 27},
             {:era => :manji, :e_y =>  4, :e_m =>  7, :g_y => 1661, :g_m =>  7, :g_d => 26},
             {:era => :manji, :e_y =>  4, :e_m =>  8, :g_y => 1661, :g_m =>  8, :g_d => 25},
             {:era => :manji, :e_y =>  4, :e_m =>  8, :g_y => 1661, :g_m =>  9, :g_d => 24, :leap_month => true},
             {:era => :manji, :e_y =>  4, :e_m =>  9, :g_y => 1661, :g_m => 10, :g_d => 23},
             {:era => :manji, :e_y =>  4, :e_m => 10, :g_y => 1661, :g_m => 11, :g_d => 22},
             {:era => :manji, :e_y =>  4, :e_m => 11, :g_y => 1661, :g_m => 12, :g_d => 22},
             {:era => :manji, :e_y =>  4, :e_m => 12, :g_y => 1662, :g_m =>  1, :g_d => 20},

            ]

    add_era_table table
  end # Date
end # Wareki
