# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Meireki' # 
    # KANJI_ERA_NAME = '明暦'

    # 明暦
    # http://ja.wikipedia.org/wiki/%E6%98%8E%E6%9A%A6
    # | 明暦元年 (乙未)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1655/02/07 | 1655/03/08 | 1655/04/07 | 1655/05/06 | 1655/06/05 | 1655/07/04 | 1655/08/02 | 1655/08/31 | 1655/09/30 | 1655/10/29 | 1655/11/28 | 1655/12/28 |
    # | 明暦二年 (丙申)     |       一月 |       二月 |       三月 |       四月 |     閏四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1656/01/27 | 1656/02/25 | 1656/03/26 | 1656/04/25 | 1656/05/24 | 1656/06/23 | 1656/07/22 | 1656/08/20 | 1656/09/18 | 1656/10/18 | 1656/11/16 | 1656/12/16 | 1657/01/15 |
    # | 明暦三年 (丁酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1657/02/13 | 1657/03/15 | 1657/04/14 | 1657/05/14 | 1657/06/12 | 1657/07/11 | 1657/08/10 | 1657/09/08 | 1657/10/08 | 1657/11/06 | 1657/12/05 | 1658/01/04 |
    # | 明暦四年 (戊戌)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |   閏十二月 |
    # |        グレゴリオ暦 | 1658/02/03 | 1658/03/04 | 1658/04/03 | 1658/05/03 | 1658/06/01 | 1658/07/01 | 1658/07/30 | 1658/08/29 | 1658/09/27 | 1658/10/27 | 1658/11/25 | 1658/12/24 | 1659/01/23 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :meireki, :e_y =>  1, :e_m =>  1, :g_y => 1655, :g_m =>  2, :g_d =>  7},
             {:era => :meireki, :e_y =>  1, :e_m =>  2, :g_y => 1655, :g_m =>  3, :g_d =>  8},
             {:era => :meireki, :e_y =>  1, :e_m =>  3, :g_y => 1655, :g_m =>  4, :g_d =>  7},
             {:era => :meireki, :e_y =>  1, :e_m =>  4, :g_y => 1655, :g_m =>  5, :g_d =>  6},
             {:era => :meireki, :e_y =>  1, :e_m =>  5, :g_y => 1655, :g_m =>  6, :g_d =>  5},
             {:era => :meireki, :e_y =>  1, :e_m =>  6, :g_y => 1655, :g_m =>  7, :g_d =>  4},
             {:era => :meireki, :e_y =>  1, :e_m =>  7, :g_y => 1655, :g_m =>  8, :g_d =>  2},
             {:era => :meireki, :e_y =>  1, :e_m =>  8, :g_y => 1655, :g_m =>  8, :g_d => 31},
             {:era => :meireki, :e_y =>  1, :e_m =>  9, :g_y => 1655, :g_m =>  9, :g_d => 30},
             {:era => :meireki, :e_y =>  1, :e_m => 10, :g_y => 1655, :g_m => 10, :g_d => 29},
             {:era => :meireki, :e_y =>  1, :e_m => 11, :g_y => 1655, :g_m => 11, :g_d => 28},
             {:era => :meireki, :e_y =>  1, :e_m => 12, :g_y => 1655, :g_m => 12, :g_d => 28},

             {:era => :meireki, :e_y =>  2, :e_m =>  1, :g_y => 1656, :g_m =>  1, :g_d => 27},
             {:era => :meireki, :e_y =>  2, :e_m =>  2, :g_y => 1656, :g_m =>  2, :g_d => 25},
             {:era => :meireki, :e_y =>  2, :e_m =>  3, :g_y => 1656, :g_m =>  3, :g_d => 26},
             {:era => :meireki, :e_y =>  2, :e_m =>  4, :g_y => 1656, :g_m =>  4, :g_d => 25},
             {:era => :meireki, :e_y =>  2, :e_m =>  4, :g_y => 1656, :g_m =>  5, :g_d => 24, :leap_month => true},
             {:era => :meireki, :e_y =>  2, :e_m =>  5, :g_y => 1656, :g_m =>  6, :g_d => 23},
             {:era => :meireki, :e_y =>  2, :e_m =>  6, :g_y => 1656, :g_m =>  7, :g_d => 22},
             {:era => :meireki, :e_y =>  2, :e_m =>  7, :g_y => 1656, :g_m =>  8, :g_d => 20},
             {:era => :meireki, :e_y =>  2, :e_m =>  8, :g_y => 1656, :g_m =>  9, :g_d => 18},
             {:era => :meireki, :e_y =>  2, :e_m =>  9, :g_y => 1656, :g_m => 10, :g_d => 18},
             {:era => :meireki, :e_y =>  2, :e_m => 10, :g_y => 1656, :g_m => 11, :g_d => 16},
             {:era => :meireki, :e_y =>  2, :e_m => 11, :g_y => 1656, :g_m => 12, :g_d => 16},
             {:era => :meireki, :e_y =>  2, :e_m => 12, :g_y => 1657, :g_m =>  1, :g_d => 15},

             {:era => :meireki, :e_y =>  3, :e_m =>  1, :g_y => 1657, :g_m =>  2, :g_d => 13},
             {:era => :meireki, :e_y =>  3, :e_m =>  2, :g_y => 1657, :g_m =>  3, :g_d => 15},
             {:era => :meireki, :e_y =>  3, :e_m =>  3, :g_y => 1657, :g_m =>  4, :g_d => 14},
             {:era => :meireki, :e_y =>  3, :e_m =>  4, :g_y => 1657, :g_m =>  5, :g_d => 14},
             {:era => :meireki, :e_y =>  3, :e_m =>  5, :g_y => 1657, :g_m =>  6, :g_d => 12},
             {:era => :meireki, :e_y =>  3, :e_m =>  6, :g_y => 1657, :g_m =>  7, :g_d => 11},
             {:era => :meireki, :e_y =>  3, :e_m =>  7, :g_y => 1657, :g_m =>  8, :g_d => 10},
             {:era => :meireki, :e_y =>  3, :e_m =>  8, :g_y => 1657, :g_m =>  9, :g_d =>  8},
             {:era => :meireki, :e_y =>  3, :e_m =>  9, :g_y => 1657, :g_m => 10, :g_d =>  8},
             {:era => :meireki, :e_y =>  3, :e_m => 10, :g_y => 1657, :g_m => 11, :g_d =>  6},
             {:era => :meireki, :e_y =>  3, :e_m => 11, :g_y => 1657, :g_m => 12, :g_d =>  5},
             {:era => :meireki, :e_y =>  3, :e_m => 12, :g_y => 1658, :g_m =>  1, :g_d =>  4},

             {:era => :meireki, :e_y =>  4, :e_m =>  1, :g_y => 1658, :g_m =>  2, :g_d =>  3},
             {:era => :meireki, :e_y =>  4, :e_m =>  2, :g_y => 1658, :g_m =>  3, :g_d =>  4},
             {:era => :meireki, :e_y =>  4, :e_m =>  3, :g_y => 1658, :g_m =>  4, :g_d =>  3},
             {:era => :meireki, :e_y =>  4, :e_m =>  4, :g_y => 1658, :g_m =>  5, :g_d =>  3},
             {:era => :meireki, :e_y =>  4, :e_m =>  5, :g_y => 1658, :g_m =>  6, :g_d =>  1},
             {:era => :meireki, :e_y =>  4, :e_m =>  6, :g_y => 1658, :g_m =>  7, :g_d =>  1},
             {:era => :meireki, :e_y =>  4, :e_m =>  7, :g_y => 1658, :g_m =>  7, :g_d => 30},
             {:era => :meireki, :e_y =>  4, :e_m =>  8, :g_y => 1658, :g_m =>  8, :g_d => 29},
             {:era => :meireki, :e_y =>  4, :e_m =>  9, :g_y => 1658, :g_m =>  9, :g_d => 27},
             {:era => :meireki, :e_y =>  4, :e_m => 10, :g_y => 1658, :g_m => 10, :g_d => 27},
             {:era => :meireki, :e_y =>  4, :e_m => 11, :g_y => 1658, :g_m => 11, :g_d => 25},
             {:era => :meireki, :e_y =>  4, :e_m => 12, :g_y => 1658, :g_m => 12, :g_d => 24},
             {:era => :meireki, :e_y =>  4, :e_m => 12, :g_y => 1659, :g_m =>  1, :g_d => 23, :leap_month => true},

            ]

    add_era_table table
  end # Date
end # Wareki
