# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Sh%C5%8Dh%C5%8D' # 
    # KANJI_ERA_NAME = '正保'

    # 正保
    # http://ja.wikipedia.org/wiki/%E6%AD%A3%E4%BF%9D
    # | 正保元年 (甲申)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1644/02/08 | 1644/03/09 | 1644/04/07 | 1644/05/07 | 1644/06/05 | 1644/07/04 | 1644/08/03 | 1644/09/01 | 1644/10/01 | 1644/10/31 | 1644/11/30 | 1644/12/29 |
    # | 正保二年 (乙酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |     閏五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1645/01/28 | 1645/02/26 | 1645/03/28 | 1645/04/26 | 1645/05/26 | 1645/06/24 | 1645/07/23 | 1645/08/22 | 1645/09/20 | 1645/10/20 | 1645/11/19 | 1645/12/18 | 1646/01/17 |
    # | 正保三年 (丙戌)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1646/02/16 | 1646/03/17 | 1646/04/16 | 1646/05/15 | 1646/06/14 | 1646/07/13 | 1646/08/11 | 1646/09/10 | 1646/10/09 | 1646/11/08 | 1646/12/07 | 1647/01/06 |
    # | 正保四年 (丁亥)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1647/02/05 | 1647/03/07 | 1647/04/05 | 1647/05/05 | 1647/06/03 | 1647/07/03 | 1647/08/01 | 1647/08/30 | 1647/09/28 | 1647/10/28 | 1647/11/27 | 1647/12/26 |
    # | 正保五年 (戊子)     |       一月 |     閏一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1648/01/25 | 1648/02/24 | 1648/03/24 | 1648/04/23 | 1648/05/23 | 1648/06/21 | 1648/07/20 | 1648/08/19 | 1648/09/17 | 1648/10/17 | 1648/11/15 | 1648/12/15 | 1649/01/13 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :shoho, :e_y =>  1, :e_m =>  1, :g_y => 1644, :g_m =>  2, :g_d =>  8},
             {:era => :shoho, :e_y =>  1, :e_m =>  2, :g_y => 1644, :g_m =>  3, :g_d =>  9},
             {:era => :shoho, :e_y =>  1, :e_m =>  3, :g_y => 1644, :g_m =>  4, :g_d =>  7},
             {:era => :shoho, :e_y =>  1, :e_m =>  4, :g_y => 1644, :g_m =>  5, :g_d =>  7},
             {:era => :shoho, :e_y =>  1, :e_m =>  5, :g_y => 1644, :g_m =>  6, :g_d =>  5},
             {:era => :shoho, :e_y =>  1, :e_m =>  6, :g_y => 1644, :g_m =>  7, :g_d =>  4},
             {:era => :shoho, :e_y =>  1, :e_m =>  7, :g_y => 1644, :g_m =>  8, :g_d =>  3},
             {:era => :shoho, :e_y =>  1, :e_m =>  8, :g_y => 1644, :g_m =>  9, :g_d =>  1},
             {:era => :shoho, :e_y =>  1, :e_m =>  9, :g_y => 1644, :g_m => 10, :g_d =>  1},
             {:era => :shoho, :e_y =>  1, :e_m => 10, :g_y => 1644, :g_m => 10, :g_d => 31},
             {:era => :shoho, :e_y =>  1, :e_m => 11, :g_y => 1644, :g_m => 11, :g_d => 30},
             {:era => :shoho, :e_y =>  1, :e_m => 12, :g_y => 1644, :g_m => 12, :g_d => 29},

             {:era => :shoho, :e_y =>  2, :e_m =>  1, :g_y => 1645, :g_m =>  1, :g_d => 28},
             {:era => :shoho, :e_y =>  2, :e_m =>  2, :g_y => 1645, :g_m =>  2, :g_d => 26},
             {:era => :shoho, :e_y =>  2, :e_m =>  3, :g_y => 1645, :g_m =>  3, :g_d => 28},
             {:era => :shoho, :e_y =>  2, :e_m =>  4, :g_y => 1645, :g_m =>  4, :g_d => 26},
             {:era => :shoho, :e_y =>  2, :e_m =>  5, :g_y => 1645, :g_m =>  5, :g_d => 26},
             {:era => :shoho, :e_y =>  2, :e_m =>  5, :g_y => 1645, :g_m =>  6, :g_d => 24, :leap_month => true},
             {:era => :shoho, :e_y =>  2, :e_m =>  6, :g_y => 1645, :g_m =>  7, :g_d => 23},
             {:era => :shoho, :e_y =>  2, :e_m =>  7, :g_y => 1645, :g_m =>  8, :g_d => 22},
             {:era => :shoho, :e_y =>  2, :e_m =>  8, :g_y => 1645, :g_m =>  9, :g_d => 20},
             {:era => :shoho, :e_y =>  2, :e_m =>  9, :g_y => 1645, :g_m => 10, :g_d => 20},
             {:era => :shoho, :e_y =>  2, :e_m => 10, :g_y => 1645, :g_m => 11, :g_d => 19},
             {:era => :shoho, :e_y =>  2, :e_m => 11, :g_y => 1645, :g_m => 12, :g_d => 18},
             {:era => :shoho, :e_y =>  2, :e_m => 12, :g_y => 1646, :g_m =>  1, :g_d => 17},

             {:era => :shoho, :e_y =>  3, :e_m =>  1, :g_y => 1646, :g_m =>  2, :g_d => 16},
             {:era => :shoho, :e_y =>  3, :e_m =>  2, :g_y => 1646, :g_m =>  3, :g_d => 17},
             {:era => :shoho, :e_y =>  3, :e_m =>  3, :g_y => 1646, :g_m =>  4, :g_d => 16},
             {:era => :shoho, :e_y =>  3, :e_m =>  4, :g_y => 1646, :g_m =>  5, :g_d => 15},
             {:era => :shoho, :e_y =>  3, :e_m =>  5, :g_y => 1646, :g_m =>  6, :g_d => 14},
             {:era => :shoho, :e_y =>  3, :e_m =>  6, :g_y => 1646, :g_m =>  7, :g_d => 13},
             {:era => :shoho, :e_y =>  3, :e_m =>  7, :g_y => 1646, :g_m =>  8, :g_d => 11},
             {:era => :shoho, :e_y =>  3, :e_m =>  8, :g_y => 1646, :g_m =>  9, :g_d => 10},
             {:era => :shoho, :e_y =>  3, :e_m =>  9, :g_y => 1646, :g_m => 10, :g_d =>  9},
             {:era => :shoho, :e_y =>  3, :e_m => 10, :g_y => 1646, :g_m => 11, :g_d =>  8},
             {:era => :shoho, :e_y =>  3, :e_m => 11, :g_y => 1646, :g_m => 12, :g_d =>  7},
             {:era => :shoho, :e_y =>  3, :e_m => 12, :g_y => 1647, :g_m =>  1, :g_d =>  6},

             {:era => :shoho, :e_y =>  4, :e_m =>  1, :g_y => 1647, :g_m =>  2, :g_d =>  5},
             {:era => :shoho, :e_y =>  4, :e_m =>  2, :g_y => 1647, :g_m =>  3, :g_d =>  7},
             {:era => :shoho, :e_y =>  4, :e_m =>  3, :g_y => 1647, :g_m =>  4, :g_d =>  5},
             {:era => :shoho, :e_y =>  4, :e_m =>  4, :g_y => 1647, :g_m =>  5, :g_d =>  5},
             {:era => :shoho, :e_y =>  4, :e_m =>  5, :g_y => 1647, :g_m =>  6, :g_d =>  3},
             {:era => :shoho, :e_y =>  4, :e_m =>  6, :g_y => 1647, :g_m =>  7, :g_d =>  3},
             {:era => :shoho, :e_y =>  4, :e_m =>  7, :g_y => 1647, :g_m =>  8, :g_d =>  1},
             {:era => :shoho, :e_y =>  4, :e_m =>  8, :g_y => 1647, :g_m =>  8, :g_d => 30},
             {:era => :shoho, :e_y =>  4, :e_m =>  9, :g_y => 1647, :g_m =>  9, :g_d => 28},
             {:era => :shoho, :e_y =>  4, :e_m => 10, :g_y => 1647, :g_m => 10, :g_d => 28},
             {:era => :shoho, :e_y =>  4, :e_m => 11, :g_y => 1647, :g_m => 11, :g_d => 27},
             {:era => :shoho, :e_y =>  4, :e_m => 12, :g_y => 1647, :g_m => 12, :g_d => 26},

             {:era => :shoho, :e_y =>  5, :e_m =>  1, :g_y => 1648, :g_m =>  1, :g_d => 25},
             {:era => :shoho, :e_y =>  5, :e_m =>  1, :g_y => 1648, :g_m =>  2, :g_d => 24, :leap_month => true},
             {:era => :shoho, :e_y =>  5, :e_m =>  2, :g_y => 1648, :g_m =>  3, :g_d => 24},
             {:era => :shoho, :e_y =>  5, :e_m =>  3, :g_y => 1648, :g_m =>  4, :g_d => 23},
             {:era => :shoho, :e_y =>  5, :e_m =>  4, :g_y => 1648, :g_m =>  5, :g_d => 23},
             {:era => :shoho, :e_y =>  5, :e_m =>  5, :g_y => 1648, :g_m =>  6, :g_d => 21},
             {:era => :shoho, :e_y =>  5, :e_m =>  6, :g_y => 1648, :g_m =>  7, :g_d => 20},
             {:era => :shoho, :e_y =>  5, :e_m =>  7, :g_y => 1648, :g_m =>  8, :g_d => 19},
             {:era => :shoho, :e_y =>  5, :e_m =>  8, :g_y => 1648, :g_m =>  9, :g_d => 17},
             {:era => :shoho, :e_y =>  5, :e_m =>  9, :g_y => 1648, :g_m => 10, :g_d => 17},
             {:era => :shoho, :e_y =>  5, :e_m => 10, :g_y => 1648, :g_m => 11, :g_d => 15},
             {:era => :shoho, :e_y =>  5, :e_m => 11, :g_y => 1648, :g_m => 12, :g_d => 15},
             {:era => :shoho, :e_y =>  5, :e_m => 12, :g_y => 1649, :g_m =>  1, :g_d => 13},

            ]

    add_era_table table
  end # Date
end # Wareki
