# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Sh%C5%8Dtoku_(era)' # 
    # KANJI_ERA_NAME = '正徳'

    # 正徳
    # http://ja.wikipedia.org/wiki/%E6%AD%A3%E5%BE%B3_(%E6%97%A5%E6%9C%AC)
    # | 正徳元年 (辛卯)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1711/02/17 | 1711/03/19 | 1711/04/18 | 1711/05/18 | 1711/06/16 | 1711/07/16 | 1711/08/14 | 1711/09/13 | 1711/10/12 | 1711/11/10 | 1711/12/10 | 1712/01/08 |
    # | 正徳二年 (壬辰)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1712/02/07 | 1712/03/07 | 1712/04/06 | 1712/05/06 | 1712/06/04 | 1712/07/04 | 1712/08/02 | 1712/09/01 | 1712/10/01 | 1712/10/30 | 1712/11/29 | 1712/12/28 |
    # | 正徳三年 (癸巳)     |       一月 |       二月 |       三月 |       四月 |       五月 |     閏五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1713/01/26 | 1713/02/25 | 1713/03/26 | 1713/04/25 | 1713/05/24 | 1713/06/23 | 1713/07/22 | 1713/08/21 | 1713/09/20 | 1713/10/19 | 1713/11/18 | 1713/12/18 | 1714/01/16 |
    # | 正徳四年 (甲午)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1714/02/15 | 1714/03/16 | 1714/04/14 | 1714/05/14 | 1714/06/12 | 1714/07/12 | 1714/08/10 | 1714/09/09 | 1714/10/09 | 1714/11/07 | 1714/12/07 | 1715/01/06 |
    # | 正徳五年 (乙未)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1715/02/04 | 1715/03/06 | 1715/04/04 | 1715/05/03 | 1715/06/02 | 1715/07/01 | 1715/07/30 | 1715/08/29 | 1715/09/28 | 1715/10/27 | 1715/11/26 | 1715/12/26 |
    # | 正徳六年 (丙申)     |       一月 |       二月 |     閏二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1716/01/25 | 1716/02/23 | 1716/03/24 | 1716/04/22 | 1716/05/21 | 1716/06/20 | 1716/07/19 | 1716/08/17 | 1716/09/16 | 1716/10/15 | 1716/11/14 | 1716/12/14 | 1717/01/13 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :shotoku, :e_y =>  1, :e_m =>  1, :g_y => 1711, :g_m =>  2, :g_d => 17},
             {:era => :shotoku, :e_y =>  1, :e_m =>  2, :g_y => 1711, :g_m =>  3, :g_d => 19},
             {:era => :shotoku, :e_y =>  1, :e_m =>  3, :g_y => 1711, :g_m =>  4, :g_d => 18},
             {:era => :shotoku, :e_y =>  1, :e_m =>  4, :g_y => 1711, :g_m =>  5, :g_d => 18},
             {:era => :shotoku, :e_y =>  1, :e_m =>  5, :g_y => 1711, :g_m =>  6, :g_d => 16},
             {:era => :shotoku, :e_y =>  1, :e_m =>  6, :g_y => 1711, :g_m =>  7, :g_d => 16},
             {:era => :shotoku, :e_y =>  1, :e_m =>  7, :g_y => 1711, :g_m =>  8, :g_d => 14},
             {:era => :shotoku, :e_y =>  1, :e_m =>  8, :g_y => 1711, :g_m =>  9, :g_d => 13},
             {:era => :shotoku, :e_y =>  1, :e_m =>  9, :g_y => 1711, :g_m => 10, :g_d => 12},
             {:era => :shotoku, :e_y =>  1, :e_m => 10, :g_y => 1711, :g_m => 11, :g_d => 10},
             {:era => :shotoku, :e_y =>  1, :e_m => 11, :g_y => 1711, :g_m => 12, :g_d => 10},
             {:era => :shotoku, :e_y =>  1, :e_m => 12, :g_y => 1712, :g_m =>  1, :g_d =>  8},

             {:era => :shotoku, :e_y =>  2, :e_m =>  1, :g_y => 1712, :g_m =>  2, :g_d =>  7},
             {:era => :shotoku, :e_y =>  2, :e_m =>  2, :g_y => 1712, :g_m =>  3, :g_d =>  7},
             {:era => :shotoku, :e_y =>  2, :e_m =>  3, :g_y => 1712, :g_m =>  4, :g_d =>  6},
             {:era => :shotoku, :e_y =>  2, :e_m =>  4, :g_y => 1712, :g_m =>  5, :g_d =>  6},
             {:era => :shotoku, :e_y =>  2, :e_m =>  5, :g_y => 1712, :g_m =>  6, :g_d =>  4},
             {:era => :shotoku, :e_y =>  2, :e_m =>  6, :g_y => 1712, :g_m =>  7, :g_d =>  4},
             {:era => :shotoku, :e_y =>  2, :e_m =>  7, :g_y => 1712, :g_m =>  8, :g_d =>  2},
             {:era => :shotoku, :e_y =>  2, :e_m =>  8, :g_y => 1712, :g_m =>  9, :g_d =>  1},
             {:era => :shotoku, :e_y =>  2, :e_m =>  9, :g_y => 1712, :g_m => 10, :g_d =>  1},
             {:era => :shotoku, :e_y =>  2, :e_m => 10, :g_y => 1712, :g_m => 10, :g_d => 30},
             {:era => :shotoku, :e_y =>  2, :e_m => 11, :g_y => 1712, :g_m => 11, :g_d => 29},
             {:era => :shotoku, :e_y =>  2, :e_m => 12, :g_y => 1712, :g_m => 12, :g_d => 28},

             {:era => :shotoku, :e_y =>  3, :e_m =>  1, :g_y => 1713, :g_m =>  1, :g_d => 26},
             {:era => :shotoku, :e_y =>  3, :e_m =>  2, :g_y => 1713, :g_m =>  2, :g_d => 25},
             {:era => :shotoku, :e_y =>  3, :e_m =>  3, :g_y => 1713, :g_m =>  3, :g_d => 26},
             {:era => :shotoku, :e_y =>  3, :e_m =>  4, :g_y => 1713, :g_m =>  4, :g_d => 25},
             {:era => :shotoku, :e_y =>  3, :e_m =>  5, :g_y => 1713, :g_m =>  5, :g_d => 24},
             {:era => :shotoku, :e_y =>  3, :e_m =>  5, :g_y => 1713, :g_m =>  6, :g_d => 23, :leap_month => true},
             {:era => :shotoku, :e_y =>  3, :e_m =>  6, :g_y => 1713, :g_m =>  7, :g_d => 22},
             {:era => :shotoku, :e_y =>  3, :e_m =>  7, :g_y => 1713, :g_m =>  8, :g_d => 21},
             {:era => :shotoku, :e_y =>  3, :e_m =>  8, :g_y => 1713, :g_m =>  9, :g_d => 20},
             {:era => :shotoku, :e_y =>  3, :e_m =>  9, :g_y => 1713, :g_m => 10, :g_d => 19},
             {:era => :shotoku, :e_y =>  3, :e_m => 10, :g_y => 1713, :g_m => 11, :g_d => 18},
             {:era => :shotoku, :e_y =>  3, :e_m => 11, :g_y => 1713, :g_m => 12, :g_d => 18},
             {:era => :shotoku, :e_y =>  3, :e_m => 12, :g_y => 1714, :g_m =>  1, :g_d => 16},

             {:era => :shotoku, :e_y =>  4, :e_m =>  1, :g_y => 1714, :g_m =>  2, :g_d => 15},
             {:era => :shotoku, :e_y =>  4, :e_m =>  2, :g_y => 1714, :g_m =>  3, :g_d => 16},
             {:era => :shotoku, :e_y =>  4, :e_m =>  3, :g_y => 1714, :g_m =>  4, :g_d => 14},
             {:era => :shotoku, :e_y =>  4, :e_m =>  4, :g_y => 1714, :g_m =>  5, :g_d => 14},
             {:era => :shotoku, :e_y =>  4, :e_m =>  5, :g_y => 1714, :g_m =>  6, :g_d => 12},
             {:era => :shotoku, :e_y =>  4, :e_m =>  6, :g_y => 1714, :g_m =>  7, :g_d => 12},
             {:era => :shotoku, :e_y =>  4, :e_m =>  7, :g_y => 1714, :g_m =>  8, :g_d => 10},
             {:era => :shotoku, :e_y =>  4, :e_m =>  8, :g_y => 1714, :g_m =>  9, :g_d =>  9},
             {:era => :shotoku, :e_y =>  4, :e_m =>  9, :g_y => 1714, :g_m => 10, :g_d =>  9},
             {:era => :shotoku, :e_y =>  4, :e_m => 10, :g_y => 1714, :g_m => 11, :g_d =>  7},
             {:era => :shotoku, :e_y =>  4, :e_m => 11, :g_y => 1714, :g_m => 12, :g_d =>  7},
             {:era => :shotoku, :e_y =>  4, :e_m => 12, :g_y => 1715, :g_m =>  1, :g_d =>  6},

             {:era => :shotoku, :e_y =>  5, :e_m =>  1, :g_y => 1715, :g_m =>  2, :g_d =>  4},
             {:era => :shotoku, :e_y =>  5, :e_m =>  2, :g_y => 1715, :g_m =>  3, :g_d =>  6},
             {:era => :shotoku, :e_y =>  5, :e_m =>  3, :g_y => 1715, :g_m =>  4, :g_d =>  4},
             {:era => :shotoku, :e_y =>  5, :e_m =>  4, :g_y => 1715, :g_m =>  5, :g_d =>  3},
             {:era => :shotoku, :e_y =>  5, :e_m =>  5, :g_y => 1715, :g_m =>  6, :g_d =>  2},
             {:era => :shotoku, :e_y =>  5, :e_m =>  6, :g_y => 1715, :g_m =>  7, :g_d =>  1},
             {:era => :shotoku, :e_y =>  5, :e_m =>  7, :g_y => 1715, :g_m =>  7, :g_d => 30},
             {:era => :shotoku, :e_y =>  5, :e_m =>  8, :g_y => 1715, :g_m =>  8, :g_d => 29},
             {:era => :shotoku, :e_y =>  5, :e_m =>  9, :g_y => 1715, :g_m =>  9, :g_d => 28},
             {:era => :shotoku, :e_y =>  5, :e_m => 10, :g_y => 1715, :g_m => 10, :g_d => 27},
             {:era => :shotoku, :e_y =>  5, :e_m => 11, :g_y => 1715, :g_m => 11, :g_d => 26},
             {:era => :shotoku, :e_y =>  5, :e_m => 12, :g_y => 1715, :g_m => 12, :g_d => 26},

             {:era => :shotoku, :e_y =>  6, :e_m =>  1, :g_y => 1716, :g_m =>  1, :g_d => 25},
             {:era => :shotoku, :e_y =>  6, :e_m =>  2, :g_y => 1716, :g_m =>  2, :g_d => 23},
             {:era => :shotoku, :e_y =>  6, :e_m =>  2, :g_y => 1716, :g_m =>  3, :g_d => 24, :leap_month => true},
             {:era => :shotoku, :e_y =>  6, :e_m =>  3, :g_y => 1716, :g_m =>  4, :g_d => 22},
             {:era => :shotoku, :e_y =>  6, :e_m =>  4, :g_y => 1716, :g_m =>  5, :g_d => 21},
             {:era => :shotoku, :e_y =>  6, :e_m =>  5, :g_y => 1716, :g_m =>  6, :g_d => 20},
             {:era => :shotoku, :e_y =>  6, :e_m =>  6, :g_y => 1716, :g_m =>  7, :g_d => 19},
             {:era => :shotoku, :e_y =>  6, :e_m =>  7, :g_y => 1716, :g_m =>  8, :g_d => 17},
             {:era => :shotoku, :e_y =>  6, :e_m =>  8, :g_y => 1716, :g_m =>  9, :g_d => 16},
             {:era => :shotoku, :e_y =>  6, :e_m =>  9, :g_y => 1716, :g_m => 10, :g_d => 15},
             {:era => :shotoku, :e_y =>  6, :e_m => 10, :g_y => 1716, :g_m => 11, :g_d => 14},
             {:era => :shotoku, :e_y =>  6, :e_m => 11, :g_y => 1716, :g_m => 12, :g_d => 14},
             {:era => :shotoku, :e_y =>  6, :e_m => 12, :g_y => 1717, :g_m =>  1, :g_d => 13},

            ]

    add_era_table table
  end # Date
end # Wareki
