# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Tenmei' # 
    # KANJI_ERA_NAME = '天明'

    # 天明
    # http://ja.wikipedia.org/wiki/%E5%A4%A9%E6%98%8E
    # | 天明元年 (辛丑)     |       一月 |       二月 |       三月 |       四月 |       五月 |     閏五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1781/01/24 | 1781/02/23 | 1781/03/25 | 1781/04/24 | 1781/05/23 | 1781/06/22 | 1781/07/21 | 1781/08/20 | 1781/09/18 | 1781/10/17 | 1781/11/16 | 1781/12/15 | 1782/01/14 |
    # | 天明二年 (壬寅)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1782/02/12 | 1782/03/14 | 1782/04/13 | 1782/05/12 | 1782/06/11 | 1782/07/10 | 1782/08/09 | 1782/09/07 | 1782/10/07 | 1782/11/05 | 1782/12/05 | 1783/01/03 |
    # | 天明三年 (癸卯)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1783/02/02 | 1783/03/03 | 1783/04/02 | 1783/05/01 | 1783/05/31 | 1783/06/30 | 1783/07/29 | 1783/08/28 | 1783/09/26 | 1783/10/26 | 1783/11/24 | 1783/12/24 |
    # | 天明四年 (甲辰)     |       一月 |     閏一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1784/01/22 | 1784/02/21 | 1784/03/21 | 1784/04/20 | 1784/05/19 | 1784/06/18 | 1784/07/17 | 1784/08/16 | 1784/09/15 | 1784/10/14 | 1784/11/13 | 1784/12/12 | 1785/01/11 |
    # | 天明五年 (乙巳)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1785/02/09 | 1785/03/11 | 1785/04/09 | 1785/05/09 | 1785/06/07 | 1785/07/06 | 1785/08/05 | 1785/09/04 | 1785/10/03 | 1785/11/02 | 1785/12/02 | 1785/12/31 |
    # | 天明六年 (丙午)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     閏十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1786/01/30 | 1786/02/28 | 1786/03/30 | 1786/04/28 | 1786/05/28 | 1786/06/26 | 1786/07/25 | 1786/08/24 | 1786/09/22 | 1786/10/22 | 1786/11/21 | 1786/12/21 | 1787/01/19 |
    # | 天明七年 (丁未)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1787/02/18 | 1787/03/20 | 1787/04/18 | 1787/05/17 | 1787/06/16 | 1787/07/15 | 1787/08/13 | 1787/09/12 | 1787/10/11 | 1787/11/10 | 1787/12/10 | 1788/01/08 |
    # | 天明八年 (戊申)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1788/02/07 | 1788/03/08 | 1788/04/06 | 1788/05/06 | 1788/06/04 | 1788/07/04 | 1788/08/02 | 1788/08/31 | 1788/09/30 | 1788/10/29 | 1788/11/28 | 1788/12/27 |
    # | 天明九年 (己酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |     閏六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1789/01/26 | 1789/02/25 | 1789/03/27 | 1789/04/25 | 1789/05/25 | 1789/06/23 | 1789/07/23 | 1789/08/21 | 1789/09/19 | 1789/10/19 | 1789/11/17 | 1789/12/17 | 1790/01/15 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :tenmei, :e_y =>  1, :e_m =>  1, :g_y => 1781, :g_m =>  1, :g_d => 24},
             {:era => :tenmei, :e_y =>  1, :e_m =>  2, :g_y => 1781, :g_m =>  2, :g_d => 23},
             {:era => :tenmei, :e_y =>  1, :e_m =>  3, :g_y => 1781, :g_m =>  3, :g_d => 25},
             {:era => :tenmei, :e_y =>  1, :e_m =>  4, :g_y => 1781, :g_m =>  4, :g_d => 24},
             {:era => :tenmei, :e_y =>  1, :e_m =>  5, :g_y => 1781, :g_m =>  5, :g_d => 23},
             {:era => :tenmei, :e_y =>  1, :e_m =>  5, :g_y => 1781, :g_m =>  6, :g_d => 22, :leap_month => true},
             {:era => :tenmei, :e_y =>  1, :e_m =>  6, :g_y => 1781, :g_m =>  7, :g_d => 21},
             {:era => :tenmei, :e_y =>  1, :e_m =>  7, :g_y => 1781, :g_m =>  8, :g_d => 20},
             {:era => :tenmei, :e_y =>  1, :e_m =>  8, :g_y => 1781, :g_m =>  9, :g_d => 18},
             {:era => :tenmei, :e_y =>  1, :e_m =>  9, :g_y => 1781, :g_m => 10, :g_d => 17},
             {:era => :tenmei, :e_y =>  1, :e_m => 10, :g_y => 1781, :g_m => 11, :g_d => 16},
             {:era => :tenmei, :e_y =>  1, :e_m => 11, :g_y => 1781, :g_m => 12, :g_d => 15},
             {:era => :tenmei, :e_y =>  1, :e_m => 12, :g_y => 1782, :g_m =>  1, :g_d => 14},

             {:era => :tenmei, :e_y =>  2, :e_m =>  1, :g_y => 1782, :g_m =>  2, :g_d => 12},
             {:era => :tenmei, :e_y =>  2, :e_m =>  2, :g_y => 1782, :g_m =>  3, :g_d => 14},
             {:era => :tenmei, :e_y =>  2, :e_m =>  3, :g_y => 1782, :g_m =>  4, :g_d => 13},
             {:era => :tenmei, :e_y =>  2, :e_m =>  4, :g_y => 1782, :g_m =>  5, :g_d => 12},
             {:era => :tenmei, :e_y =>  2, :e_m =>  5, :g_y => 1782, :g_m =>  6, :g_d => 11},
             {:era => :tenmei, :e_y =>  2, :e_m =>  6, :g_y => 1782, :g_m =>  7, :g_d => 10},
             {:era => :tenmei, :e_y =>  2, :e_m =>  7, :g_y => 1782, :g_m =>  8, :g_d =>  9},
             {:era => :tenmei, :e_y =>  2, :e_m =>  8, :g_y => 1782, :g_m =>  9, :g_d =>  7},
             {:era => :tenmei, :e_y =>  2, :e_m =>  9, :g_y => 1782, :g_m => 10, :g_d =>  7},
             {:era => :tenmei, :e_y =>  2, :e_m => 10, :g_y => 1782, :g_m => 11, :g_d =>  5},
             {:era => :tenmei, :e_y =>  2, :e_m => 11, :g_y => 1782, :g_m => 12, :g_d =>  5},
             {:era => :tenmei, :e_y =>  2, :e_m => 12, :g_y => 1783, :g_m =>  1, :g_d =>  3},

             {:era => :tenmei, :e_y =>  3, :e_m =>  1, :g_y => 1783, :g_m =>  2, :g_d =>  2},
             {:era => :tenmei, :e_y =>  3, :e_m =>  2, :g_y => 1783, :g_m =>  3, :g_d =>  3},
             {:era => :tenmei, :e_y =>  3, :e_m =>  3, :g_y => 1783, :g_m =>  4, :g_d =>  2},
             {:era => :tenmei, :e_y =>  3, :e_m =>  4, :g_y => 1783, :g_m =>  5, :g_d =>  1},
             {:era => :tenmei, :e_y =>  3, :e_m =>  5, :g_y => 1783, :g_m =>  5, :g_d => 31},
             {:era => :tenmei, :e_y =>  3, :e_m =>  6, :g_y => 1783, :g_m =>  6, :g_d => 30},
             {:era => :tenmei, :e_y =>  3, :e_m =>  7, :g_y => 1783, :g_m =>  7, :g_d => 29},
             {:era => :tenmei, :e_y =>  3, :e_m =>  8, :g_y => 1783, :g_m =>  8, :g_d => 28},
             {:era => :tenmei, :e_y =>  3, :e_m =>  9, :g_y => 1783, :g_m =>  9, :g_d => 26},
             {:era => :tenmei, :e_y =>  3, :e_m => 10, :g_y => 1783, :g_m => 10, :g_d => 26},
             {:era => :tenmei, :e_y =>  3, :e_m => 11, :g_y => 1783, :g_m => 11, :g_d => 24},
             {:era => :tenmei, :e_y =>  3, :e_m => 12, :g_y => 1783, :g_m => 12, :g_d => 24},

             {:era => :tenmei, :e_y =>  4, :e_m =>  1, :g_y => 1784, :g_m =>  1, :g_d => 22},
             {:era => :tenmei, :e_y =>  4, :e_m =>  1, :g_y => 1784, :g_m =>  2, :g_d => 21, :leap_month => true},
             {:era => :tenmei, :e_y =>  4, :e_m =>  2, :g_y => 1784, :g_m =>  3, :g_d => 21},
             {:era => :tenmei, :e_y =>  4, :e_m =>  3, :g_y => 1784, :g_m =>  4, :g_d => 20},
             {:era => :tenmei, :e_y =>  4, :e_m =>  4, :g_y => 1784, :g_m =>  5, :g_d => 19},
             {:era => :tenmei, :e_y =>  4, :e_m =>  5, :g_y => 1784, :g_m =>  6, :g_d => 18},
             {:era => :tenmei, :e_y =>  4, :e_m =>  6, :g_y => 1784, :g_m =>  7, :g_d => 17},
             {:era => :tenmei, :e_y =>  4, :e_m =>  7, :g_y => 1784, :g_m =>  8, :g_d => 16},
             {:era => :tenmei, :e_y =>  4, :e_m =>  8, :g_y => 1784, :g_m =>  9, :g_d => 15},
             {:era => :tenmei, :e_y =>  4, :e_m =>  9, :g_y => 1784, :g_m => 10, :g_d => 14},
             {:era => :tenmei, :e_y =>  4, :e_m => 10, :g_y => 1784, :g_m => 11, :g_d => 13},
             {:era => :tenmei, :e_y =>  4, :e_m => 11, :g_y => 1784, :g_m => 12, :g_d => 12},
             {:era => :tenmei, :e_y =>  4, :e_m => 12, :g_y => 1785, :g_m =>  1, :g_d => 11},

             {:era => :tenmei, :e_y =>  5, :e_m =>  1, :g_y => 1785, :g_m =>  2, :g_d =>  9},
             {:era => :tenmei, :e_y =>  5, :e_m =>  2, :g_y => 1785, :g_m =>  3, :g_d => 11},
             {:era => :tenmei, :e_y =>  5, :e_m =>  3, :g_y => 1785, :g_m =>  4, :g_d =>  9},
             {:era => :tenmei, :e_y =>  5, :e_m =>  4, :g_y => 1785, :g_m =>  5, :g_d =>  9},
             {:era => :tenmei, :e_y =>  5, :e_m =>  5, :g_y => 1785, :g_m =>  6, :g_d =>  7},
             {:era => :tenmei, :e_y =>  5, :e_m =>  6, :g_y => 1785, :g_m =>  7, :g_d =>  6},
             {:era => :tenmei, :e_y =>  5, :e_m =>  7, :g_y => 1785, :g_m =>  8, :g_d =>  5},
             {:era => :tenmei, :e_y =>  5, :e_m =>  8, :g_y => 1785, :g_m =>  9, :g_d =>  4},
             {:era => :tenmei, :e_y =>  5, :e_m =>  9, :g_y => 1785, :g_m => 10, :g_d =>  3},
             {:era => :tenmei, :e_y =>  5, :e_m => 10, :g_y => 1785, :g_m => 11, :g_d =>  2},
             {:era => :tenmei, :e_y =>  5, :e_m => 11, :g_y => 1785, :g_m => 12, :g_d =>  2},
             {:era => :tenmei, :e_y =>  5, :e_m => 12, :g_y => 1785, :g_m => 12, :g_d => 31},

             {:era => :tenmei, :e_y =>  6, :e_m =>  1, :g_y => 1786, :g_m =>  1, :g_d => 30},
             {:era => :tenmei, :e_y =>  6, :e_m =>  2, :g_y => 1786, :g_m =>  2, :g_d => 28},
             {:era => :tenmei, :e_y =>  6, :e_m =>  3, :g_y => 1786, :g_m =>  3, :g_d => 30},
             {:era => :tenmei, :e_y =>  6, :e_m =>  4, :g_y => 1786, :g_m =>  4, :g_d => 28},
             {:era => :tenmei, :e_y =>  6, :e_m =>  5, :g_y => 1786, :g_m =>  5, :g_d => 28},
             {:era => :tenmei, :e_y =>  6, :e_m =>  6, :g_y => 1786, :g_m =>  6, :g_d => 26},
             {:era => :tenmei, :e_y =>  6, :e_m =>  7, :g_y => 1786, :g_m =>  7, :g_d => 25},
             {:era => :tenmei, :e_y =>  6, :e_m =>  8, :g_y => 1786, :g_m =>  8, :g_d => 24},
             {:era => :tenmei, :e_y =>  6, :e_m =>  9, :g_y => 1786, :g_m =>  9, :g_d => 22},
             {:era => :tenmei, :e_y =>  6, :e_m => 10, :g_y => 1786, :g_m => 10, :g_d => 22},
             {:era => :tenmei, :e_y =>  6, :e_m => 10, :g_y => 1786, :g_m => 11, :g_d => 21, :leap_month => true},
             {:era => :tenmei, :e_y =>  6, :e_m => 11, :g_y => 1786, :g_m => 12, :g_d => 21},
             {:era => :tenmei, :e_y =>  6, :e_m => 12, :g_y => 1787, :g_m =>  1, :g_d => 19},

             {:era => :tenmei, :e_y =>  7, :e_m =>  1, :g_y => 1787, :g_m =>  2, :g_d => 18},
             {:era => :tenmei, :e_y =>  7, :e_m =>  2, :g_y => 1787, :g_m =>  3, :g_d => 20},
             {:era => :tenmei, :e_y =>  7, :e_m =>  3, :g_y => 1787, :g_m =>  4, :g_d => 18},
             {:era => :tenmei, :e_y =>  7, :e_m =>  4, :g_y => 1787, :g_m =>  5, :g_d => 17},
             {:era => :tenmei, :e_y =>  7, :e_m =>  5, :g_y => 1787, :g_m =>  6, :g_d => 16},
             {:era => :tenmei, :e_y =>  7, :e_m =>  6, :g_y => 1787, :g_m =>  7, :g_d => 15},
             {:era => :tenmei, :e_y =>  7, :e_m =>  7, :g_y => 1787, :g_m =>  8, :g_d => 13},
             {:era => :tenmei, :e_y =>  7, :e_m =>  8, :g_y => 1787, :g_m =>  9, :g_d => 12},
             {:era => :tenmei, :e_y =>  7, :e_m =>  9, :g_y => 1787, :g_m => 10, :g_d => 11},
             {:era => :tenmei, :e_y =>  7, :e_m => 10, :g_y => 1787, :g_m => 11, :g_d => 10},
             {:era => :tenmei, :e_y =>  7, :e_m => 11, :g_y => 1787, :g_m => 12, :g_d => 10},
             {:era => :tenmei, :e_y =>  7, :e_m => 12, :g_y => 1788, :g_m =>  1, :g_d =>  8},

             {:era => :tenmei, :e_y =>  8, :e_m =>  1, :g_y => 1788, :g_m =>  2, :g_d =>  7},
             {:era => :tenmei, :e_y =>  8, :e_m =>  2, :g_y => 1788, :g_m =>  3, :g_d =>  8},
             {:era => :tenmei, :e_y =>  8, :e_m =>  3, :g_y => 1788, :g_m =>  4, :g_d =>  6},
             {:era => :tenmei, :e_y =>  8, :e_m =>  4, :g_y => 1788, :g_m =>  5, :g_d =>  6},
             {:era => :tenmei, :e_y =>  8, :e_m =>  5, :g_y => 1788, :g_m =>  6, :g_d =>  4},
             {:era => :tenmei, :e_y =>  8, :e_m =>  6, :g_y => 1788, :g_m =>  7, :g_d =>  4},
             {:era => :tenmei, :e_y =>  8, :e_m =>  7, :g_y => 1788, :g_m =>  8, :g_d =>  2},
             {:era => :tenmei, :e_y =>  8, :e_m =>  8, :g_y => 1788, :g_m =>  8, :g_d => 31},
             {:era => :tenmei, :e_y =>  8, :e_m =>  9, :g_y => 1788, :g_m =>  9, :g_d => 30},
             {:era => :tenmei, :e_y =>  8, :e_m => 10, :g_y => 1788, :g_m => 10, :g_d => 29},
             {:era => :tenmei, :e_y =>  8, :e_m => 11, :g_y => 1788, :g_m => 11, :g_d => 28},
             {:era => :tenmei, :e_y =>  8, :e_m => 12, :g_y => 1788, :g_m => 12, :g_d => 27},

             {:era => :tenmei, :e_y =>  9, :e_m =>  1, :g_y => 1789, :g_m =>  1, :g_d => 26},
             {:era => :tenmei, :e_y =>  9, :e_m =>  2, :g_y => 1789, :g_m =>  2, :g_d => 25},
             {:era => :tenmei, :e_y =>  9, :e_m =>  3, :g_y => 1789, :g_m =>  3, :g_d => 27},
             {:era => :tenmei, :e_y =>  9, :e_m =>  4, :g_y => 1789, :g_m =>  4, :g_d => 25},
             {:era => :tenmei, :e_y =>  9, :e_m =>  5, :g_y => 1789, :g_m =>  5, :g_d => 25},
             {:era => :tenmei, :e_y =>  9, :e_m =>  6, :g_y => 1789, :g_m =>  6, :g_d => 23},
             {:era => :tenmei, :e_y =>  9, :e_m =>  6, :g_y => 1789, :g_m =>  7, :g_d => 23, :leap_month => true},
             {:era => :tenmei, :e_y =>  9, :e_m =>  7, :g_y => 1789, :g_m =>  8, :g_d => 21},
             {:era => :tenmei, :e_y =>  9, :e_m =>  8, :g_y => 1789, :g_m =>  9, :g_d => 19},
             {:era => :tenmei, :e_y =>  9, :e_m =>  9, :g_y => 1789, :g_m => 10, :g_d => 19},
             {:era => :tenmei, :e_y =>  9, :e_m => 10, :g_y => 1789, :g_m => 11, :g_d => 17},
             {:era => :tenmei, :e_y =>  9, :e_m => 11, :g_y => 1789, :g_m => 12, :g_d => 17},
             {:era => :tenmei, :e_y =>  9, :e_m => 12, :g_y => 1790, :g_m =>  1, :g_d => 15},

            ]

    add_era_table table
  end # Date
end # Wareki
