# -*- coding: utf-8 -*-

module Wareki
  module Date
    # ERA_NAME = 'Tenna' # 
    # KANJI_ERA_NAME = '天和'

    # 天和
    # http://ja.wikipedia.org/wiki/%E5%A4%A9%E5%92%8C_(%E6%97%A5%E6%9C%AC)
    # | 天和元年 (辛酉)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1681/02/19 | 1681/03/20 | 1681/04/19 | 1681/05/18 | 1681/06/16 | 1681/07/15 | 1681/08/14 | 1681/09/12 | 1681/10/12 | 1681/11/10 | 1681/12/10 | 1682/01/09 |
    # | 天和二年 (壬戌)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1682/02/08 | 1682/03/09 | 1682/04/08 | 1682/05/08 | 1682/06/06 | 1682/07/05 | 1682/08/03 | 1682/09/02 | 1682/10/01 | 1682/10/31 | 1682/11/29 | 1682/12/29 |
    # | 天和三年 (癸亥)     |       一月 |       二月 |       三月 |       四月 |       五月 |     閏五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1683/01/28 | 1683/02/27 | 1683/03/28 | 1683/04/27 | 1683/05/26 | 1683/06/25 | 1683/07/24 | 1683/08/22 | 1683/09/21 | 1683/10/20 | 1683/11/19 | 1683/12/18 | 1684/01/17 |
    # | 天和四年 (甲子)     |       一月 |       二月 |       三月 |       四月 |       五月 |       六月 |       七月 |       八月 |       九月 |       十月 |     十一月 |     十二月 |
    # |        グレゴリオ暦 | 1684/02/16 | 1684/03/16 | 1684/04/15 | 1684/05/15 | 1684/06/13 | 1684/07/13 | 1684/08/11 | 1684/09/10 | 1684/10/09 | 1684/11/07 | 1684/12/07 | 1685/01/05 |

    # e_y: era_year
    # e_m: era_month
    # g_y: gregorian_year
    # g_m: gregorian_month
    # g_d: gregorian_mday
    table = [
             {:era => :tenna, :e_y =>  1, :e_m =>  1, :g_y => 1681, :g_m =>  2, :g_d => 19},
             {:era => :tenna, :e_y =>  1, :e_m =>  2, :g_y => 1681, :g_m =>  3, :g_d => 20},
             {:era => :tenna, :e_y =>  1, :e_m =>  3, :g_y => 1681, :g_m =>  4, :g_d => 19},
             {:era => :tenna, :e_y =>  1, :e_m =>  4, :g_y => 1681, :g_m =>  5, :g_d => 18},
             {:era => :tenna, :e_y =>  1, :e_m =>  5, :g_y => 1681, :g_m =>  6, :g_d => 16},
             {:era => :tenna, :e_y =>  1, :e_m =>  6, :g_y => 1681, :g_m =>  7, :g_d => 15},
             {:era => :tenna, :e_y =>  1, :e_m =>  7, :g_y => 1681, :g_m =>  8, :g_d => 14},
             {:era => :tenna, :e_y =>  1, :e_m =>  8, :g_y => 1681, :g_m =>  9, :g_d => 12},
             {:era => :tenna, :e_y =>  1, :e_m =>  9, :g_y => 1681, :g_m => 10, :g_d => 12},
             {:era => :tenna, :e_y =>  1, :e_m => 10, :g_y => 1681, :g_m => 11, :g_d => 10},
             {:era => :tenna, :e_y =>  1, :e_m => 11, :g_y => 1681, :g_m => 12, :g_d => 10},
             {:era => :tenna, :e_y =>  1, :e_m => 12, :g_y => 1682, :g_m =>  1, :g_d =>  9},

             {:era => :tenna, :e_y =>  2, :e_m =>  1, :g_y => 1682, :g_m =>  2, :g_d =>  8},
             {:era => :tenna, :e_y =>  2, :e_m =>  2, :g_y => 1682, :g_m =>  3, :g_d =>  9},
             {:era => :tenna, :e_y =>  2, :e_m =>  3, :g_y => 1682, :g_m =>  4, :g_d =>  8},
             {:era => :tenna, :e_y =>  2, :e_m =>  4, :g_y => 1682, :g_m =>  5, :g_d =>  8},
             {:era => :tenna, :e_y =>  2, :e_m =>  5, :g_y => 1682, :g_m =>  6, :g_d =>  6},
             {:era => :tenna, :e_y =>  2, :e_m =>  6, :g_y => 1682, :g_m =>  7, :g_d =>  5},
             {:era => :tenna, :e_y =>  2, :e_m =>  7, :g_y => 1682, :g_m =>  8, :g_d =>  3},
             {:era => :tenna, :e_y =>  2, :e_m =>  8, :g_y => 1682, :g_m =>  9, :g_d =>  2},
             {:era => :tenna, :e_y =>  2, :e_m =>  9, :g_y => 1682, :g_m => 10, :g_d =>  1},
             {:era => :tenna, :e_y =>  2, :e_m => 10, :g_y => 1682, :g_m => 10, :g_d => 31},
             {:era => :tenna, :e_y =>  2, :e_m => 11, :g_y => 1682, :g_m => 11, :g_d => 29},
             {:era => :tenna, :e_y =>  2, :e_m => 12, :g_y => 1682, :g_m => 12, :g_d => 29},

             {:era => :tenna, :e_y =>  3, :e_m =>  1, :g_y => 1683, :g_m =>  1, :g_d => 28},
             {:era => :tenna, :e_y =>  3, :e_m =>  2, :g_y => 1683, :g_m =>  2, :g_d => 27},
             {:era => :tenna, :e_y =>  3, :e_m =>  3, :g_y => 1683, :g_m =>  3, :g_d => 28},
             {:era => :tenna, :e_y =>  3, :e_m =>  4, :g_y => 1683, :g_m =>  4, :g_d => 27},
             {:era => :tenna, :e_y =>  3, :e_m =>  5, :g_y => 1683, :g_m =>  5, :g_d => 26},
             {:era => :tenna, :e_y =>  3, :e_m =>  5, :g_y => 1683, :g_m =>  6, :g_d => 25, :leap_month => true},
             {:era => :tenna, :e_y =>  3, :e_m =>  6, :g_y => 1683, :g_m =>  7, :g_d => 24},
             {:era => :tenna, :e_y =>  3, :e_m =>  7, :g_y => 1683, :g_m =>  8, :g_d => 22},
             {:era => :tenna, :e_y =>  3, :e_m =>  8, :g_y => 1683, :g_m =>  9, :g_d => 21},
             {:era => :tenna, :e_y =>  3, :e_m =>  9, :g_y => 1683, :g_m => 10, :g_d => 20},
             {:era => :tenna, :e_y =>  3, :e_m => 10, :g_y => 1683, :g_m => 11, :g_d => 19},
             {:era => :tenna, :e_y =>  3, :e_m => 11, :g_y => 1683, :g_m => 12, :g_d => 18},
             {:era => :tenna, :e_y =>  3, :e_m => 12, :g_y => 1684, :g_m =>  1, :g_d => 17},

             {:era => :tenna, :e_y =>  4, :e_m =>  1, :g_y => 1684, :g_m =>  2, :g_d => 16},
             {:era => :tenna, :e_y =>  4, :e_m =>  2, :g_y => 1684, :g_m =>  3, :g_d => 16},
             {:era => :tenna, :e_y =>  4, :e_m =>  3, :g_y => 1684, :g_m =>  4, :g_d => 15},
             {:era => :tenna, :e_y =>  4, :e_m =>  4, :g_y => 1684, :g_m =>  5, :g_d => 15},
             {:era => :tenna, :e_y =>  4, :e_m =>  5, :g_y => 1684, :g_m =>  6, :g_d => 13},
             {:era => :tenna, :e_y =>  4, :e_m =>  6, :g_y => 1684, :g_m =>  7, :g_d => 13},
             {:era => :tenna, :e_y =>  4, :e_m =>  7, :g_y => 1684, :g_m =>  8, :g_d => 11},
             {:era => :tenna, :e_y =>  4, :e_m =>  8, :g_y => 1684, :g_m =>  9, :g_d => 10},
             {:era => :tenna, :e_y =>  4, :e_m =>  9, :g_y => 1684, :g_m => 10, :g_d =>  9},
             {:era => :tenna, :e_y =>  4, :e_m => 10, :g_y => 1684, :g_m => 11, :g_d =>  7},
             {:era => :tenna, :e_y =>  4, :e_m => 11, :g_y => 1684, :g_m => 12, :g_d =>  7},
             {:era => :tenna, :e_y =>  4, :e_m => 12, :g_y => 1685, :g_m =>  1, :g_d =>  5},

            ]

    add_era_table table
  end # Date
end # Wareki
